Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/collaborative-development.po
Languages: ca, es

source: However many conditions are included in the contract, if the winning company has no experience of participating in free software projects, it is most likely that the product and the development process will end up not following many free software development conventions. In most cases, there is no reason why that should be the result of bad faith but a lack of knowledge.
ca: Per moltes condicions que es posin al contracte, si l’empresa adjudicatària no té experiència participant en projectes de codi obert, el més probable és que el producte no acabi sent obert del tot. En la majoria de casos això no té perquè ser resultat d’una mala disposició, sinó fruit del desconeixement.
es: Por muchas condiciones que se pongan en el contrato, si la empresa adjudicataria no tiene experiencia participando en proyectos de software libre, lo más probable es que el producto acabe no siguiendo muchas de sus convenciones. En la mayoría de casos eso no tiene por qué ser resultado de una mala disposición, sino fruto del desconocimiento.

source: Enter into a subsidiary independent validation and verification (IV&V) contract
ca: Fer un contracte secundari de validació i verificació independent (IV&V)
es: Hacer un contrato secundario de validación y verificación independiente (IV&V)

source: Hire a company that does have proven experience of sustained participation in free software projects. This company will act as an external project collaborator and carry out code checks and process analyses, reporting directly to IMI.
ca: Contractar alguna entitat que sí tingui experiència demostrable en participar de manera sostinguda en projectes de codi obert. Aquesta entitat actuarà com un col·laborador extern del projecte i farà revisions de codi i anàlisis de processos, reportant directament a l’IMI.
es: Hay que contratar a alguna entidad que sí tenga experiencia demostrable en la participación de manera sostenida en proyectos de software libre. Esta entidad actuará como colaborador externo del proyecto y hará revisiones de código y análisis de procesos, reportando directamente al IMI.

source: In an free software project, what is being contracted is not just the code but also the process.
ca: En un projecte de codi obert el que s’està contractant no és només el codi, sinó també el procés.
es: En un proyecto de software libre, lo que se está contratando no es solo el código, sino también el proceso.

source: Add this service to the project technical office.
ca: Afegir aquest servei a la oficina tècnica del projecte.
es: Hay que añadir este servicio a la oficina técnica del proyecto.

source: Include experience in free software projects as an award criterion
ca: Incloure com a criteri d’adjudicació l’experiència en projectes de codi obert
es: Incluir como criterio de adjudicación la experiencia en proyectos de código abierto

source: Award a set number of points to companies that can certify experience in projects that have produced free software.
ca: Adjudicar un determinat nombre de punts a les empreses que acreditin experiència en projectes on s’ha produït programari lliure treballant en obert.
es: Hay que adjudicar un determinado número de puntos a las empresas que acrediten experiencia en proyectos en los que se ha producido software.

source: Ask tenderers to provide evidence of participants' experience in free software projects
ca: Demanar als concursants que acreditin experiència en projectes de codi obert dels participants
es: Pedir a los concursantes que acrediten experiencia en proyectos de software libre de los participantes

source: They must do this by providing references for their individual participation in public repositories and forums (StackOverflow, etc.), from projects they have taken part in.
ca: Ho han de fer aportant referències a la seva participació individual en repositoris i fòrums oberts (StackOverflow, etc.), dels projectes en que hagin participat.
es: Tienen que hacerlo aportando referencias a su participación individual en repositorios y foros públicos (StackOverflow, etcétera) de los proyectos en los que hayan participado.

source: This can be done as a technical solvency criterion or a performance criterion.
ca: Es pot fer constar aquesta demanda com a criteri de solvència tècnica o com a criteri d’execució.
es: Se puede hacer constar esta demanda como criterio de solvencia técnica o como criterio de ejecución.

source: Split the project into groups of features that can be tendered in various lots
ca: Partir el projecte en grups de funcionalitat que es puguin licitar en diferents lots
es: Partir el proyecto en grupos de funcionalidad que se puedan licitar en diferentes lotes

source: Either by contracting by lots or by outsourcing specific tasks such as checking the code and its deployment, as established by the link:#fer-contracte-validacio-independent[Alternative: Enter into a subsidiary independent validation and verification (IV&V) contract].
ca: Bé sigui contractant per lots, bé sigui externalitzant tasques concretes com la revisió de codi i del desplegament, com estableix la link:#fer-contracte-validacio-independent[Alternativa: Fer un contracte secundari de validació i verificació (IV&V) independent].
es: Ya sea contratando por lotes o externalizando tareas concretas como la revisión de código y del despliegue, como establece la alternativa link:#fer-contracte-validacio-independent[“Hacer un contrato secundario de validación y verificación (V&V) independiente”].

source: Besides being a policy in line with the Guide for Technological Procurement, disseminating knowledge of the product is very favourable to the interests of the project. The _reservoirs of distributed knowledge_ are one of the main strengths of free software projects.
ca: A més de ser una política alineada amb la Guia de contractació tecnològica, és molt favorable pels interessos del projecte disseminar el coneixement sobre el producte. Les _reserves de coneixement distribuïdes_ son una de les principals fortaleses dels projectes de codi obert.
es: Además de ser una política alineada con la Guía de contratación tecnológica, es muy favorable para los intereses del proyecto diseminar el conocimiento sobre el producto. Las reservas de conocimiento distribuidas son una de las principales fortalezas de los proyectos de software libre.

source: It also helps a great deal to ensure collaborative development processes are established from the outset.
ca: També ajuda molt a que des de l’inici del desenvolupament s’estableixin processos de treball en obert.
es: También ayuda mucho a que desde el principio del desarrollo se establezcan procesos de trabajo colaborativo.

source: Reduce the financial stability requirements for tenders
ca: Reduir els requeriments d’estabilitat financera de les ofertes
es: Reducir los requerimientos de estabilidad financiera de las ofertas

source: Integration
ca: Integració
es: Integración

source: This is a matter of softening the required financial solvency criteria. The aim is avoid putting artificial impediments that prevent small and medium-sized companies and cooperatives from submitting a bid when they meet (often more than large companies) the technical solvency criteria.
ca: Es tracta de suavitzar els criteris de solvència financera exigits. L’objectiu és no posar impediments artificials que puguin impedir presentar-se al concurs a empreses i cooperatives petites i mitjanes que compleixin (o fins i tot superin a les grans) en solvència tècnica.
es: Se trata de suavizar los criterios de solvencia financiera exigidos. El objetivo es no poner impedimentos artificiales que puedan impedir presentarse al concurso a empresas y cooperativas pequeñas y medianas que cumplan en solvencia técnica e incluso superen a las grandes empresas en ello.

source: As explained in the Join Up _Guideline on public procurement of Open Source Software_<document/guideline-public-procurement-open-source-software>, page 47, (document commissioned by the European Commission), the greater interoperability and interdependence of suppliers when working with free software increases the sustainability of projects without the need for very high financial requirements.
ca: Com s’explica a la joinup:Guideline on public procurement of Open Source Software<document/guideline-public-procurement-open-source-software>, pàgina 47, (document encarregat per la Comissió Europea) la major interoperabilitat i independència de proveïdors quan es treballa en codi obert incrementa la sostenibilitat dels projectes sense necessitat d’uns requeriments financers molt elevats.
es: Como se explica en la página 47 de Join up: Guideline on public procurement of Open Source Software <document/guideline-public-procurement-open-source-software> (documento encargado por la Comisión Europea), la mayor interoperabilidad e independencia de proveedores cuando se trabaja en software libre incrementa la sostenibilidad de los proyectos sin necesidad de unos requerimientos financieros muy elevados.

source: Dissemination of the project
ca: Difusió del projecte
es: Difusión del proyecto

source: Choose a good name for the project
ca: Escollir un bon nom per al projecte
es: Escoger un buen nombre para el proyecto

source: Publication
ca: Publicació
es: Publicación

source: This is more important in free software projects than in proprietary ones because obtaining the participation of users and developers from outside the confines of the City Council can determine the project’s level of success.
ca: Això és més important en projectes de codi obert que en projectes tradicionals perquè adquirir usuaris i desenvolupadors fora dels confins de l’Ajuntament pot determinar el grau d’èxit del projecte.
es: Esto es más importante en proyectos de software libre que en proyectos tradicionales, porque adquirir usuarios y desarrolladores fuera de los confines del Ayuntamiento puede determinar el grado de éxito del proyecto.

source: More specific pointers can be found at http://producingoss.com/en/getting-started.html#choosing-a-name.
ca: Es poden trobar algunes indicacions més concretes a http://producingoss.com/en/getting-started.html#choosing-a-name.
es: Se pueden encontrar indicaciones más concretas en http://producingoss.com/es/getting-started.html#choosing-a-name.

source: Register the name in important online (Internet) sites (3.3, 7.0)
ca: Adquirir el nom en els espais d’Internet importants
es: Adquirir el nombre en los espacios de internet importantes

source: For big projects it is advisable from the outset to think about the Internet sites and platforms where it is essential to have a presence and ensure the domains and corresponding usernames are available. Besides one or more own Internet domains names, a project might want to be present in GitHub or Twitter, for example. Using the same username everywhere makes it easier for people to identify the project, even if they are not heavily involved in it.
ca: Per projectes grans és recomanable pensar des del principi en quins llocs i plataformes d’Internet s’haurà de tenir presència i assegurar la disponibilitat dels dominis o noms d’usuari corresponents. A més d’un o més dominis ICANN propis, pot ser que un projecte vulgui tenir presència a GitHub o Twitter, per exemple. Utilitzar a tot arreu el mateix nom d’usuari facilita la identificació del projecte per part de persones que encara no hi estan massa involucrades.
es: Para proyectos grandes, es recomendable pensar desde el principio en qué sitios y plataformas de internet se deberá tener presencia y asegurar la disponibilidad de los dominios o nombres de usuario correspondientes. Además de uno o más dominios ICANN propios, puede ser que un proyecto quiera tener presencia en GitHub o Twitter, por ejemplo. Utilizar en todas partes el mismo nombre de usuario facilita la identificación del proyecto por parte de personas que todavía no están demasiado involucradas.

source: Draw up a clear mission statement and publish it in prominent places
ca: Redactar una declaració de propòsit clara i posar-la a llocs destacats
es: Redactar una declaración de propósito clara y ponerla en sitios destacados

source: The mission statement is a short text of one or two paragraphs that allows people to decide in 30 seconds if they are interested in carrying on reading about the project or not. It should be accompanied by the necessary links in case the answer is yes. When writing it we can assume potential readers have a minimum knowledge of the project’s area of application. People without such knowledge will probably not be interested in the project.
ca: La declaració de propòsit és un text curt, d’un o dos paràgrafs, que permet a la gent decidir en 30 segons si els interessa seguir llegint sobre el projecte o no. Ha d’anar acompanyada dels enllaços necessaris per si la resposta afirmativa. En el redactat es pot donar per suposats uns coneixements mínims de l’àrea d’aplicació del projecte. Les persones que no disposen d’aquests coneixements probablement no estaran interessades en el projecte.
es: La declaración de propósito es un texto corto, de uno o dos párrafos, que permite a los lectores decidir en 30 segundos si les interesa seguir leyendo sobre el proyecto o no. Debe ir acompañada de los enlaces necesarios por si se quiere seguir leyendo. En el redactado se puede dar por supuestos unos conocimientos mínimos del área de aplicación del proyecto. Las personas que no dispongan de estos conocimientos probablemente no estarán interesadas en el proyecto.

source: The text should at least be in English and Catalan, for using the most suitable version in each case.
ca: El text s’ha de tenir redactat com a mínim en anglès i en català, per utilitzar la versió que convingui en cada cas.
es: El texto debe estar redactado como mínimo en inglés y en catalán, para utilizar la versión que convenga en cada caso.

source: It should appear in the following places at least:
ca: Ha d’aparèixer com a mínim als següents llocs:
es: Debe aparecer como mínimo en los siguientes sitios:

source: The home page of the website targeted at project users, if there is one. It should be capable of being seen without the need to scroll down the page on a desktop computer.
ca: La pàgina d’inici de la web orientada a usuaris del projecte, cas de tenir-ne. S’ha de poder veure sense necessitat de fer scroll en un ordinador de sobretaula.
es: La página de inicio de la web orientada a usuarios del proyecto, en caso de tenerla. Se tiene que poder ver sin necesidad de hacer scroll en un ordenador de sobremesa.

source: The `README` file of the main repository.
ca: El fitxer `README` del repositori principal.
es: El fichero README del repositorio principal.

source: The project list at https://ajuntamentdebarcelona.github.io/[https://ajuntamentdebarcelona.github.io].
ca: El llistat de projectes a https://ajuntamentdebarcelona.github.io.
es: El listado de proyectos en https://ajuntamentdebarcelona.github.io/[https://ajuntamentdebarcelona.github.io].

source: Every time the project is entered in a repository or free software project list, for example https://joinup.ec.europa.eu/[Join Up of the European Union].
ca: Cada vegada que el projecte s’introdueix a un repositori o llistat de projectes de codi obert, per exemple el https://joinup.ec.europa.eu/[Join Up de la Unió Europea].
es: Cada vez que el proyecto se introduce en un repositorio o listado de proyectos de software libre, por ejemplo, el https://joinup.ec.europa.eu/[Join up de la Unión Europea].

source: Specify in prominent places that the project is free software
ca: Especificar en llocs destacats que el projecte és lliure
es: Especificar en sitios destacados que el proyecto es libre

source: This measure is to ensure potential collaborators do not have to look too far to know whether they are willing to contribute to the project or not. It is also important to state under which specific licence (including the version) the software is being distributed, using the full name or identifier, whichever is best in each case, exactly as they appear at https://spdx.org/licenses/. Specify the licence in the following places at least:
ca: És important, a més, indicar sota quina llicència concreta es distribueix el programari (incloent la versió), utilitzant el nom complert o bé l’identificador, el que més convingui en cada cas, exactament com apareixen a https://spdx.org/licenses/. Especificar la llicència com a mínim en els següents llocs:
es: Esta medida facilita que los potenciales colaboradores no tengan que buscar demasiado para saber si estarán dispuestos a contribuir o no en el proyecto. Es importante, además, indicar bajo qué licencia concreta se distribuye el software (incluyendo la versión), utilizando el nombre completo o bien el identificador, lo que más convenga en cada caso, exactamente como aparecen en https://spdx.org/licenses/.Especificar la licencia como mínimo en los siguientes sitios:

source: With regard to the website targeted at project users, it is important not to relegate this to a “downloads” or “development” page which might require more than one click.
ca: En quant a la web orientada a usuaris del projecte, és important no relegar aquesta informació a una pàgina de «descàrregues» o de «desenvolupament» que requereixi més d’un clic.
es: En cuanto a la web orientada a usuarios del proyecto, es importante no relegar esta información a una página de "descargas" o de "desarrollo" que requiera más de un clic.

source: Specify a feature list in easily accessible places
ca: Especificar en llocs fàcilment accessibles un llistat de funcionalitats
es: Especificar en sitios fácilmente accesibles un listado de funcionalidades

source: This helps people to decide whether or not the project might cover their needs.
ca: Serveix per què la gent acabi de decidir si el projecte pot cobrir o no les seves necessitats.
es: Sirve para que las personas acaben de decidir si el proyecto puede cubrir o no sus necesidades.

source: Include the list, or create a visible link to it from at least:
ca: Enllaçar de forma visible com a mínim des de:
es: Debe enlazarse de forma visible como mínimo desde los siguientes elementos:

source: The home page of the website targeted at project users, if there is one. The link should be capable of being seen without the need to scroll down the page on a desktop computer.
ca: *La pàgina d’inici de la web orientada a usuaris del projecte, cas de* tenir-ne. L’enllaç s’ha de poder veure sense necessitat de fer scroll en un ordinador de sobretaula.
es: La página de inicio de la web orientada a usuarios del proyecto, en caso de tenerla. El enlace se tiene que poder ver sin necesidad de hacer scroll en un ordenador de sobremesa.

source: This is better in the form of a list with bullet points and simple sentences, or an even more graphic form. Often it is a kind of extension of the mission statement.
ca: Millor en forma de llistat amb vinyetes i frases simples, o d’una manera encara més gràfica. Molts cops és una mena d’extensió de la declaració de propòsit.
es: Es mejor en forma de listado con viñetas y frases simples, o de una manera todavía más gráfica. Muchas veces es una especie de extensión de la declaración de propósito.

source: If a feature has not been implemented yet, it can be specified in brackets as: _planned_ or _work-in-progress_.
ca: Si una funcionalitat encara no està implementada es pot especificar entre parèntesis: _planned_ o _work-in-progress_.
es: Si una funcionalidad todavía no está implementada se puede especificar entre paréntesis _planned_ o _work-in-progress_.

source: It makes no sense, and indeed could be counter-productive, to falsify or exaggerate the product’s real technical merits.
ca: Especificar i mantenir una pàgina amb l’estat de desenvolupament del projecte, no té sentit, i de fet pot ser molt contraproduent, falsejar o exagerar els veritables mèrits tècnics del producte.
es: Como se explica con más detalle en la medida M, “especificar y mantener una página con el estado de desarrollo del proyecto” no tiene sentido, y, de hecho, puede ser muy contraproducente falsear o exagerar los verdaderos méritos técnicos del producto.

source: Specify the main technical requirements in easily accessible places
ca: Especificar en llocs fàcilment accessibles els principals requeriments tècnics
es: Especificar en sitios fácilmente accesibles los principales requerimientos técnicos

source: For example, indicate what hardware/software architecture is required for installing it, which operating system and so on. This information is also necessary so a potential user can see whether they can use the solution or not.
ca: Per exemple quina arquitectura hardware/software es necessita per instal·lar-ho, quin sistema operatiu, etc. També és una informació necessària per què un potencial usuari esbrini si pot utilitzar la solució o no.
es: Por ejemplo, qué arquitectura hardware o software se necesita para instalarlo, qué sistema operativo, etcétera. También es una información necesaria para que los usuarios potenciales averigüen si pueden utilizar la solución o no.

source: Include this information, or create a visible link to it from at least:
ca: Enllaçar de forma visible com a mínim des de:
es: Debe enlazarse de forma visible como mínimo desde los siguientes elementos:

source: This is better in the form of a list with bullet points and simple sentences.
ca: Millor en forma de llistat amb vinyetes i frases simples.
es: Es mejor en forma de listado con viñetas y frases simples.

source: Specify the differences with similar products in easily accessible places
ca: Especificar en llocs fàcilment accessibles les diferències amb productes similars
es: Especificar en sitios fácilmente accesibles las diferencias con productos similares

source: Above all, highlight the advantages compared with better-known and well-established tools, free or privately owned, but do not hide the limitations.
ca: Destacar sobretot els avantatges respecte les eines més conegudes i ben establertes, lliures o propietàries, però no amagar les limitacions.
es: Se recomienda destacar sobre todo las ventajas respecto a las herramientas más conocidas y bien establecidas, libres o propietarias, pero no esconder las limitaciones.

source: Create a visible link from the website targeted at project users, if there is one. Strictly technical differences can also be linked from or included on the development website.
ca: Enllaçar de forma visible des de la web orientada a usuaris del projecte, cas de tenir-ne. Les diferències estrictament tècniques també es poden enllaçar des de la web de desenvolupament.
es: También es recomendable enlazar de forma visible desde la web orientada a usuarios del proyecto, en caso de tenerla. Las diferencias estrictamente técnicas también se pueden enlazar desde la web de desarrollo.

source: Specify and maintain a page with the development status of the project
ca: Especificar i mantenir una pàgina amb l’estat de desenvolupament del projecte
es: Especificar y mantener una página con el estado de desarrollo del proyecto

source: This involves writing a list which is periodically updated for each release or important milestone containing:
ca: Es tracta d’escriure un llistat, que es va actualitzant periòdicament a cada release o fita important, que contingui:
es: Se trata de escribir un listado, que se va actualizando periódicamente en cada release o hito importante, que contenga lo siguiente:

source: The previous releases, with the publication date and the main changes that were introduced.
ca: Les release anteriors, amb la data de publicació i els principals canvis que s’hi van introduir.
es: Los releases anteriores, con la fecha de publicación y los principales cambios que se introdujeron.
