Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/collaborative-development.po
Languages: ca, es

source: Collaborative development
ca: Desenvolupament col·laboratiu
es: Desarrollo colaborativo

source: In free software projects there is a culture of working in public eye, as this facilitates the conditions that make them technically and financially sustainable. Increasing the flow of resources to projects is in the interest of all projects, and it involves:
ca: En els projectes de programari lliure hi ha una cultura de «treballar en obert», ja que aquesta facilita les condicions que els fan sostenibles financerament i tècnica. És d’interès per a tots els projectes incrementar l’afluència de recursos cap al mateix, i això passa per:
es: En los proyectos de software libre hay una cultura de trabajar en abierto, ya que esta facilita las condiciones que los hacen sostenibles financiera y técnicamente. Es de interés para todos los proyectos incrementar la afluencia de recursos hacia los mismos, y eso pasa por lo siguiente:

source: Increasing the number of people and institutions that use the software.
ca: Incrementar la quantitat de persones o institucions que utilitzen el programari.
es: Incrementar la cantidad de personas o instituciones que utilizan el software.

source: Encouraging any user, whether a person or an organisation, to participate in the project in any way they can, by contributing to the source code, testing, corrections, funding, dissemination, translations and so on.
ca: Propiciar la transició de qualsevol persona o entitat usuària a algú que participa en el projecte de la manera que sigui: contribuint amb codi, testing, correccions, finançament, difusió, traduccions, etcètera.
es: Propiciar la transición de cualquier persona o entidad usuaria a alguien que participe en el proyecto de la manera que sea: contribuyendo con código, testing, correcciones, financiación, difusión, traducciones, etcétera.

source: Outside this model, which is based on fostering collaboration, it is very difficult to reap some of the potential benefits offered by free software, including:
ca: Fora d’aquest model, basat en incentivar la col·laboració, és molt difícil materialitzar els potencials avantatges que ofereix el paradigma del programari lliure. Hi ha dos elements claus en tot això:
es: Fuera de este modelo, basado en incentivar la colaboración, es muy difícil materializar las ventajas potenciales que ofrece el paradigma del software libre. Hay dos elementos clave en todo esto:

source: *Transparency*. There is no need to restrict this to the software code. If there is to be real collaboration, transparency has to extend to all the communication infrastructure, knowledge and decision-making involved in the project.
ca: *Transparència*. Aquesta no s’ha de limitar al codi. Per a que hi hagi verdadera col·laboració la transparència ha d’abastar tota la infraestructura de comunicació, coneixement i presa de decisions del projecte.
es: *Transparencia*. Esta no se tiene que limitar al código. Para que haya verdadera colaboración, la transparencia debe abarcar toda la infraestructura de comunicación, conocimiento y toma de decisiones del proyecto.

source: *Dissemination of knowledge*. In contrast to other, classical business models, the interest here lies in knowledge of the product, even the most technical details, being distributed as widely as possible. That reduces the technological risk and the City Council’s dependency on specific companies.
ca: *Disseminació del coneixement*. A diferència dels models de negoci clàssics, aquí interessa que el coneixement sobre el producte, fins als detalls més tècnics, estigui el més distribuït possible. Això redueix el risc tecnològic i la dependència de l’Ajuntament sobre empreses concretes.
es: *Diseminación del conocimiento*. A diferencia de los modelos de negocio clásicos, aquí interesa que el conocimiento sobre el producto, hasta los detalles más técnicos, esté lo más distribuido posible. Eso reduce el riesgo tecnológico y la dependencia del Ayuntamiento sobre empresas concretas.

source: *Community participation*. This reinforces both the project, with more ideas and resources, and the local communities.
ca: *Participació de la comunitat*. Això reforça tant el projecte, amb més idees i recursos, com les comunitats locals.
es: *Participación de la comunidad*. Esto refuerza tanto el proyecto, con más ideas y recursos, como las comunidades locales.

source: Working in public eye means the following elements should be publicly accessible in free formats (for reading) to anyone who is interested, so they do not have to use private tools and can do so anonymously (without having to register with any web service or much less having to hire for-payment services):
ca: Treballar en obert suposa que els següents elements siguin públicament accessibles (per lectura) a tota persona interessada en formats oberts, sense haver d’usar eines privatives i de forma anònima (sense haver-se de registrar a cap servei web i molt menys havent de contractar serveis de pagament):
es: Trabajar en abierto supone que los siguientes elementos sean públicamente accesibles (para lectura) a toda persona interesada en formatos abiertos, sin tener que usar herramientas privativas y de forma anónima (sin tener que registrarse en ningún servicio web y mucho menos teniendo que contratar servicios de pago):

source: The code repository.
ca: El repositori de codi.
es: El repositorio de código.

source: The issue manager or bug tracker (where, among other things, defects or bugs are notified and managed).
ca: El gestor d’incidències (on, entre d’altres, es notifiquen i gestionen els defectes o bugs).
es: El gestor de incidencias (donde, entre otros, se notifican y gestionan los defectos o bugs).

source: Design documents.
ca: Els documents de disseny.
es: Los documentos de diseño.

source: User documentation.
ca: La documentació d’usuari/-a.
es: La documentación de usuario/a.

source: The communication channels through which the technical team make technical decisions.
ca: Els canals de comunicació on l’equip de desenvolupament pren les decisions tècniques.
es: Los canales de comunicación donde el equipo de desarrollo toma las decisiones técnicas.

source: Working in public eye does NOT (necessarily) mean that:
ca: Treballar en obert NO vol dir (necessàriament) que:
es: Trabajar en abierto no significa (necesariamente) lo siguiente:

source: Project outsiders have write access to the repository (they are free to copy the code into their own repository and modify their copy).
ca: Persones externes al projecte tinguin accés d’escriptura al repositori (son lliures de copiar el codi en un repositori propi i modificar la seva còpia).
es: Que personas externas al proyecto tengan acceso de escritura al repositorio (son libres de copiar el código en un repositorio propio y modificar su copia).

source: Everyone has permission to write notifications of defects and intervene in the issue manager. Each project can choose its own QA policy.
ca: Tothom tingui permís per escriure notificacions de defectes i intervenir al gestor d’incidències, cada projecte pot triar la seva política de QA.
es: Que todo el mundo tenga permiso para escribir notificaciones de defectos e intervenir en el gestor de incidencias, cada proyecto puede escoger su política de calidad.

source: The project team has to read and respond to all defect notifications (if they are open to writing) and questions via the public communication channels.
ca: L’equip del projecte hagi de llegir i respondre totes les notificacions de defectes (si estan obertes per escriptura) ni totes les preguntes als canals de comunicació oberts.
es: Que el equipo del proyecto tenga que leer y responder todas las notificaciones de defectos (si están abiertas para escritura) ni todas las preguntas en los canales de comunicación abiertos.

source: The project team has to check all the suggestions and contributions (pull requests and patches) they might receive, if it is felt the resources are better invested in another task.
ca: L’equip del projecte hagi de revisar totes les suggerències i contribucions (_pull requests, patches_) que rebi, si es considera que els recursos estan millor invertits en una altra tasca.
es: Que el equipo del proyecto tenga que revisar todas las sugerencias y contribuciones (pull requests, patches) que reciba, si se considera que los recursos están mejor invertidos en otra tarea.

source: Work in the public eye from day one
ca: Treballar en obert des del dia 1
es: Trabajar en abierto desde el día 1

source: A really important aspect to bear in mind is the longer you work in a closed, private environment, the more difficult it will be to open it up later on. If you wait too long, maybe some measures will never be implemented, because their cost would be prohibitive. The reasons for that can be summed up as follows:
ca: Un aspecte importantíssim a tenir en compte és que quant més temps es gestiona un projecte de forma tancada, més costós és després obrir-lo. Si s’espera massa, pot ser que algunes mesures no s’arribin a implementar mai, ja que el seu cost resultaria prohibitiu. Les raons d’això es resumeixen en:
es: Un aspecto importantísimo que tener en cuenta es que cuanto más tiempo se gestiona un proyecto de forma cerrada, más costoso es después abrirlo. Si se espera demasiado, puede suceder que algunas medidas no lleguen nunca a implementarse, pues su coste resultaría prohibitivo. Las razones de esto se resumen en lo siguiente:

source: Having public communication channels from day 1 does not mean “strangers” have to distract us from day 1. In this Guide we explain how to make it clear what our commitments are, what we can achieve at each stage.
ca: Tenir canals de comunicació oberts des del dia 1 no vol dir que els "estranys" ens hagin de distreure des del dia 1. En el present document s’explica com deixar clar quins son els nostres compromisos, que podem modular a cada fase.
es: Tener canales de comunicación abiertos desde el día 1 no significa que los “extraños” nos tengan que distraer desde el primer día. En el presente documento se explica cómo dejar claros cuáles son nuestros compromisos, que podemos modular en cada fase.

source: It is impossible to compensate the incentives that developers have for doing things in a “quick and dirty” way, with future threats of publication. If we do not work in public eye from the start, we will inevitably incur a https://en.wikipedia.org/wiki/Technical_debt[technological debt] with the intention of fixing things in the future (that never comes).
ca: És impossible compensar els incentius que tenen els desenvolupadors per fer coses de manera "ràpida i lletja" amb futures amenaces d’obertura. Si no s’actua en obert des de l’inici, inevitablement incorreran en https://en.wikipedia.org/wiki/Technical_debt[deute tecnològic] amb la intenció d’arreglar les coses en un futur (que mai arriba).
es: Es imposible compensar los incentivos que tienen los desarrolladores para hacer cosas de manera *rápida y fea* con futuras amenazas de apertura. Si no se actúa en abierto desde el principio, inevitablemente se incurrirá en https://es.wikipedia.org/wiki/Technical_debt[deuda tecnológica] con la intención de arreglar las cosas en un futuro (que nunca llega).

source: When the day for “freeing the code” arrives, you suddenly find you have:
ca: Quan arriba el dia d'"obrir el codi", ens trobem de cop i volta que tenim:
es: Cuando llega el día de abrir el código, nos encontramos de repente con que tenemos cuestiones como las siguientes:

source: Specific user settings and passwords in the repository.
ca: Configuracions d’usuari específiques i contrasenyes dins del repositori.
es: Configuraciones de usuario específicas y contraseñas dentro del repositorio.

source: Notifications of defects that contain sensitive information that cannot be made public.
ca: Notificacions de defectes que contenen informació sensible que no es pot fer pública.
es: Notificaciones de defectos que contienen información sensible que no se puede hacer pública.

source: Correspondence between developers which mixes useful technical information with personal opinions that were not expressed so everybody could read them.
ca: Correspondència entre desenvolupadors on es barreja informació tècnica útil amb opinions personals que no estaven pensades per a que tothom les pogués llegir.
es: Correspondencia entre desarrolladores donde se mezcla información técnica útil con opiniones personales que no estaban pensadas para que todo el mundo las pudiera leer.

source: Dependence on software components that cannot be used in a free software project, or which generate licence problems.
ca: Dependències sobre components de software que no es poden usar en un projecte de codi obert, o que generen problemes de llicències.
es: Dependencias sobre componentes de software que no se pueden usar en un proyecto de software libre, o que generan problemas de licencias.

source: Documentation or build procedures written with proprietary tools that do not allow them to be published.
ca: Documentació o procediments de build escrits amb eines propietàries que no permeten la seva publicació.
es: Documentación o procedimientos de build escritos con herramientas propietarias que no permiten su publicación.

source: (And a never-ending list of other things).
ca: (I una llista inacabable de coses).
es: (Y una lista inacabable de cosas).

source: Publishing the code means having to take difficult decisions, which would not have arisen if it had been in public eye from the start (wasting time cleaning up the defect log vs creating a new one and losing the entire log, etc.).
ca: L’obertura del codi provoca haver de prendre decisions difícils, que no es produirien si hagués estat obert des de l’inici (perdre temps netejant l’historial de defectes vs. crear-ne un de nou i perdre l’historial complert, etc).
es: La apertura del código provoca tener que tomar decisiones difíciles, que no se producirían si hubiera sido abierto desde el principio (perder tiempo limpiando el historial de defectos o crear uno nuevo y perder el historial completo, etcétera).

source: It creates a big “publication milestone” which poses a high risk for the project, because lots of changes have to be made all at once. The whole project and its potential vulnerabilities are also exposed in one go (and many eyes will be looking, not always with good intentions). This creates uncertainty and concern before the event. Afterwards, it could cause an avalanche of issues that in normal conditions would have been staggered.
ca: Es crea un gran "esdeveniment d’obertura" que suposa un alt risc per al projecte, ja que s’han de fer molts canvis de cop, i tot el projecte i les seves potencials vulnerabilitats queden exposades també de cop (i molts ulls, no sempre ben intencionats, estaran mirant). Abans de l’esdeveniment, això crea incertesa i preocupació. Després de l’esdeveniment, pot provocar una allau d’incidències que en condicions normals haguessin arribat escalonadament.
es: Se crea un gran acontecimiento de apertura que supone un alto riesgo para el proyecto, ya que se tienen que hacer muchos cambios de golpe, y todo el proyecto y sus potenciales vulnerabilidades quedan expuestos también de golpe (y muchos ojos, no siempre bien intencionados, estarán mirando). Antes del acontecimiento, eso crea incertidumbre y preocupación. Después del acontecimiento, puede provocar un alud de incidencias que en condiciones normales habrían llegado escalonadamente.

source: All these points are amply justified in sections https://producingoss.com/en/setting-tone.html#be-open-from-day-one[“Be Open From Day One”] and https://producingoss.com/en/governments-and-open-source.html#starting-open-for-govs[“Being Open Source From Day One is Especially Important for Government Projects”] from the book https://producingoss.com/en/index.html[“Producing Open Source Software”], which the people in charge of each project would do well to read.
ca: Tots aquests elements es justifiquen abastament als apartats https://producingoss.com/en/setting-tone.html#be-open-from-day-one[Be open from day one] i https://producingoss.com/en/governments-and-open-source.html#starting-open-for-govs[Being Open Source From Day One is Especially Important for Government Projects] del llibre https://producingoss.com/en/index.html[Producing Open Source Software], que convé molt que llegeixin les persones responsables de cada projecte.
es: Todos estos elementos se justifican ampliamente en los apartados https://producingoss.com/es/setting-tone.html#be-open-from-day-one[“Be open from day one”] y https://producingoss.com/en/governments-and-open-source.html#starting-open-for-govs[“Being open source from day one is especially important for Government projects”] del libro https://producingoss.com/en/index.html[Producing Open Source Software], cuya lectura es muy recomendable para las personas responsables de cada proyecto.

source: The measures and recommendations that should be borne in mind with regard to freeing the code are spread throughout the Guide, tagged as `Day1`. They are all listed in the following table:
ca: Les mesures i recomanacions a tenir en compte per no retardar aquesta obertura es troben repartides per tota la Guia, etiquetades com a `Dia 1`. Les presentem totes aquí llistades:
es: Las medidas y recomendaciones que tener en cuenta para no retrasar esta apertura se encuentran repartidas en toda la guía, etiquetadas como “Día1”. Las presentamos todas aquí listadas:

source: |ID |Title |Type |Tags |A_D4F |Link the main repository to a public issue manager |Alternative |Day1__;__ Adaptation__;__ Plugin__;__ NewProduct__;__ Publication |M_F25 |Upload a ``README`` file to the main repository |Measure |Day1__;__ Plugin__;__ NewProduct__;__ Publication |M_4F5 |Publish brief Developer Guidelines |Measure |Day1__;__ Plugin__;__ NewProduct__;__ Publication |R_368 |Link the main repository to a free software continuous integration system. |Recommendation |Day1__;__ Adaptation__;__ Plugin__;__ NewProduct__;__ Publication |M_97E |Upload the licence text to the main repository |Measure |Day1__;__ Plugin__;__ NewProduct__;__ Publication |M_A60 |Create the main repository in the City Council [.line-through]#GitHub# public software forge |Measure |Day1__;__ Adaptation__;__ Plugin__;__ NewProduct__;__ Publication |M_A63 |Use the [.line-through]#GitHub# main repository web interface as the project development website |Measure |Day1__;__ Plugin__;__ NewProduct__;__ Publication |M_35A |Link the main repository to a public issue manager |Measure |Day1__;__ Adaptation__;__ Plugin__;__ NewProduct__;__ Publication |R_2D5 |Reserve a permanent project URL and always use it to refer to the project |Recommendation |Day1__;__ Integration__;__ Plugin__;__ NewProduct__;__ Publication |link:#M_7EA[M_7EA] |Implement and document build and installation procedures with widely used free tools |Measure |Day1__;__ Plugin__;__ NewProduct__;__ Publication |M_CC5 |Upload a file with installation instructions to the main repository |Measure | | |Dia1__;__ Integration__;__ Plugin__;__ NewProduct__;__ Publication
ca: |ID |Title |Type |Tags |A_D4F |Vincular el repositori principal a un gestor d'incidències públic |Alternativa |Dia1;_ _ Adaptació_;_ Plugin_;_ NouProducte_; _ Publicació |M_F25 |Pujar un fitxer ``README`` al repositori principal |Mesura |Dia1_;_ Plugin_;_ NouProducte_;_ Publicació |M_4F5 |Publicar unes breus Directrius per desenvolupadors (Developer Guidelines) |Mesura |Dia1_;_ Plugin_;_ NouProducte_;_ Publicació |R_368 |Vincular el repositori principal a un sistema d'integració contínua de codi obert |Recomanació |Dia1_;_ Adaptació_;_ Plugin_;_ NouProducte_;_ Publicació |M_97E |Pujar el text de la llicència al repositori principal |Mesura |Dia1_;_ Plugin_;_ NouProducte_;_ Publicació |M_A60 |Crear el repositori principal a l'espai [.line-through]#GitHub# public software forge de l'Ajuntament |Mesura |Dia1_;_Adaptació_;_ Plugin_;_ NouProducte_;_ Publicació |M_A63 |Utilitzar el respositori de [.line-through]#GitHub# com la web de desenvolupament del projecte |Mesura |Dia1_;_ Plugin_;_ NouProducte_;_ Publicació |M_35A |Vincular el repositori principal al gestor d'incidències de GitHub |Mesura |Dia1_;_ Adaptació_;_ Plugin_;_ NouProducte_;_ Publicació |R_2D5 |Reservar una URL permanent per al projecte, i usar-la sempre per fer-hi referència |Recomanació |Dia1_;_ Integració_;_ Plugin_;_ NouProducte_;_ Publicació |link:#M_7EA[M_7EA] |Implementar i documentar procediments de build i instal·lació amb eines lliures i d'ús estès |Mesura |Dia1_;_ Plugin_;_ NouProducte_;_ Publicació |M_CC5 |Pujar un fitxer amb instruccions d'instal·lació al repositori principal |Mesura | | |Dia1_;_ Integració_;_ Plugin_;_ NouProducte_;_ Publicació
es: |ID |Title |Type |Tags |A_D4F Vincular el repositorio principal a un gestor de incidencias público |Alternativa |Día1_;_ Adaptación_;_ Plugin_;_ NuevoProducto_;_ Publicación |M_F25 |Subir un fichero README al repositorio principal |Medida |Día1_;_ Plugin_;_ NuevoProducto_;_ Publicación |M_4F5 |Publicar unas breves directrices para desarrolladores (developer guidelines) |Medida |Día1_;_ Plugin_;_ NuevoProducto_;_ Publicación |R_368 |Vincular el repositorio principal a un sistema de integración continua con licencia libre. |Recomendación |Día1_;_ Adaptación_;_ Plugin_;_ NuevoProducto_;_ Publicación |M_97E |Subir el texto de la licencia al repositorio principal |Medida |Día1_;_ Plugin_;_ NuevoProducto_;_ Publicación |M_A60 |Crear el repositorio principal en el espacio [.line-through]#GitHub# de publicación abierta_de software del Ayuntamiento |Medida |Day1__;__ Adaptation__;__ Plugin__;__ NewProduct__;__ Publication |M_A63 |Utilizar el repositorio principal [.line-through]#en GitHub# como web de desarrollo del proyecto |Medida |Día1_;_ Plugin_;_ NuevoProducto_;_ Publicación |M_35A |Vincular el repositorio principal al gestor de incidencias |Medida |Día1_;_ Adaptación_;_ Plugin_;_ NuevoProducto_;_ Publicación |R_2D5 |Reservar una URL permanente para el proyecto, y usarla siempre para hacer referencia a este |Recomendación |Día1_;_ Integración_;_ Plugin_;_ NuevoProducto_;_ Publicación |link:#M_7EA[M_7EA] |Implementar y documentar procedimientos de build e instalación con herramientas libres y de uso extendido |Medida |Día1_;_ Plugin_;_ NuevoProducto_;_ Publicación |M_CC5 |Subir un fichero con instrucciones de instalación en el repositorio principal |Medida | | |Día1_;_ Integración_;_ Plugin_;_ NuevoProducto_;_ Publicación

source: Procurement for collaborative development
ca: Contractació per a desenvolupar en obert
es: Contratación para desarrollar colaborativo

source: Award the contract to companies with experience in collaborative development
ca: Adjudicar a entitats amb experiència en desenvolupament obert
es: Adjudicar a entidades con experiencia en desarrollo colaborativo

source: Procurement
ca: Contractar
es: Contratar

source: Adaptation
ca: Adaptació
es: Adaptación

source: NewProduct
ca: NouProducte
es: NuevoProducto

source: Establish the need for free software development experience as a condition of technical solvency.
ca: Establir la necessitat d’experiència en codi obert com a condició de solvència tècnica.
es: Hay que establecer la necesidad de experiencia en software libre como condición de solvencia técnica.
