Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/collaborative-development.po
Languages: ca, es

source: Future releases or project milestones with a tentative date as a very schematic roadmap.
ca: Futures release o fites del projecte amb data temptativa de realització, a mode de full de ruta molt esquemàtic.
es: Futuros releases o hitos del proyecto con fecha tentativa de realización, a modo de hoja de ruta muy esquemática.

source: The purpose of this page is to highlight three things:
ca: L’objectiu d’aquesta pàgina és contribuir a visibilitzar tres coses:
es: El objetivo de esta página es contribuir a visibilizar tres cosas:

source: Which milestones have been achieved.
ca: Quines fites s’han assolit ja.
es: Qué hitos se han alcanzado ya.

source: Where the project is heading and how far there is to go to reach the other milestones.
ca: Cap a on es dirigeix el projecte i com de lluny es troben les fites que s’espera assolir.
es: Hacia dónde se dirige el proyecto y cuán lejos se encuentran los hitos que se espera alcanzar.

source: How active the project and its community are and how well maintained the code is.
ca: Com d’actius son el projecte i la seva comunitat, i com de ben mantingut està el codi.
es: Cuán activos están el proyecto y su comunidad, y cuán bien mantenido está el código.

source: Create a link from at least:
ca: Enllaçar com a mínim des de:
es: Enlazar como mínimo desde los siguientes elementos:

source: The website targeted at project users
ca: La web orientada a usuaris del projecte.
es: La web orientada a usuarios del proyecto.

source: It is very important to be transparent and not falsify the real status of the project. It is more harmful to attract users with false expectations (that it will be impossible to satisfy) than err on the side of caution when outlining the progress made or expected. All projects have defects and it makes everyone's life easier (project developers, promoters and potential outside users) to deal with them transparently. Most successful free software software projects have a “Known bugs” section on their website, and some of these bugs stay there for years.
ca: És molt important ser transparents i no falsejar l’estat real del projecte. És més perniciós atraure usuaris amb expectatives que no es podran complir que no pecar de conservadorisme a l’hora d’exposar el progrés realitzat o esperat. Tots els projectes tenen defectes i facilita la vida a tothom (desenvolupadors, promotors del projecte i potencials usuaris externs) tractar-los amb transparència. Molts projectes de programari lliure exitosos contenen a la seva pàgina un apartat titulat "Known bugs", i alguns d’aquests defectes romanen allà durant anys.
es: Es muy importante ser transparentes y no falsear el estado real del proyecto. Es más pernicioso atraer usuarios con expectativas que no se podrán cumplir que pecar de conservadurismo a la hora de exponer el progreso realizado o esperado. Todos los proyectos tienen defectos y facilita el trabajo de todos (desarrolladores, promotores del proyecto y potenciales usuarios externos) tratarlos con transparencia. Muchos proyectos de software libre exitosos contienen en su página un apartado titulado “Known bugs” (errores conocidos), y algunos de estos defectos permanecen allí durante años.

source: What's more, in the case of free software code, the whole code and the whole process can be seen by everybody, and everybody can install and test the product. Anybody can refute our affirmations if they are not certain, as explained in: http://producingoss.com/en/marketing.html#goldfish-bowl.
ca: A més, en el cas del codi obert, tot el codi i tot el procés de desenvolupament està a la vista de tothom, i tothom pot instal·lar i provar el producte. Qualsevol pot refutar les nostres afirmacions si no son certes, com s’explica a http://producingoss.com/en/marketing.html#goldfish-bowl.
es: Además, en el caso del software libre, todo el código y todo el proceso de desarrollo están a la vista de todo el mundo, y todo el mundo puede instalar y probar el producto. Cualquiera puede refutar nuestras afirmaciones si no son ciertas, como se explica en http://producingoss.com/es/marketing.html#goldfish-bowl.

source: Establish measures to improve the visibility of the progress and level of activity on the project
ca: Establir mesures per visibilitzar millor el progrés i el grau d’activitat del projecte
es: Establecer medidas para visibilizar mejor el progreso y el grado de actividad del proyecto

source: Automatic status indicators and feedback can be placed on the home page of the users’ and developers’ websites, or other places, with information from, for example:
ca: Es poden posar indicadors i alimentadors automàtics a la pàgina d’inici de les webs (tant a la d’usuaris com la de desenvolupament), o en altres llocs, amb informacions que provinguin, per exemple, de:
es: Se pueden poner indicadores y alimentadores automáticos en la página de inicio de las webs (tanto en la de usuarios como en la de desarrollo), o en otros lugares, con informaciones que provengan, por ejemplo, de los siguientes espacios

source: The repository, e.g. the latest commit messages.
ca: El repositori, per exemple els darrers missatges de commit.
es: El repositorio, por ejemplo, los últimos mensajes de commit.

source: The continuous integration system, e.g. what builds or test series have worked or failed recently.
ca: El sistema d’integració continua, per exemple quins builds o conjunts de testos han funcionat o fallat darrerament.
es: El sistema de integración continua, por ejemplo, qué builds o conjuntos de test han funcionado o fallado últimamente.

source: The issue and bug notification system.
ca: El sistema de notificació d’incidències o defectes.
es: El sistema de notificación de incidencias o defectos.

source: Project and user Twitter profiles.
ca: Twitter del projecte o d’usuaris de l’aplicació.
es: Twitter del proyecto o de usuarios de la aplicación.

source: Another possibility is to show in graphic form a kind of progress calendar with the different versions.
ca: També es pot mostrar de manera gràfica una mena de calendari de progrés amb les diferents versions.
es: También se puede mostrar de manera gráfica una especie de calendario de progreso con las diferentes versiones.

source: By way of example, the way the https://launchpad.net/inkscape[Ubuntu Launchpad example project] information is shown could be added.
ca: Es pot agafar com exemple la manera que mostra la informació de projectes d’ https://launchpad.net/inkscape[exemple el Launchpad d’Ubuntu].
es: Se puede tomar como modelo la manera que muestra la información de https://launchpad.net/inkscape[proyectos de ejemplo el Launchpad de Ubuntu].

source: The aim is to reinforce and highlight all the points made in the #h:a22a9688-f8e2-473d-baf5-8989693a41c1[Measure: Specify and maintain a page with the development status of the project].
ca: L’objectiu és enfortir i fer més visual tot allò esmentat a la #h:a22a9688-f8e2-473d-baf5-8989693a41c1[Mesura: Especificar i mantenir una pàgina amb l’estat de desenvolupament del projecte].
es: El objetivo es fortalecer y hacer más visual todo lo mencionado en la medida #h:a22a9688-f8e2-473d-baf5-8989693a41c1[“Especificar y mantener una página con el estado de desarrollo del proyecto]”.

source: Negotiate beforehand how to highlight the contributions sponsored by the City Council
ca: Negociar a priori la manera de fer visibles les aportacions patrocinades per l’Ajuntament
es: Negociar a priori la manera de hacer visibles las aportaciones patrocinadas por el Ayuntamiento

source: Barcelona City Council might be interested in software projects it has not started but makes some sort of contribution to (add-ons, translations, hours of maintenance work) recognising and publicising these contributions. What form that takes will depend on each project and the nature of the contributions. Some examples:
ca: A l’Ajuntament de Barcelona li pot interessar que els projectes de programari que no han estat iniciats per l’Ajuntament, però als quals realitza contribucions de qualsevol tipus (extensions, traduccions, hores de treball de manteniment) reconeguin i donin publicitat a aquestes contribucions. La manera en que això es concreti dependrà de cada projecte i de la naturalesa de les aportacions. Alguns exemples poden ser:
es: Al Ayuntamiento de Barcelona le puede interesar que los proyectos de software que no han sido iniciados por el Ayuntamiento, pero en los que realiza contribuciones de cualquier tipo (extensiones, traducciones, horas de trabajo de mantenimiento), reconozcan y den publicidad a estas contribuciones. La manera en que eso se concrete dependerá de cada proyecto y de la naturaleza de las aportaciones. Algunos ejemplos pueden ser los siguientes:

source: Mention in a public list of bodies that participate in or contribute to the project.
ca: Esment en una llista pública d’entitats que participen o contribueixen al projecte.
es: Mención en una lista pública de entidades que participan en el proyecto o contribuyen a este.

source: The City Council logo appearing in the project website.
ca: Aparició del logo de l’Ajuntament a la web del projecte.
es: Aparición del logo del Ayuntamiento en la web del proyecto.

source: Before initiating collaboration it is a good idea to talk with the project development community about the kind of recognition the City Council would like in each case.
ca: És convenient, abans d’iniciar la col·laboració, parlar amb la comunitat de desenvolupament del projecte sobre quin reconeixement desitjaria obtenir l’Ajuntament en cada cas.
es: Es conveniente, antes de iniciar la colaboración, hablar con la comunidad de desarrollo del proyecto sobre qué reconocimiento desearía obtener el Ayuntamiento en cada caso.

source: Parametrisation, configuration and installation
ca: Parametrització, configuració i instal·lació
es: Parametrización, configuración e instalación

source: Parametrise the product using configuration files
ca: Obligar als adjudicataris a parametritzar el producte usant fitxers de configuració
es: Obligar a los adjudicatarios a parametrizar el producto usando ficheros de configuración

source: Do not include deployment-specific or client-specific data in the code.
ca: No incloure al codi dades específiques d'un desplegament, o d'un client.
es: No hay que utilizar valores mágicos en el código.

source: Build-time and execution-time parametrisation should be possible through configuration files, even if other methods exist (e.g. command-line options). Those configuration files should be kept in a different, private repository.
ca: La parametrització, tant del procés de _build_ com de l'execució, s'ha de poder realitzar a través de fitxers de configuració, fins i tot si hi ha altres mètodes (per exemple, opcions de línia de línia de comandes). Aquests fitxers de configuració s'han de mantenir en un repositori privat diferent.
es: La parametritzación, tanto del proceso de build como de la ejecución, se tiene que poder realizar a través de ficheros de configuración, hasta hay otros métodos (por ejemplo, opciones de línea de comandos). Estos ficheros de configuración se tienen que mantener en un repositorio privado diferente.

source: This makes it easier to reuse the code. It is incorrect to put the configuration:
ca: Això fa més senzilla la reutilització del codi. És incorrecte posar la configuració:
es: Esto hace más sencilla la reutilización del código. Es incorrecto poner la configuración:

source: Hardwired in the code itself.
ca: Fixada estàticament al propi codi.
es: Fijada estáticamente al propio código.

source: In files committed to the same repository as the code.
ca: En fitxers guardats al mateix repositori que el codi.
es: En ficheros guardados al mismo repositorio que el código.

source: Implement and document build and installation procedures with widely used free tools
ca: Implementar i documentar procediments de build i instal·lació amb eines lliures i d’ús estès
es: Implementar y documentar procedimientos de build e instalación con herramientas libres y de uso extendido

source: Day1
ca: Dia1
es: Día1

source: It is very important not to delay build and installation automation, and documenting them. Without this information, the effort any developer has to put in to test the tool will probably be too great for anyone to try it.
ca: És molt important no esperar gens a construir i documentar un sistema de build del programari, ja que sense això l’esforç que ha de realitzar qualsevol desenvolupador per provar l’eina serà probablement massa gran com perquè ningú ho intenti.
es: Es muy importante no esperar para construir y documentar un sistema de build del software, ya que, sin ello, el esfuerzo que deberá realizar cualquier desarrollador para probar la herramienta será probablemente demasiado alto como para que nadie lo intente.

source: Documentation has to be sufficient for third parties to understand how to configure and deploy the product. Organisations awarded with contracts have to understand they will not have a monopoly over the configuration, deployment and maintenance of the product.
ca: La documentació ha de ser suficient perquè un tercer entengui com configurar i desplegar el producte. Les organitzacions adjudicatàries de contractes han d’entendre que no tindran el monopoli de la configuració, desplegament i manteniment del producte.
es: La documentación tiene que ser suficiente para que un tercero entienda como configurar y desplegar el producto. Las organizaciones adjudicatorias de contratos tienen que entender que no tendrán el monopolio de la configuración, despliegue y mantenimiento del producto.

source: Needless to say, users and potential collaborators in a free software project cannot be forced to depend on tools that are not free as well, and, it is best to choose the most commonly used ones which the majority of developers are most familiar with. That might vary from one community to another. Some examples of commonly used build tools (some of which can also be used in configuration and installation procedures) that we recommend are:
ca: Per suposat no es pot obligar als usuaris i potencials col·laborador d’un projecte de codi obert a dependre d’eines que no siguin alhora programari lliure, i dins d’aquestes convé triar les d’ús més estès i que resultin més familiars a la majoria de desenvolupadors. Això últim pot variar d’una comunitat a una altra. Alguns exemples d’eines de build (algunes també serveixen per als procediments de configuració i instal·lació) d’ús comú i que recomanem son:
es: Por supuesto, no se puede obligar a los usuarios y potenciales colaboradores de un proyecto de software libre a depender de herramientas que no sean al mismo tiempo libres, y, dentro de estas, conviene escoger las de uso más extendido y que resulten más familiares para la mayoría de desarrolladores. Esto último puede variar de una comunidad a otra. Algunos ejemplos de herramientas de _build_ (algunas también sirven para los procedimientos de configuración e instalación) de uso común y que recomendamos son las siguientes:

source: For Java projects: Maven, Gradle, Ant (also for other languages).
ca: Per a projectes Java: Maven, Ant (també serveix per altres llenguatges).
es: Para proyectos Java: Maven, Ant (también sirve para otros lenguajes).

source: For Python projects follow the advice of http://python-packaging.readthedocs.io/en/latest/index.html, which also includes information on packaging.
ca: Per a projectes Python recomanem seguir els consell de http://python-packaging.readthedocs.io/en/latest/index.html, que inclouen també informació sobre empaquetament.
es: Para proyectos Python recomendamos seguir los consejos de http://python-packaging.readthedocs.io/en/latest/index.html, que incluyen también información sobre empaquetado.

source: For JavaScript projects (and front-end in general): Gulp.
ca: Per a projectes JavaScript (i per front-end en general): Gulp.js.
es: Para proyectos JavaScript (y para front-end en general): Gulp.js.

source: For Ruby projects: Rake.
ca: Per a projectes Ruby: Rake.
es: Para proyectos Ruby: Rake.

source: General use: Nix, CMake.
ca: Ús general: CMake, Nix.
es: Uso general: CMake, Nix.

source: Packaging and deployment
ca: Empaquetat i desplegament
es: Empaquetado y despliegue

source: Get the successful bidder responsible for deployment to use the same code published in the main repository
ca: Obligar a l’adjudicatari que fa el desplegament a usar el mateix codi publicat al repositori principal
es: Obligar al adjudicatario que hace el despliegue a usar el mismo código publicado en el repositorio principal

source: As a condition of transparency, the source code used at any time in building and deploying the services in production must be available in the City Council’s public repository, preferably under the `master` branch. Any security patch, improvement or modification of any kind that is applied to the code in production must be reflected in the repository.
ca: Com a condició de transparència, el codi font que en cada moment s’utilitza per construir (build) i desplegar els serveis en producció ha d’estar disponible en el repositori públic de l’Ajuntament, preferentment sota la branca master. Qualsevol patch de seguretat, millora o modificació de qualsevol tipus que s’apliqui al codi en producció s’ha de reflectir al repositori.
es: Como condición de transparencia, el código fuente que en cada momento se utiliza para construir (build) y desplegar los servicios en producción debe estar disponible en el repositorio público del Ayuntamiento, preferentemente bajo la rama master. Cualquier patch de seguridad, mejora o modificación de cualquier tipo que se aplique al código en producción debe reflejarse en el repositorio.

source: The code available in the public repository is the one fully covered by a free software licence. Nothing can be added to it.
ca: El codi disponible al repositori públic és el que està cobert totalment per una llicència lliure. No s’hi pot fer cap afegit.
es: El código disponible en el repositorio público es el que está cubierto totalmente por una licencia libre. No se puede hacer ningún añadido.

source: Establish and explicit versioning policy in the ``README`` file
ca: Establir una política de versions explícita en el fitxer ``README``
es: Establecer una política de versiones explícita en el fichero ' ' README``

source: Every repository should have an explicit versioning policy. Software projects normally use version identifiers based on `MAJOR.MINOR.PATCH` number sequences.
ca: Convé que cada repositori tingui una política de versions explícita. Els projectes de programari utilitzen normalment identificadors de versions basats en seqüències de nombres de l’estil `MAJOR.MINOR.PATCH`.
es: Es conveniente que cada repositorio tenga una política de versiones explícita. Los proyectos de software utilizan normalmente identificadores de versiones basados en secuencias de números del estilo `MAJOR.MINOR.PATCH`.

source: A suitable versioning policy must be chosen for each project. Each technological community (Java, Python, Drupal, etc.) might have a preferred versioning policy so it is advisable to find out which one it is and stick to it. If there is no clear policy, we can subscribe to a well-known generic policy, such as http://semver/[Semantic Versioning].
ca: Cal escollir una política de versions adient a cada projecte. Cada comunitat tecnològica (Java, Python, Drupal, etcètera) pot tenir una política de versions preferent i és aconsellable informar-se de quina és i adherir-s’hi. En cas que no hi hagi una política clara podem adherir-nos a una política genèrica i ben coneguda, com el http://semver/[Semantic Versioning].
es: Hay que escoger una política de versiones adecuada a cada proyecto. Cada comunidad tecnológica (Java, Python, Drupal, etcétera) puede tener una política de versiones preferente, y es aconsejable informarse de cuál es y adherirse a ella. En caso de que no haya una política clara, nos podemos adherir a una política genérica y bien conocida, como http://semver/[Semantic Versioning].

source: Use free formats and standards
ca: Ús de formats i estàndards oberts
es: Uso de formatos y estándares abiertos

source: Check the user interface of web applications are strictly based on widely adopted W3C standards
ca: Comprovar que la interfície d’usuari que compleix amb els estàndards del W3C, en cas d’aplicacions web
es: Comprobar que la interfaz de usuario cumple con los estándares del W3C, en caso de aplicaciones web

source: User interfaces, whether they are for public, administration or internal use, have to comply with World Wide Web Consortium (W3C) standards. They should not require the use of features provided by privately owned browser extensions.
ca: Les interfícies web d’usuari, tant les d’ús per als ciutadans com les d’administració i ús intern, han de complir amb els estàndards del World Wide Web Consortium (W3C) i no han de requerir l’ús de funcionalitats proporcionades per extensions propietàries dels navegadors.
es: Las interfaces web de usuario, tanto las de uso para los ciudadanos como las de administración y uso interno, deben cumplir con los estándares del World Wide Web Consortium (W3C) y no tienen que requerir el uso de funcionalidades proporcionadas por extensiones propietarias de los navegadores Gecko (Firefox), WebKit/Blink (Chrome, Safari, Konqueror) o Trident/EdgeHTML (Microsoft).

source: The presentation has to be displayed correctly, and the product has to be fully functional, with browsers of the following families:
ca: La presentació s’ha de visualitzar correctament, i el producte ha de ser plenament funcional, amb els navegadors de la família:
es: La presentación se tiene que visualizar correctamente, y el producto debe ser plenamente funcional, con los navegadores de la familia:

source: Use open formats in exchanging files with the citizens and for internal use
ca: Utilitzar formats oberts en l’intercanvi de documents amb el ciutadà i amb altres sistemes
es: Utilizar formatos abiertos en el intercambio de documentos con los ciudadanos y con otros sistemas

source: Any exchange of documents that involves downloading or uploading files to the developed system has to be done exclusively with open formats, as defined by the Barcelona City Council xref:en/tech-sovereignty:interoperability.adoc[Technological Sovereignty Guide].
ca: Tot l’intercanvi de documents amb el ciutadà que impliqui la descàrrega o càrrega de fitxers s’ha de produir exclusivament amb formats oberts, segons la definició que en dona la Guia de Compra Tecnològica de l’Ajuntament de Barcelona.xref:en/tech-sovereignty:interoperability.adoc[Technological Sovereignty Guide].
es: Todo el intercambio de documentos con los ciudadanos que implique la descarga o carga de ficheros debe producirse exclusivamente con formatos abiertos, según la definición que ofrece la xref:en/tech-sovereignty:interoperability.adoc[Guía de compra tecnológica] del Ayuntamiento de Barcelona.

source: For text documents, spreadsheets and presentations, the following formats are acceptable:
ca: Pels documents de text, fulls de càlcul i presentacions, els següents formats son acceptables:
es: Para documentos de texto, hojas de cálculo y presentaciones, los siguientes formatos son aceptables:
