Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/collaborative-development.po
Languages: ca, es

source: Plain Text based formats that have a stable and free implementation available (for generation, edition and parsing) in all main IT platforms including GNU/Linux.
ca: Text pla basat en formats que disposen d'una implementació lliure i estable (per la generació, edició i ingestió) en les principals plataformes incloent GNU/Linux.
es: Formatos basados en texto sin formato que tienen una implementación estable y gratuita disponible (para generación, edición y análisis) en todas las plataformas de TI principales, incluyendo GNU / Linux.

source: OpenDocument formats, https://www.oasis-open.org/[].
ca: OpenDocument Format, https://www.oasis-open.org/[].
es: OpenDocument format, https://www.oasis-open.org/[].

source: PDF files.
ca: format PDF.
es: archivos PDF.

source: We reject proprietary formats from Microsoft Office and Apple's iWork (`.doc[x]`, `.ppt[x]`, etc.)
ca: Rebutgem formats propietaris com els de Microsoft Office i Apple iWork (`.doc[x]`, `.ppt[x]`, etc.)
es: Rechazamos los formatos propietarios de Microsoft Office e iWork de Apple (`.doc [x]`, `.ppt [x]`, etc.)

source: Images, audio and video will also be exchanged by means of open formats for which a stable and free implementation exists in all main IT platforms including GNU/Linux.
ca: L’intercanvi d’imatges, àudio i vídeo també es realitzarà mitjançant formats oberts pels quals existeixin implementacions lliures en les principals plataformes informàtiques incloent GNU/Linux.
es: Imágenes, audio y vídeo también se realizará mediante formatos abiertos para los que existan implementaciones libres en las principales plataformas informáticas, incluyendo GNU/Linux.

source: A temporary exception to this rule is justified if we need to interchange information with an existing service currently used at IMI that only accepts some non-open format.
ca: Es justifica una excepció temporal a aquesta regla si necessitem intercanviar informació amb un servei actualment existent a l'IMI que només accepta algun format no obert.
es: Una excepción temporal a esta regla se justifica si necesitamos intercambiar información con un servicio existente actualmente usado en el IMI que solo acepta algún formato no abierto.

source: Internationalisation
ca: Internacionalització
es: Internacionalización

source: Define and budget the technical requirements so the product can be translated and internationalised
ca: Definir i pressupostar els requeriments tècnics per què el producte pugui ser traduït i internacionalitzat
es: Definir y presupuestar los requerimientos técnicos para que el producto pueda ser traducido e internacionalizado

source: All the messages shown to users have to be internationalised. Use the usual mechanisms in each language/platform.
ca: Tots els missatges mostrats a l’usuari han d’estar internacionalitzats. Utilitzar els mecanismes habituals en cada llenguatge/plataforma.
es: Todos los mensajes mostrados a los usuarios tienen que estar internacionalizados. Deben utilizarse los mecanismos habituales en cada lenguaje y plataforma.

source: The standard tool for multi-lingual messages in free software projects is https://www.gnu.org/software/gettext/[`gettext`].
ca: L'eina estàndard per a missatges multi-lingües en projectes de programari lliure és https://www.gnu.org/software/gettext/[`gettext`].
es: La herramienta estándar para mensajes mulilíngue en proyectos de software libre es https://www.gnu.org/software/gettext/[`gettext`].

source: Freeing software that was proprietary
ca: Obertura d’un codi inicialment tancat
es: Apertura de un código inicialmente cerrado

source: The City Council owns the copyright of a lot of code that was not provided under a free software license, and it is therefore proprietary software.
ca: L'Ajuntament és propietari dels drets d'autor de molt codi que no es va proporcionar sota una llicència de programari lliure i, per tant, és un programari propietari.
es: El Ayuntamiento es propietario de los derechos de autor de mucho código que no se proporcionó bajo una licéncia de software libre y, por lo tanto, es un software propietario.

source: This section addresses those issues that specifically affect the public release under a free license of software components that were not delivered as free software, and in most cases developed without public distribution in mind.
ca: En aquest apartat s’explica com preparar un codi que era tancat per, a partir de la decisió de publicar-lo, poder-lo evolucionar i mantenir en obert.
es: Esta sección aborda aquellos problemas que afectan específicamente a la publicación bajo una licencia libre de componentes de software que no se entregaron como software libre, y que en la mayoría de los casos se desarrollaron sin prever una distribución pública.

source: Judge whether it is convenient or not to publicly distribute some City Council software
ca: Jutjar la conveniència o no de publicar un codi en poder de l’Ajuntament
es: Juzgar la conveniencia o no de publicar un código en poder del Ayuntamiento

source: Before releasing an existing software component or system in use at Barcelona City Council under a free software licence, we need to check whether:
ca: Abans de publicar sota llicència lliure un component o sistema software ja existent i en ús a l’Ajuntament de Barcelona cal comprovar que:
es: Antes de publicar bajo licencia libre un componente o sistema de software ya existente y en uso en el Ayuntamiento de Barcelona hay que comprobar lo siguiente:

source: It corresponds to a general need: it could be useful to more institutions or organisations, besides the City Council.
ca: Correspon a una necessitat general: pot ser d’utilitat per a més institucions o organitzacions, a més de l’Ajuntament.
es: Corresponde a una necesidad general: puede ser de utilidad para más instituciones u organizaciones, además del Ayuntamiento.

source: It has some aspect that sets it apart from other, existing free software solutions.
ca: Té algun aspecte que el diferencia favorablement d’altres solucions obertes existents.
es: Tiene algún aspecto que lo diferencia favorablemente de otras soluciones libres existentes.

source: Barcelona City Council holds legal title over the whole code it aims to release, or can obtain legal title.
ca: L’Ajuntament de Barcelona és titular legal de tot el codi que es pretén alliberar, o pot fer gestions per obtenir aquesta titularitat.
es: El Ayuntamiento de Barcelona es titular legal de todo el código que se pretende liberar, o puede hacer gestiones para obtener esta titularidad.

source: It can be used on free software platforms.
ca: Es pot executar sobre plataformes lliures.
es: Se puede ejecutar sobre plataformas libres.

source: The code (and associated documentation) is sufficiently developed and of a high enough quality, or the improvement requirements have been clearly identified and there is a strategy for tackling them.
ca: El codi (i la documentació associada) té la qualitat i la maduresa suficients, o bé els requeriments de millora estan clarament identificats i existeix una estratègia per abordar-los.
es: El código y la documentación asociada tienen la calidad y la madurez suficientes, o bien los requerimientos de mejora están claramente identificados y existe una estrategia para abordarlos.

source: Freeing the code will not pose any legal risks for either party.
ca: L’obertura de la solució no suposarà riscos legals per a cap part.
es: La apertura de la solución no supondrá riesgos legales para ninguna parte.

source: Resources are available for responding to maintenance issues until this responsibility is handed over to other bodies or organisations, possibly a free software community of developers and users.
ca: Es disposa dels recursos per respondre a incidències de manteniment mentre no es traspassi aquesta responsabilitat a d’altres entitats, possiblement una comunitat oberta de desenvolupadors i usuaris.
es: Se dispone de los recursos para responder a incidencias de mantenimiento mientras no se traspase esta responsabilidad a otras entidades, posiblemente una comunidad de desarrolladores y usuarios.

source: Look for sensitive information or user settings in the code repository
ca: Buscar al repositori de codi informació sensible o configuracions d’usuari
es: Buscar en el repositorio de código información sensible o configuraciones de usuario

source: Notify in new public spaces geared towards developers that this was a non-free project
ca: Avisar als nous espais públics orientats a desenvolupadors que aquest era un projecte tancat
es: Avisar en los nuevos espacios públicos orientados a desarrolladores de que este era un proyecto cerrado

source: This means explaining that, up to a certain date, the project did not operate in the public eye, so some inconvenience is to be expected. Developer and user expectations regarding the quality and transparency of some aspects of the project need to be lowered. The commitments made to make it possible to free the code also need explaining. For example, there may be lots of sensitive data in the code repository (specific user data, etcetera) so it has been decided to remove the version control history and create a new top-skim repository that only contains the latest version.
ca: Es tracta d’explicar que el projecte ha funcionat fins a un determinat moment com un projecte tancat i per tant cal esperar certes inconveniències. Convé reduir les expectatives del nous usuaris i desenvolupadors en quant a qualitat i transparència d’alguns elements del projecte. S’han d’explicar els compromisos als que s’ha hagut d’arribar per fer possible l’obertura. Per exemple, és possible que en el repositori de codi hi hagi moltes dades sensibles (dades d’usuaris concrets, etcètera) i que s’hagi optat per perdre l’historial del control de versions i crear un repositori nou top-skim que només contingui la darrera versió.
es: Se trata de explicar que el proyecto ha funcionado hasta un determinado momento como un proyecto cerrado y, por lo tanto, pueden esperarse ciertas inconveniencias. Conviene reducir las expectativas de los nuevos usuarios y desarrolladores en cuanto a calidad y transparencia de algunos elementos del proyecto. Deben explicarse los compromisos a los que se ha tenido que llegar para hacer posible la apertura. Por ejemplo, es posible que en el repositorio de código haya muchos datos sensibles (datos de usuarios concretos, etcétera) y que se haya optado por perder el historial del control de versiones y crear un repositorio nuevo top-skim que solo contenga la última versión.

source: This information should be published in at least the following places:
ca: Aquesta informació convé publicar-la com a mínim a:
es: Esta información conviene que sea publicada como mínimo en los siguientes espacios:

source: The development website (now public).
ca: La web de desenvolupament (ara pública i oberta).
es: La web de desarrollo (ahora pública).

source: Public mail lists.
ca: Llistes de correu públiques.
es: Listas de correo públicas.

source: The aim of this measure is to avoid an avalanche of requests.
ca: L’objectiu d’aquesta mesura és evitar un allau de peticions inassumibles.
es: El objetivo de esta medida es evitar un alud de peticiones inasumibles.

source: Warn developers of the possible consequences of the project's imminent public release
ca: Avisar als desenvolupadors de les possibles conseqüències de la imminent obertura del projecte
es: Avisar a los desarrolladores de las posibles consecuencias de la inminente apertura del proyecto

source: If we have a way of contacting people who have participated or who are participating in a project we are going to release, for example, by means of private emails, it is worth informing them (not negotiating) of this fact. Freeing a code that was not initially written to be free software might make its authors uncomfortable, so we need to explain that that’s normal. The following work can be referred to, to help clarify the situation: http://producingoss.com/en/opening-closed-projects.html.
ca: Si tenim alguna manera, per exemple mitjançant llistes de correu privades, d’accedir a les persones que han participat o que participen en un projecte que anem a obrir, és convenient notificar aquest fet. El fet d’obrir un codi que no es va escriure des de l’inici per ser obert pot provocar incomoditat als seus autors, i cal explicar que això és normal. Es pot referir el següent treball per ajudar a aclarir la situació: http://producingoss.com/en/opening-closed-projects.html.
es: Si tenemos alguna manera —por ejemplo, mediante listas de correo privadas— de acceder a las personas que han participado o que participan en un proyecto que vamos a publicar, es conveniente notificar este hecho. El hecho de publicar un código que no se escribió desde el principio para ser software libre puede provocar incomodidad a sus autores, y hay que explicar que se trata de algo normal. Se puede referir el siguiente trabajo para ayudar a aclarar la situación: http://producingoss.com/en/opening-closed-projects.html.
