Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/communities.po
Languages: ca, es

source: Potential users
ca: Potencials usuaris i usuaries
es: Potenciales usuarios y usuarias

source: Maintain a permanent private communication channel for discussing conflicts of interest
ca: Mantenir un canal de comunicació privat permanent per discutir conflictes d’interès
es: Mantener un canal de comunicación privado permanente para discutir conflictos de interés

source: Ideally a mail thread.
ca: Idealment un fil de correu.
es: Idealmente un hilo de correo.

source: When people are hired to take part in an established free software project, especially if they are developers that were already taking part in it, there could be a conflict of interest between the City Council project and the original source project. The developers will have the feeling they have to serve two superiors and cannot always satisfy both.
ca: Quan es contracta gent per participar en un projecte de codi obert ja establert, sobretot si son desenvolupadors que ja participaven al projecte, els interessos del projecte de l’Ajuntament i els del projecte de codi obert original poden entrar en conflicte. Els desenvolupadors tindran la sensació que han de servir a dos caps i que no sempre es pot satisfer als dos.
es: Cuando se contrata a personas para participar en un proyecto de software libre ya establecido, sobre todo si son desarrolladores que ya participaban en el proyecto, los intereses del proyecto del Ayuntamiento y los del proyecto original pueden entrar en conflicto. Los desarrolladores tendrán la sensación de que tienen que servir a dos jefes y que no siempre se puede satisfacer a los dos.

source: We have to ask for maximum transparency in these cases and try to anticipate these situations.
ca: S’ha de demanar màxima transparència en aquests casos i intentar anticipar aquestes situacions.
es: Se tiene que pedir máxima transparencia en estos casos e intentar anticipar estas situaciones.

source: Free software community management and governance
ca: Gestió i governança de comunitats obertes
es: Gestión y gobernanza de comunidades de software libre

source: Recognise people who make contributions to the project
ca: Donar reconeixement a les persones que fan contribucions al projecte
es: Otorgar reconocimiento a las personas que hacen contribuciones al proyecto

source: All individuals that have made a relevant contribution to the code or the documentation should appear in a `CONTRIBUTORS` file in the repository’s root directory.
ca: En un fitxer `CONTRIBUTORS` a l’arrel del repositori. A nivell individual.
es: En un fichero CONTRIBUTORS en la raíz del repositorio. De manera individual.

source: Budget for the extra cost of encouraging the creation of a free software community
ca: Pressupostar el sobrecost d’incentivar la creació d’una comunitat oberta
es: Presupuestar el sobrecoste de incentivar la creación de una comunidad de software libre

source: This includes things such as developers dedicating time on:
ca: Això inclou coses com que els desenvolupadors dediquin temps a:
es: Esto incluye cuestiones como que los desarrolladores dediquen tiempo a lo siguiente:

source: Revising the code of others
ca: Revisar codi de tercers
es: Revisar código de terceros

source: Replying to messages in the project communication channels
ca: Respondre missatges als canals de comunicació del projecte
es: Responder mensajes en los canales de comunicación del proyecto

source: Intervening in StackOverflow
ca: Intervenir a StackOverflow
es: Intervenir en StackOverflow

source: Draw up and update an internal document establishing the level of commitment we want from each party
ca: Redactar i actualitzar un document intern establint el grau de compromís que volem tenir amb cada part
es: Redactar y actualizar un documento interno estableciendo el grado de compromiso que queremos tener con cada parte

source: Pay special attention to possible early adopters.
ca: Prestar especial atenció als possibles early adopters.
es: Hay que prestar especial atención a los posibles early adopters.

source: In the contract, stipulate that the awardee has to include external contributions if the City Council so decides
ca: Establir per contracte que l’adjudicatari ha d’incloure contribucions externes si ho decideix l’Ajuntament
es: Establecer por contrato que el adjudicatario debe incluir contribuciones externas si lo decide el Ayuntamiento

source: Publication
ca: Publicació
es: Publicación

source: Example clause: *External contributions*.
ca: Exemple de clàusula: *Contribucions externes*.
es: Ejemplo de cláusula: contribuciones externas

source: While the contract remains in force, including the warranty period, the awardee has an obligation to integrate any external contributions that Barcelona City Council considers will improve the source code or the public documentation and which do not involve developing features not provided for in the contract, for example, those that fix bugs.
ca: Durant la duració del contracte, incloent el període de garantia, l’adjudicatari té l’obligació d’integrar aquelles contribucions externes que l’Ajuntament de Barcelona consideri que milloren el codi o la documentació pública i que no impliquen el desenvolupament de funcionalitat no prevista en el contracte per part de l’adjudicatari, per exemple aquelles que solucionen bugs.
es: Durante la duración del contrato, incluyendo el periodo de garantía, el adjudicatario tiene la obligación de integrar aquellas contribuciones externas que el Ayuntamiento de Barcelona considere que mejoran el código o la documentación pública y que no implican el desarrollo de funcionalidades no previstas en el contrato por parte del adjudicatario, por ejemplo, las que solucionan bugs.

source: Publish brief Developer Guidelines
ca: Publicar unes breus Directrius per desenvolupadors (Developer Guidelines)
es: Publicar unas breves directrices para desarrolladores

source: Day1
ca: Dia1
es: Día1

source: These guidelines establish the technical and social conventions that determine interactions between developers, and between developers and users. They apply to all developers, both those hired by the City Council and external developers, as well as Council staff.
ca: Aquesta guia estableix les convencions tècniques i socials que determinen les interaccions entre desenvolupadors, i entre desenvolupadors i usuaris. És d’aplicació per tots els desenvolupadors, tant els contractats per l’Ajuntament, com els externs, com el personal del mateix Ajuntament.
es: Esta guía establece las convenciones técnicas y sociales que determinan las interacciones entre desarrolladores, y entre desarrolladores y usuarios. Es de aplicación para todos los desarrolladores, tanto los contratados por el Ayuntamiento como los externos, y también para el personal del propio Ayuntamiento.

source: They must be drawn up in English and either be a GitHub/Gitlab wiki page or a text file with light markup language.
ca: S’ha de redactar en anglès i ha de ser, o bé una pàgina de la pròpia wiki de GitHub, o bé un fitxer de text amb llenguatge de marques lleuger.
es: Debe redactarse en inglés y tiene que ser o bien una página de la propia wiki de GitHub, o bien un fichero de texto con lenguaje de marcas ligero.

source: The guidelines might grow over time but, initially, only three things need to be made clear:
ca: La guia pot créixer amb al temps, però a l’inici només cal deixar clares tres coses:
es: La guía puede crecer con el tiempo, pero al principio solo hace falta dejar claras tres cuestiones:

source: What communication channels the project has and what each one is used for.
ca: Quins son els canals de comunicació de que disposa el projecte i per a què s’utilitza cadascun.
es: Cuáles son los canales de comunicación de los que dispone el proyecto y para qué se utiliza cada uno.

source: Instructions on how to report bugs and how to make contributions to the project.
ca: Instruccions de com reportar defectes (bugs) i de com fer contribucions al projecte.
es: Instrucciones de cómo reportar defectos (bugs) y de cómo hacer contribuciones al proyecto.

source: A brief description of project governance: who takes decisions and how.
ca: Una descripció breu de com és la governança del projecte: qui i com pren les decisions.
es: Una descripción breve de cómo es la gobernanza del proyecto: quién y cómo toma las decisiones.

source: In many cases the only thing that needs to be said about the third point is that while the contract is in force, the City Council will prioritise the features to be developed and the bugs to be sorted out. The Council also has the last word on the technical solutions to be adopted, the contributions to be integrated and the versions to be published. It might also be mentioned that in the future an appropriate governance model will be studied for the project’s changing circumstances.
ca: En molts casos només caldrà dir que durant la duració del contracte en vigor l’Ajuntament és qui prioritza les funcionalitats a desenvolupar, els defectes a arreglar. També té la última paraula sobre les solucions tècniques a adoptar, les contribucions a integrar i les versions a publicar. Es pot dir que en un futur s’estudiarà un model de governança adequat a l’evolució de les circumstàncies del projecte.
es: En muchos casos solo habrá que especificar que durante la duración del contrato en vigor el Ayuntamiento es quien prioriza las funcionalidades que desarrollar y los defectos que arreglar. También tiene la última palabra sobre las soluciones técnicas que adoptar, las contribuciones que integrar y las versiones que publicar. Se puede decir que en el futuro se estudiará un modelo de gobernanza adecuado a la evolución de las circunstancias del proyecto.

source: These Developer Guidelines should, as a minimum, be linked from:
ca: Aquestes Directrius per desenvolupadors han d’estar enllaçades com a mínim des de:
es: Estas directrices para desarrolladores tienen que estar enlazadas como mínimo desde:

source: The `README` file of the main repository.
ca: El fitxer `README` del repositori principal.
es: El fichero README del repositorio principal.

source: Publish detailed Developer Guidelines (if the project grows)
ca: Publicar unes Directrius per desenvolupadors (Developer Guidelines) detallades (si el projecte creix)
es: Publicar unas directrices para desarrolladores (developer guidelines) detalladas (si el proyecto crece)

source: For big projects, and without it being the first measure to adopt, it could be useful to work on and publish some broader, more detailed Developer Guidelines than those proposed in the link:#publicar-breus-directrius-desenvolupadors[Measure: (Day 1) Publish brief Developer Guidelines].
ca: Per projectes grans, i sense que sigui la primera mesura a prendre, pot ser interessant treballar i publicar unes Directrius per desenvolupadors més extenses i detallades que el que es proposa a la link:#publicar-breus-directrius-desenvolupadors[Mesura: (Dia 1) Publicar unes breus Directrius per desenvolupadors (*Developer Guidelines*)].
es: Para proyectos grandes, y sin que sea la primera medida, puede ser interesante elaborar y publicar unas directrices para desarrolladores más extensas y detalladas que las que se propone en la link:#publicar-breus-directrius-desenvolupadors[medida: (Día 1) Publicar unas breves directrices para desarrolladores (developer guidelines)].

source: Things that might be included:
ca: Coses que s’hi poden incloure:
es: Puntos que se pueden incluir:

source: Codification conventions
ca: Convencions de codificació
es: Convenciones de codificación

source: Documentation conventions
ca: Convencions per a la documentació
es: Convenciones para la documentación

source: Some examples:
ca: Alguns exemples:
es: Algunos ejemplos:

source: Draw up a governance model for the global community that supports the product
ca: Redactar un model de governança per la comunitat global que dona suport al producte
es: Redactar un modelo de gobernanza para la comunidad global que dé soporte al producto

source: Projects that generate entirely free software tools and systems by means of a development service promoted and financed by the City Council will have to include a governance model that includes, among other things, an approach to defining the community (of other councils, specialists such as geodata or libraries, etc.), the support tools, communication and marketing, the processes for including external contributions, managing intellectual property and sustainability after the project.
ca: Els projectes que generen sistemes i eines completament FOSS a través d’un servei de desenvolupament promogut i finançat per l’Ajuntament hauran d’incloure un model de governança que inclogui, entre d’altres: una aproximació a la definició de la comunitat (d’altres Ajuntaments, especialistes com geodata o biblioteques, etc.), les eines de suport, la comunicació i el marketing, els processos per la inclusió de contribucions externes, la gestió de la propietat intel·lectual i la sostenibilitat més enllà del projecte.
es: Los proyectos que generan sistemas y herramientas completamente FOSS (free and open source software) a través de un servicio de desarrollo promovido y financiado por el Ayuntamiento tendrán que incluir un modelo de gobernanza que incluya, entre otros: una aproximación a la definición de la comunidad (de otros Ayuntamientos, especialistas como geodata o bibliotecas, etcétera), las herramientas de soporte, la comunicación y el márquetin, los procesos para la inclusión de contribuciones externas, la gestión de la propiedad intelectual y la sostenibilidad más allá del proyecto.

source: Community governance and the technical management of these projects, including approval of the code for its incorporation in the project and defining the requirements (roadmap), are different aspects. A diversity of contributions will be encouraged, although IMI will retain effective control over developments financed using public funds.
ca: La governança de la comunitat i la gestió tècnica d’aquests projectes, inclosa l’aprovació del codi per a la seva incorporació al projecte i la definició de requeriments (roadmap), son aspectes diferents. Es promourà la diversitat de contribucions però l’IMI mantindrà el control efectiu dels desenvolupaments finançats per fons públics.
es: La gobernanza de la comunidad y la gestión técnica de estos proyectos, incluida la aprobación del código para su incorporación en el proyecto y la definición de requerimientos (roadmap), son aspectos diferentes. Se promoverá la diversidad de contribuciones, pero el IMI mantendrá el control efectivo de los desarrollos financiados por fondos públicos.

source: Proper use of the communication channels
ca: Ús adequat dels canals de comunicació
es: Uso adecuado de los canales de comunicación

source: Avoid private debates
ca: Evitar els debats privats
es: Evitar los debates privados

source: It is very tempting to have closed discussion forums where a small group of people discuss all the aspects of the project, on both a technical and a social level, and from there come the decisions. But it needs to be borne in mind that open, public communication channels are essential to free software projects, so everyone can read them and subscribe to them with a certain ease. The reasons are as follows:
ca: És molt temptador tenir fòrums de debat tancats on un petit grup de persones discuteixen tots els aspectes del projecte, tant a nivell tècnic com social, i que d’allà en surtin les decisions. Però convé tenir molt en compte que en els projectes de codi obert resulten imprescindible els canals de comunicació oberts i públics, que tothom pot llegir i als que tothom es pot subscriure amb certa facilitat. Les raons son les següents:
es: Es muy tentador tener foros de debate cerrados donde un pequeño grupo de personas discuten todos los aspectos del proyecto, tanto por la parte técnica como por la social, y que de allí salgan las decisiones. Pero conviene tener muy en cuenta que en los proyectos de software libre resultan imprescindible los canales de comunicación abiertos y públicos, que todo el mundo puede leer y a los que todo el mundo se puede suscribir con cierta facilidad. Los motivos son los siguientes:

source: It is very difficult for people to want to make significant contributions to a project where the decisions are taken in a non-transparent way, like a “fait accompli” policy. That does not mean that project governance has to work like a democracy. The essential prerequisite is *transparency*: people will want to know why and how decisions are taken, and perhaps have their say, without the option they put forward necessarily being the one chosen. Experienced developers know that the project has certain needs and not everyone can take part in decision-making with the same weight. When in the end decisions are taken by the City Council, everyone will understand that if it is made clear from the start, as specified in the link:#publicar-breus-directrius-desenvolupadors[Measure: (Day 1) Publish brief Developer Guidelines].
ca: És molt difícil que la gent vulgui fer contribucions significatives a un projecte on les decisions es prenen de forma opaca i com a política "de fets consumats". Això no vol dir que la governança del projecte hagi de funcionar com una democràcia. El requisit primordial és la *transparència*: la gent voldrà saber per què i com es prenen les decisions, i potser també dir-hi la seva, sense que necessàriament la opció que proposen sigui l’escollida. Els desenvolupadors experimentats saben que el projecte té unes necessitats i que no tothom pot participar en les decisions amb el mateix pes. Que al final les decisions les prengui l’Ajuntament és quelcom que tothom entendrà si es deixa clar des de l’inici, com s’especifica a la link:#publicar-breus-directrius-desenvolupadors[Mesura: (Dia 1) Publicar unes breus Directrius per desenvolupadors (*Developer Guidelines*)].
es: Es muy difícil que la gente quiera hacer contribuciones significativas en un proyecto donde las decisiones se toman de forma opaca y como política de hechos consumados. Eso no significa que la gobernanza del proyecto tenga que funcionar como una democracia. El requisito primordial es la *transparencia*: los participantes querrán saber por qué y cómo se toman las decisiones, y quizás también compartir sus ideas, sin que necesariamente la opción que proponen sea la escogida. Los desarrolladores experimentados saben que el proyecto tiene unas necesidades y que no todo el mundo puede participar en las decisiones con el mismo peso. Que al final las decisiones las tome el Ayuntamiento es algo que todos entenderán si se deja claro desde el principio, como se especifica en la link:#publicar-breus-directrius-desenvolupadors[medida (Día 1) Publicar unas breves directrices para desarrolladores (developer guidelines)].

source: It is surprising how many good ideas can be selflessly expressed through the public communication channels, if all aspects of the project are discussed there in a friendly working climate.
ca: És sorprenent la quantitat de bones idees que desinteressadament poden arribar a través dels canals de comunicació públics, si en aquests es discuteixen tots els aspectes del projecte i hi ha un clima de treball cordial.
es: Es sorprendente la cantidad de buenas ideas que desinteresadamente pueden llegar a través de los canales de comunicación públicos, si en estos se discuten todos los aspectos del proyecto y hay un clima de trabajo cordial.

source: If the communication takes place in public mail lists and is then filed, anyone can consult the decision log and avoid repeating previous discussions.
ca: Si les comunicacions es fan en llistes de correu públiques i arxivades, es pot consultar tot l’historial de decisions i no tornar a repetir debats.
es: Si las comunicaciones se hacen en listas de correo públicas y archivadas, se puede consultar todo el historial de decisiones y no volver a repetir debates.

source: Open, public channels foster a more effective, polite and assertive communication culture.
ca: Que els canals siguin oberts i públics incentiva una cultura comunicativa més eficaç, educada i assertiva.
es: Que los canales sean abiertos y públicos incentiva una cultura comunicativa más eficaz, educada y asertiva.

source: Establish the “Contributor Covenant” as the Code of Conduct for the project and its communication channels
ca: Establir el "Contributor Covenant" com a Codi de conducta del projecte i dels seus canals de comunicació
es: Establecer el contributor covenant como código de conducta del proyecto y de sus canales de comunicación

source: A project’s *Code of Conduct* is a document or series of documents that regulates the social rules of participants’ conduct when taking part in the project, including the following aspects:
ca: El *Codi de conducta* d’un projecte és un document o conjunt de documents que regulen les normes socials d’actuació per als participants en el projecte, incloent els següents aspectes:
es: El *código de conducta* de un proyecto es un documento o conjunto de documentos que regulan las normas sociales de actuación para los participantes en el proyecto, incluyendo los siguientes aspectos:

source: Participation rules in all online communication channels associated with the project, such as chat rooms, public and private mail lists, issue managers, feature development tools and pull requests, wikis, blogs, Twitter, forums, etc.
ca: Normes de participació en tots els canals de comunicació telemàtics associats al projecte, tals com xats, llistes de correu públiques i privades, eines de seguiment d’incidències (issue trackers), eines de desenvolupament de funcionalitats i pull-requests, wikis, blogs, Twitter, fòrums, etc.
es: Normas de participación en todos los canales de comunicación telemáticos asociados al proyecto, como chats, listas de correo públicas y privadas, herramientas de seguimiento de incidencias (issue trackers), herramientas de desarrollo de funcionalidades y pull-requests, wikis, blogs, Twitter, foros, etcétera.

source: Conduct rules for face-to-face activities of the community associated with the project, such as meetings and conferences.
ca: Normes de conducta per activitats presencials de la comunitat associada al projecte, tals com trobades i congressos.
es: Normas de conducta para actividades presenciales de la comunidad asociada al proyecto, como encuentros y congresos.

source: A code of conduct serves as a written reference for behaviour that is considered inappropriate for people taking part in the project. More specifically, the https://www.contributor-covenant.org/ has been used by many free software projects lately, so it may be familiar to lots of developers already. It has also been translated into various languages.
ca: Un codi de conducta serveix per tenir una referència escrita de quins comportaments es consideren inadequats per als participants del projecte. En concret el de https://www.contributor-covenant.org/ l’utilitzen darrerament molts projectes de codi obert, i per tant pot ser que molts desenvolupadors ja hi estiguin familiaritzats. També es troba traduït a vàries llengües.
es: Un código de conducta sirve para tener una referencia escrita de qué comportamientos se consideran inadecuados para los participantes del proyecto. En concreto, el de https://www.contributor-covenant.org/ lo utilizan últimamente muchos proyectos de software libre, y, por lo tanto, puede ser que muchos desarrolladores ya estén familiarizados con él. También se encuentra traducido a varios idiomas.

source: Create a link from at least:
ca: Enllaçar com a mínim des de:
es: Enlazar como mínimo desde los siguientes elementos:
