Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/communities.po
Languages: ca, es

source: The Developer Guidelines in the _Measure_: _(Day 1) Publish brief Developer Guidelines_.
ca: Les Directrius per desenvolupadors de la mesura _Mesura_: _(Dia 1) Publicar unes breus Directrius per desenvolupadors (*Developer Guidelines)_.
es: Las directrices para desarrolladores de la _medida_: _(Día 1) Publicar unas brevesdirectrices para desarrolladores (developer guidelines)_.

source: Do not allow any insults or personal attacks in the communication channels
ca: No deixar passar cap insult o atac personal als canals de comunicació
es: No dejar pasar ningún insulto o ataque personal en los canales de comunicación

source: A policy of zero tolerance should be maintained in this regard. That doesn’t mean expelling people at the drop of a hat (sometimes that would not even be possible), it means someone has to be in charge of systematically pointing out that certain types of behaviour are not tolerated in this project.
ca: Convé mantenir una política de tolerància zero en aquest aspecte. Això no vol dir expulsar a la gent a la primera de canvi (en ocasions no serà ni tan sols possible), vol dir que algú s’ha d’encarregar de fer constar sistemàticament que certs comportaments no es toleren en aquest projecte.
es: Conviene mantener una política de tolerancia cero en este aspecto. Eso no significa hacer expulsiones directas (en ocasiones no será ni siquiera posible), significa que alguien se tiene que encargar de hacer constar sistemáticamente que ciertos comportamientos no se toleran en este proyecto.

source: If it is considered opportune, they can refer to the relevant sections of the Code of Conduct (#h:c3405dee-679e-42e0-9ba6-141a0ad06965[Measure: Establish the “Contributor Covenant” as the Code of Conduct for the project and its communication channels]).
ca: Si es considera oportú, es pot fer referència a les seccions pertinents del Codi de conducta (#h:c3405dee-679e-42e0-9ba6-141a0ad06965[Mesura: Establir el «Contributor Covenant» com a Codi de conducta del projecte i dels seus canals de comunicació]).
es: Si se considera oportuno, se puede hacer referencia a las secciones pertinentes del código de conducta (#h:c3405dee-679e-42e0-9ba6-141a0ad06965[medida Establecer el contributor covenant como código de conducta del proyecto y de sus canales de comunicación]).

source: At http://producingoss.com/en/setting-tone.html#prevent-rudeness there is some information on how to handle these situations.
ca: A http://producingoss.com/en/setting-tone.html#prevent-rudeness es donen alguns detalls de com gestionar aquestes situacions.
es: En http://producingoss.com/es/setting-tone.html#prevent-rudeness se dan algunos detalles de cómo gestionar estas situaciones.
