Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/communities.po
Languages: ca, es

source: Free software communities
ca: Comunitats obertes
es: Comunidades de software libre

source: There are many levels of participation in a free software project, and none of them should be closed. Apart from the development team, who are usually hired for that purpose, other people might contribute on an occasional or ongoing basis. This chapter focuses on the more social aspects of how to work in this kind of community which is created around these projects.
ca: En un projecte de codi obert hi ha molts nivells de participació, i convé no tancar-se a cap d’ells. A més del l’equip principal de desenvolupament, normalment persones contractades per a tal fi, pot haver-hi col·laboracions puntuals o continuades per part d’altres persones. Aquest capítol es centra en els aspectes més socials de com treballar en el tipus de comunitat que es crea al voltant d’aquests projectes.
es: En un proyecto de software libre hay muchos niveles de participación, y conviene no cerrarse a ninguno de ellos. Además del equipo principal de desarrollo, normalmente personas contratadas para este fin, puede haber colaboraciones puntuales o continuadas por parte de otras personas. Este capítulo se centra en los aspectos más sociales de cómo trabajar en el tipo de comunidad que se crea en torno a estos proyectos.

source: Contributing to free software communities
ca: Contribuir en comunitats obertes
es: Contribuir en comunidades de software libre

source: The concept of contribution covers much more than the code. It can also consist in:
ca: El concepte de contribució va més enllà del codi. També pot consistir en:
es: El concepto de contribución va más allá del código. También puede consistir en lo siguiente:

source: Translations
ca: Traduccions
es: Traducciones

source: Documentation
ca: Documentació
es: Documentación

source: Bug reports
ca: Notificació de deficiències (Bug reports)
es: Notificación de deficiencias (bug report)

source: Other tasks
ca: Altres
es: Otros

source: A basic rule is that the contributions are always individual, both in our own projects as well as when we contribute to external projects. That means it is always possible to trace the specific person who has done it, even if they work or participate on behalf of an organisation. The reasons for this are:
ca: Una norma bàsica és que les contribucions son sempre individuals, tant en els nostres projectes com quan contribuïm a projectes externs. Això vol dir que es pot traçar sempre quina persona concreta l’ha realitzat, encara que treballi o participi en nom d’alguna organització. Les raons d’això son que:
es: Una norma básica es que las contribuciones son siempre individuales, tanto en nuestros proyectos como cuando contribuimos en proyectos externos. Eso quiere decir que se puede trazar siempre qué persona concreta la ha realizado, aunque trabaje o participe en nombre de alguna organización. Las razones de esto son varias:

source: It is the only model which free software projects are structurally equipped to handle.
ca: És l’única entitat per la que els projectes de codi obert estan estructuralment equipats per gestionar.
es: Es la única entidad que los proyectos de software libre están estructuralmente equipados para gestionar.

source: In free software projects, reputation is what makes everything tick, and that is earned or lost individually. People will rely more or less on the code someone has developed depending on the strength of previous contributions; their opinions in the communication channels and decision-making will carry more or less weight, etc.
ca: Dins dels projectes de codi obert la reputació és com la moneda que fa funcionar tota la maquinària, i aquesta es guanya o es perd de forma individual. Segons la solidesa demostrada en contribucions anteriors es confiarà més o menys en el codi que ha fet algú, les seves opinions als canals de comunicació i presa de decisions tindran més o menys pes, etc.
es: Dentro de los proyectos de software libre, la reputación es como la moneda que hace funcionar toda la maquinaria, y esta se gana o se pierde de forma individual. Según la solidez demostrada en contribuciones anteriores, se confiará más o menos en el código que ha hecho una persona concreta, sus opiniones en los canales de comunicación y toma de decisiones tendrán más o menos peso, etcétera.

source: Developers who regularly work on free software projects are used to this model. It makes interaction easier when they collaborate remotely. It is also useful for them in developing a professional career.
ca: Els desenvolupadors que treballen habitualment en projectes de codi obert estan acostumats a aquest model. Fa més senzilles les interaccions quan es col·labora a distància. També és d’interès per ells per construir-se una carrera professional.
es: Los desarrolladores que trabajan habitualmente en proyectos de software libre están acostumbrados a este modelo. Hace más sencillas las interacciones cuando se colabora a distancia. También es de interés para ellos para construirse una carrera profesional.

source: The other important consideration in this section, which applies if we want to modify an existing external component, is it is always better if our code modifications are incorporated, sooner or later, into the original product. That way we can:
ca: L’altra consideració important en aquest apartat, aplicable si volem modificar un component extern ja existent, és que sempre és molt convenient que les nostres modificacions al codi quedin incorporades, tard o d’hora, al producte original. Amb això aconseguim:
es: La otra consideración importante en este apartado, aplicable si queremos modificar un componente externo ya existente, es que siempre es muy conveniente que nuestras modificaciones al código queden incorporadas, tarde o temprano, al producto original. Con eso conseguimos lo siguiente:

source: Reduce future maintenance costs. If the integration is 100%, maintaining the features we have integrated might work out at zero cost to us.
ca: Reduir el cost futur de manteniment. Si la integració és total, pot ser fins i tot que el manteniment de les funcionalitats integrades ens surti a cost 0.
es: Reducir el coste futuro de mantenimiento. Si la integración es total, puede ocurrir incluso que el mantenimiento de las funcionalidades integradas nos salga a coste cero.

source: Benefit from future improvements to the original product contributed by others.
ca: Beneficiar-nos de futures millores del producte original aportades per altres parts.
es: Beneficiarnos de futuras mejoras del producto original aportadas por otras partes.

source: If more people use our features, the City Council will appear as an institution that contributes to the project and free software communities as a whole. In the long run that could give it prestige and influence.
ca: Si més gent utilitza la nostra funcionalitat, l’Ajuntament apareixerà com una institució que aporta al projecte i al comú global de les comunitats de programari lliure. Això a la llarga li pot donar capacitat prestigi i influència.
es: Si más personas utilizan nuestra funcionalidad, el Ayuntamiento aparecerá como una institución que aporta al proyecto y al común global de las comunidades de software libre. Eso, a la larga, puede dar capacidad, prestigio e influencia.

source: Bear in mind, however, that we can plan to facilitate this integration but, usually, we cannot guarantee it will happen in the initial stages of a project. Each community has its own rules of governance and decision-making rules which must be respected. But one thing that is worth doing is to keep everybody informed of our plans at all times and try to ensure they converge with those of the community we are addressing:
ca: Tenir en compte, però, que podem planificar per facilitar aquesta integració, però normalment no podrem garantir que es produeixi en les etapes inicials d’un projecte. Cada comunitat té les seves regles de governança i presa de decisions, i s’han de respectar. Però el que sí convé fer és informar en tot moment dels nostres plants i intentar que convergeixin amb els de la comunitat a la que ens adrecem. Com diu a http://producingoss.com/en/contracting.html#community-review-acceptance:
es: No obstante, hay que tener en cuenta que podemos planificar para facilitar esta integración, pero normalmente no podremos garantizar que se produzca en las etapas iniciales de un proyecto. Cada comunidad tiene sus reglas de gobernanza y toma de decisiones, y deben respetarse. Sin embargo, lo que sí es conveniente es informar en todo momento de nuestros planes e intentar que converjan con los de la comunidad a la que nos dirigimos:

source: Producing Open Source Software
es: Hacer que la autoría de cada contribución

source: "Don't think of community scrutiny as an obstacle to be overcome — think of it as a free design board and QA department. It is a benefit to be aggressively pursued, not an obstacle to be merely endured."
es: No pienses en el escrutinio de la comunidad como un obstáculo que salvar, piensa en él como un equipo de diseño y un departamento de calidad a coste cero. El escrutinio y participación de la comunidad Es un beneficio que buscar agresivamente, no un obstáculo que soportar.

source: Ensure the authorship of each contribution (code, documentation or messages) is individual
ca: Fer que l’autoria de cada contribució (codi, documentació o missatge) sigui individual
es: Hacer que la autoría de cada contribución (código, documentación o mensaje) sea individual

source: Adaptation
ca: Adaptació
es: Adaptación

source: NewProduct
ca: NouProducte
es: NuevoProducto

source: Don't hide the team's contributions under a corporate identity in our own projects or external projects. In other words, use the usernames and individual email addresses of each participant for the commits in the repository, as well as when participating in the project communication channels or management tools.
ca: No amagar les contribucions de l’equip, ni a un projecte propi, ni a un d’extern, sota una identitat corporativa. És a dir, tant als commit al repositori, com quan es participa en canals de comunicació del projecte o en eines de gestió, utilitzar noms d’usuari i adreces de correu individuals de cada persona participant.
es: No hay que esconder las contribuciones del equipo, ni en un proyecto propio ni en uno externo, bajo una identidad corporativa. Es decir, tanto en los commits en el repositorio como cuando se participa en canales de comunicación del proyecto o en herramientas de gestión, deben utilizarse nombres de usuario y direcciones de correo individuales de cada persona participante.

source: If any individual contributes to a software project as a worker hired directly or indirectly by the City Council on some occasions, and as a volunteer in his or her free time on other occasions, they will have to use two different emails, depending on the case:
ca: Si un mateix individu contribueix a un projecte de programari a vegades com a treballador contractat directament o indirecta per l’Ajuntament, i d’altres vegades com a voluntari en el seu temps lliure, aleshores ha d’utilitzar dues adreces de correu diferents, segons el cas:
es: Si un mismo individuo contribuye a un proyecto de software a veces como trabajador contratado directa o indirectamente por el Ayuntamiento y otras veces como voluntario en su tiempo libre, tiene que utilizar dos direcciones de correo diferentes, según el caso:

source: A personal email when making voluntary contributions.
ca: Una de personal quan faci contribucions voluntàries.
es: Una personal, cuando haga contribuciones voluntarias.

source: A company or City Council email when carrying out tasks specified by their contract.
ca: Una de l’empresa, o bé una proporcionada per l’Ajuntament, quan compleixi amb tasques especificades al seu contracte.
es: Una de la empresa, o bien proporcionada por el Ayuntamiento, cuando cumpla con tareas especificadas en su contrato.

source: Inform the technical communities of the component to be modified about our plans
ca: Informar dels nostres plans a les comunitats tècniques del component a modificar
es: Informar de nuestros planes a las comunidades técnicas del componente que modificar

source: If we want to modify or adapt an existing component, we have to be open and clear about our reasons. As it is a free software component, they cannot prevent us from making modifications. However, we strongly advise informing them of our needs and technical plans beforehand.
ca: Si el que volem és modificar i adaptar un component ja existent, cal que siguem oberts i clars respecte de les nostres motivacions. En ser el component de programari lliure, no ens poden negar fer-hi modificacions. No obstant això, és molt convenient informar prèviament de les nostres necessitats, i de la nostra planificació tècnica.
es: Si lo que queremos es modificar y adaptar un componente ya existente, es necesario que seamos abiertos y claros respecto a nuestras motivaciones. Como el componente es de software libre, no nos pueden negar hacer modificaciones. No obstante, es muy conveniente informar previamente de nuestras necesidades y de nuestra planificación técnica.

source: We need to ensure the support community of the component that is to be modified understands and gets involved in our proposal.
ca: Cal esforçar-se per tal que la comunitat de suport del component a modificar entengui i s’involucri en la nostra proposta.
es: Hay que esforzarse para que la comunidad de soporte del componente que modificar entienda nuestra propuesta y se involucre en ella.

source: Inform other relevant technical communities of our plans
ca: Informar dels nostres plans a d’altres comunitats tècniques rellevants
es: Informar de nuestros planes a otras comunidades técnicas relevantes

source: Free software communities are usually very interested in contributing ideas, technical knowledge and even working extra hours of work, when faced with technical challenges they believe could benefit them.
ca: Les comunitats de programari lliure acostumen a estar molt interessades en aportar idees, coneixement tècnic, i fins i tot hores de feina més enllà d’això, davant de reptes tècnics i projectes que creguin que les poden beneficiar.
es: Las comunidades de software libre suelen estar muy interesadas en aportar ideas, conocimiento técnico e, incluso, horas de trabajo ante retos técnicos y proyectos que crean que las pueden beneficiar.

source: IMI projects will study the possibilities of collaborating with the local communities of free software and innovative technologies to promote social and technological innovation.
ca: Els projectes de l’IMI estudiaran les possibilitats de col·laboració amb les comunitats locals de programari lliure i tecnologies innovadores per promoure la innovació social i tecnològica.
es: Los proyectos del IMI estudiarán las posibilidades de colaboración con las comunidades locales de software libre y tecnologías innovadoras para promover la innovación social y tecnológica.

source: Hire developers who are recognised in the project we want to modify
ca: Contractar desenvolupadors reconeguts dins del projecte que es vol modificar
es: Contratar desarrolladores reconocidos dentro del proyecto que se quiere modificar

source: Procurement
ca: Contractar
es: Contratar

source: This could be done directly or by means of a contract with a company or cooperative that wins the tender.
ca: Pot ser directament o a través del contracte amb una empresa o cooperativa adjudicatària.
es: Puede ser directamente o a través del contrato con una empresa o cooperativa adjudicataria.

source: There are never any guarantees that the modifications we need to make will be accepted in the original product but relying on recognised developers will give us more options for achieving that. Aside from any technical knowledge they might have, they could bring:
ca: Mai hi ha garanties de que les modificacions que necessitem fer seran acceptades dins del producte original, però comptar amb desenvolupadors reconeguts és la via que ens dóna més opcions d’aconseguir-ho. Aquests poden aportar, a més del coneixement tècnic que puguin tenir:
es: Nunca hay garantías de que las modificaciones que necesitamos hacer vayan a ser aceptadas dentro del producto original, pero contar con desarrolladores reconocidos es la vía que nos da más opciones de conseguirlo. Estos pueden aportar, además del conocimiento técnico, los siguientes valores:

source: An insider's view of the technical ideas most likely to be accepted.
ca: Una visió des de dins de quines propostes tècniques poden tenir millor acceptació.
es: Una visión desde dentro de qué propuestas técnicas pueden tener mejor aceptación.

source: The value of being a respected figure in the community that takes decisions.
ca: El valor que aporta ser una veu respectada dins de la comunitat que pren decisions.
es: El reconocimiento que aporta ser una voz respetada dentro de la comunidad que toma decisiones.

source: Compel the contract winner to take measures that make it easier to integrate the changes in the original product
ca: Obligar a l’adjudicatari a mesures que facilitin integrar els canvis al producte original
es: Obligar al adjudicatario a implementar medidas que faciliten integrar los cambios en el producto original

source: That includes:
ca: Això inclou:
es: Eso incluye lo siguiente:

source: Clearly describing the collaborative tasks the contract winner is expected to take part in and explain that this is part of the budget, as described in the #h:a6bb27a3-2b23-4585-81ca-dc5b4d29ccd7[Measure: Budget for the extra costs of participating in the community of the product to be modified].
ca: Descriure amb claredat les tasques col·laboratives en que s’espera que l’adjudicatari s’involucri, i explicar que això forma part del pressupost, com es descriu a la #h:a6bb27a3-2b23-4585-81ca-dc5b4d29ccd7[Mesura: Pressupostar el sobrecost de participar en la comunitat oberta del producte a modificar].
es: Describir con claridad las tareas colaborativas en que se espera que el adjudicatario se involucre, y explicar que eso forma parte del presupuesto, como se describe en la #h:a6bb27a3-2b23-4585-81ca-dc5b4d29ccd7[medida Presupuestar el sobrecoste de participar en la comunidad abierta del producto que modificar].

source: The contract winner accepting and applying the Developer Guidelines, the rules for drafting documentation and the Code of Conduct for the project, if there is one, as well as other written documents governing any rules that might exist, both general and the specific rules for specific communication channels. Should the project not have a formal set of internal rules of its own, normal rules of netiquette will apply. https://www.ietf.org/rfc/rfc1855.txt.
ca: Que l’adjudicatari accepti i apliqui les Directrius de desenvolupament, les normes de redacció de documentació i el Codi de conducta del projecte, si en té, o altres documents escrits que regulin les normes que puguin existir, tant generals com a les específiques per canals de comunicació concrets. En cas de que el projecte no hagi formalitzat un corpus propi de normes internes, aplicaran les normes usuals de netiqueta, p.ex. https://www.ietf.org/rfc/rfc1855.txt.
es: Que el adjudicatario acepte y aplique las directrices de desarrollo, las normas de redacción de documentación y el código de conducta del proyecto, si lo tiene, u otros documentos escritos que regulen las normas que puedan existir, tanto generales como específicas por canales de comunicación concretos. En caso de que el proyecto no haya formalizado un corpus propio de normas internas, se aplicarán las normas usuales de netiqueta, por ejemplo, https://www.ietf.org/rfc/rfc1855.txt.

source: Certain awardee profiles becoming users of the project communication channels.
ca: Que determinats perfils de l’adjudicatari es creïn usuaris als canals de comunicació del projecte.
es: Que determinados perfiles del adjudicatario se creen usuarios en los canales de comunicación del proyecto.

source: Periodically informing the community of the modifications planned, the part done and the technical decisions being taken.
ca: Que s’informi periòdicament a la comunitat de les modificacions planificades, de la part executada, de les decisions tècniques que es van prenent.
es: Que se informe periódicamente a la comunidad de las modificaciones planificadas, de la parte ejecutada, de las decisiones técnicas que se van tomando.

source: Promptly informing IMI of all the feedback received by the community, both positive and negative, on the aims of integrating new features.
ca: Que s’informi puntualment a l’IMI de tot el feedback rebut per part de la comunitat, tant positiu com negatiu, sobre les pretensions d’integrar nova funcionalitat.
es: Que se informe puntualmente al IMI de todo el feedback recibido por parte de la comunidad, tanto positivo como negativo, sobre las pretensiones de integrar una nueva funcionalidad.

source: IMI staff will have to monitor all of this and possibly intervene directly in the community discussions.
ca: El personal de l’IMI haurà de fer seguiment de tot això i potser intervenir directament en els debats de la comunitat.
es: El personal del IMI deberá hacer seguimiento de todo ello y quizás intervenir directamente en los debates de la comunidad.

source: Penalise contractors if there are any changes in the project staff
ca: Penalitzar els adjudicataris si hi ha canvis en la plantilla del projecte
es: Penalizar a los adjudicatarios si hay cambios en la plantilla del proyecto

source: Measures to bear in mind when drawing up the contract specifications.
ca: A tenir en compte en la redacció del plec de contractació.
es: Debe tenerse en cuenta en la redacción del pliego de contratación.

source: A high turnover is detrimental to any project but especially when participating in free software projects. Developers who leave not only take with them any technical knowledge they might have accumulated, but also their status in the community and the human relationships they might have developed.
ca: Una alta rotació penalitza qualsevol projecte, però especialment quan es participa en projectes de codi obert. Els desenvolupadors que marxen no només s’emporten amb ells un el coneixement tècnic que puguin acumular, sinó el seu estatus dins la comunitat i les relacions humanes que hi puguin haver desenvolupat.
es: Una alta rotación penaliza cualquier proyecto, pero especialmente cuando se participa en proyectos de software libre. Los desarrolladores que se marchan no solo se llevan con ellos el conocimiento técnico que puedan acumular, sino su estatus dentro de la comunidad y las relaciones humanas que puedan haber desarrollado.

source: Budget for the extra costs of participating in the community of the product to be modified
ca: Pressupostar el sobrecost de participar en la comunitat oberta del producte a modificar
es: Presupuestar el sobrecoste de participar en la comunidad del producto a modificar

source: It needs to be specified in as much detail as possible to what extent IMI expects the contract awardee to be involved in the project and disseminate the features to be developed among:
ca: S’ha d’especificar de la manera més detallada possible com i en quina mesura l’IMI espera que l’adjudicatari s’involucrarà en el projecte i difondrà les funcionalitats a desenvolupar, tant en:
es: Se tiene que especificar de la manera más detallada posible cómo y en qué medida el IMI espera que el adjudicatario se involucre en el proyecto y difundir las funcionalidades que desarrollar, tanto en:

source: The development communities involved
ca: Les comunitats de desenvolupament implicades
es: Las comunidades de desarrollo implicadas
