Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/component-management.po
Languages: ca, es

source: Select components that IMI is already familiar with
ca: Afavorir components amb els que l’IMI ja ha adquirit familiaritat
es: Favorecer componentes con los que el IMI ya ha adquirido familiaridad

source: When we need to adapt an existing source code, if we know the project and the community that sustains it beforehand, it has lots of advantages:
ca: Quan necessitem adaptar un component de codi obert ja existent, conèixer per endavant el projecte i la comunitat que el sustenta presenta molts avantatges:
es: Cuando necesitamos adaptar un componente de software libre ya existente, conocer de antemano el proyecto y la comunidad que lo sustenta presenta muchas ventajas:

source: Perhaps IMI has already identified key people in the community.
ca: Pot ser que l’IMI tingui ja identificades persones clau dins la comunitat.
es: Puede ser que el IMI tenga ya identificadas personas clave dentro de la comunidad.

source: It is possible to make a more realistic estimate, in terms of time and money, of the cost of any intended modifications and the possibilities of them being integrated in to the original product.
ca: Es pot fer una estimació més realista del cost en temps i en diners de les modificacions que es pretén fer, i de les possibilitats que siguin integrades al producte original.
es: Se puede hacer una estimación más realista del coste en tiempo y en dinero de las modificaciones que se pretende hacer, y de las posibilidades de que sean integradas en el producto original.

source: Select components that have a licence compatible with the GPL licence
ca: Afavorir components amb una llicència compatible amb la GPL
es: Favorecer componentes con una licencia compatible con la GPL

source: The Free Software Foundation gives this information in its list of licences: https://www.gnu.org/licenses/license-list.en.html.
ca: Aquesta informació la dona la Free Software Foundation al seu llistat de llicències: https://www.gnu.org/licenses/license-list.en.html.
es: Esta información la ofrece la Free Software Foundation (FSF) en su listado de licencias: https://www.gnu.org/licenses/license-list.es.html.

source: The licences in the GPL family are some of the most common. To avoid licence conflicts with other components we might need, all our components should be GPL-compatible.
ca: Les llicències de la família de la GPL son unes de les més comunes. Per evitar conflictes de llicència amb altres components que possiblement necessitarem, convé que tots els nostres components siguin compatibles amb GPL.
es: Las licencias de la familia de la General Public License (GPL) son unas de las más comunes. Para evitar conflictos de licencia con otros componentes que posiblemente necesitaremos, conviene que todos nuestros componentes sean compatibles con GPL.

source: Select Debian stable components
ca: Afavorir components que formin part de la distribució estable de Debian
es: Favorecer componentes que formen parte de la distribución estable de Debian

source: Any solution component included in Debian’s stable distribution at the project design stage, or which can be run in the stable version without having to be adapted and which is multi-architecture, is considered to be a durable and reliable component.
ca: Tot component de la solució que estigui inclòs en la distribució Estable de Debian en el moment de dissenyar el projecte, o que es pugui executar sobre Debian Estable sense necessitat d’adaptació, i que sigui multi-arquitectura, es considera un component durador i fiable.
es: Todo componente de la solución que esté incluido en la distribución estable de Debian en el momento de diseñar el proyecto, o que se pueda ejecutar sobre Debian Estable sin necesidad de adaptación, y que sea multiarquitectura, se considera un componente duradero y fiable.

source: Otherwise, select components which, in their standard version downloadable to the project website, can be run on free software platforms, preferably GNU/Linux and without any restrictions in terms of:
ca: Si més no, afavorir components que puguin executar-se, en la seva versió estàndard descarregable a la web del projecte, sobre plataformes lliures, preferiblement GNU/Linux i sense que existeixin restriccions en quant a:
es: Cuando menos, hay que favorecer componentes que puedan ejecutarse, en su versión estándar descargable en la web del proyecto, sobre plataformas libres, preferiblemente GNU/Linux y sin que existan restricciones en cuanto a lo siguiente:

source: Requiring a particular GNU/Linux distribution (e.g. a program that only runs in CentOS environments and not on Debian).
ca: Requerir una distribució particular de GNU/Linux (per exemple un programari que només s’executi en entorns CentOS i no sobre Debian).
es: Requerir una distribución particular de GNU/Linux (por ejemplo, un software que solo se ejecute en entornos CentOS y no sobre Debian).

source: Versions of the main platform elements that are too specific, especially if they are too old or beyond their standard maintenance period (e.g. a program that requires a Linux kernel in a 3.* version, or some basic libraries of the system that are obsolete.
ca: Versions massa específiques dels elements principals de la plataforma, sobretot si es tracta de versions massa antigues o fora del seu període de manteniment estàndard (per exemple un programari que requereixi un kernel de Linux en una versió 3.*, o unes llibreries bàsiques del sistema desfasades).
es: Versiones demasiado específicas de los elementos principales de la plataforma, sobre todo si se trata de versiones demasiado antiguas o fuera de su periodo de mantenimiento estándar (por ejemplo, un software que requiera un kernel de Linux en una versión 3.*, o unas librerías básicas del sistema desfasadas).

source: Requiring a specific hardware architecture (e.g. solutions that only run on Intel machines).
ca: Requerir una arquitectura de hardware específica (per exemple, solucions que només s’executin en màquines Intel).
es: Requerir una arquitectura de hardware específica (por ejemplo, soluciones que solo se ejecuten en máquinas Intel).

source: Consider all the possibilities and implications before initiating a social fork
ca: Considerar totes les possibilitats i totes les implicacions abans d’iniciar un fork social
es: Considerar todas las posibilidades y todas las implicaciones antes de iniciar un fork social

source: When there is a code that has been published with a free licence but the product needs to be developed in a direction that is incompatible with the plans governing the project, it might be necessary to make a fork (in the strict sense of the word, a social fork).
ca: Quan es disposa d’un codi que ha estat publicat amb llicència lliure però es necessita evolucionar el producte en una direcció incompatible amb els plans de qui governa el projecte, pot ser necessari fer un fork (en el sentit fort del terme, o fork social).
es: Cuando se dispone de un código que ha sido publicado con licencia libre pero se necesita evolucionar el producto en una dirección incompatible con los planes de quien gobierna el proyecto, puede ser necesario hacer un fork (en el sentido fuerte del término, o social fork).

source: Creating a fork has many disadvantages, so it has to be the last resort. It is much more difficult to share code with the original product once the fork has been created. And perhaps even more significant, it implies splitting the original community and forcing each developer to decide which version to prioritise.
ca: Fer un fork té molts inconvenients, i per tant ha de ser un últim recurs. D’una banda, dificulta molt compartir codi amb el producte original a partir del moment del fork. I potser més significatiu, suposa dividir la comunitat original i obligar a cada desenvolupador a decidir quin projecte prioritza.
es: Hacer un fork tiene muchos inconvenientes, y, por lo tanto, tiene que ser el último recurso. Por una parte, dificulta mucho compartir código con el producto original a partir del momento del fork. Y, quizás más significativo, supone dividir la comunidad original y obligar a cada desarrollador a decidir qué proyecto prioriza.

source: Managing dependencies
ca: Gestió de dependències
es: Gestión de dependencias

source: Keep a thorough record of all the software packages used, which have to be free software
ca: Dur un registre exhaustiu de tots els paquets de programari utilitzats, que han de ser lliures
es: Llevar un registro exhaustivo de todos los paquetes de software utilizados, que tienen que ser libres

source: Procurement
ca: Contractació
es: Contratar

source: Publication
ca: Publicació
es: Publicación

source: In the case of a contract, include this in the specifications and add that IMI has the last word on including a dependency.
ca: En cas de contracte, posar-ho als plecs i afegir que l’IMI té l’última paraula sobre la inclusió d’una dependència.
es: En caso de contrato, debe indicarse en los pliegos y añadir que el IMI tiene la última palabra sobre la inclusión de una dependencia.

source: Procurement Clause: Managing software dependencies
ca: Exemple de clàusula: Gestió de les dependències de programari.
es: Ejemplo de cláusula: Gestión de las dependencias de software

source: The successful bidder should keep a thorough record of all the software packages used in the solution, which have to be distributed under a software licence accepted by the Free Software Foundation (https://www.gnu.org/licenses/license-list.en.html) or the Open Source Initiative (OSI, https://opensource.org/licenses). As an additional requirement, the licence for all packages used should not pose any incompatibility problems with the main product licence, EUPL-1.2. Barcelona City Council reserves the right to demand a software dependency be removed if it considers that it constitutes a legal risk and the successful bidder has to replace the package with another one, or cover the feature with a development of its own.
ca: L’adjudicatari durà un registre exhaustiu de tots els paquets de programari utilitzats en la solució, que han d’estar distribuïts sota una llicència de programari acceptada per la Open Source Initiative (OSI, https://opensource.org/licenses) o bé pel projecte GNU (https://www.gnu.org/licenses/license-list.en.html). Com a requisit addicional, la llicència de tots els paquets utilitzats no ha de produir problemes d’incompatibilitat amb la llicència principal del producte, la EUPL-1.2. L’Ajuntament de Barcelona es reserva la potestat d’exigir que es retiri una dependència de programari del producte si considera que pot constituir un risc legal i l’adjudicatari està obligat a substituir el paquet per un altre, o bé cobrir la funcionalitat amb desenvolupament propi.
es: El adjudicatario llevará un registro exhaustivo de todos los paquetes de software utilizados en la solución, que tienen que estar distribuidos bajo una licencia de software aceptada por la Open Source Initiative (OSI, https://opensource.org/licenses) o bien por el proyecto GNU (https://www.gnu.org/licenses/license-list.es.html). Como requisito adicional, la licencia de todos los paquetes utilizados no tiene que producir problemas de incompatibilidad con la licencia principal del producto, la EUPL-1.2. El Ayuntamiento de Barcelona se reserva la potestad de exigir que se retire una dependencia de software del producto si considera que puede constituir un riesgo legal y el adjudicatario está obligado a sustituir el paquete por otro, o bien cubrir la funcionalidad con desarrollo propio.

source: Use a licence monitoring program
ca: Utilitzar un programari de monitorització de llicències
es: Utilizar un software de monitorización de licencias

source: For example:
ca: Com per exemple:
es: Por ejemplo:

source: Do not copy external dependencies to the repository unless it is an exceptional case
ca: No copiar dependències externes al repositori si no és per una causa excepcional
es: No copiar dependencias externas al repositorio si no es por una causa excepcional

source: Sometimes it is decided to copy a sub-component that is available in an own repository to the repository of the component we are building (whether it is in source, binary or byte code). The term for this is a bundled dependency. The idea behind it is to make a deployment or development cycle easier, but it is regarded as bad practice because:
ca: A vegades es decideix copiar un sub-component que es troba disponible en un repositori propi al repositori del component que estem construint (sigui en forma de codi font, binari o de bytecode). Es diu que aquesta dependència es troba bundled. A vegades es busca amb això un desplegament o un cicle de desenvolupament més senzill, però es considera una mala pràctica ja que:
es: A veces se decide copiar un subcomponente que se encuentra disponible en un repositorio propio en el repositorio del componente que estamos construyendo (sea en forma de código fuente, binario o de bytecode). Se dice que esta dependencia se encuentra bundled. A veces se busca con eso un despliegue o un ciclo de desarrollo más sencillo, pero se considera una mala práctica por los siguientes motivos:

source: Changes and updates in the sub-component dirty the record of changes to the main component.
ca: Els canvis i actualitzacions en el sub-component embruten la història de canvis del component principal.
es: Los cambios y actualizaciones en el subcomponente ensucian la historia de cambios del componente principal.

source: It is more difficult to properly account for the authorship and licensing of each part of the code.
ca: És més difícil donar compte correctament de la autoria i llicenciament de cada part del codi.
es: Es más difícil dar cuenta correctamente de la autoría y licenciamiento de cada parte del código.

source: There might be exceptional circumstances that justify ignoring this measure, but they need to be explained to the project administration.
ca: Poden donar-se circumstàncies excepcionals que justifiquin no obeir aquesta mesura.
es: Pueden darse circunstancias excepcionales que justifiquen no obedecer esta medida.

source: Look for unsuitable dependencies and find replacements with a free licence
ca: Buscar les dependències inadequades i trobar substituts amb llicència lliure
es: Buscar las dependencias inadecuadas y encontrar sustitutos con licencia libre

source: The following components need to be deleted:
ca: S’han d’eliminar els components:
es: Deben eliminarse los componentes con las siguientes características:

source: Any with a proprietary licence.
ca: Amb llicència propietària.
es: Con licencia propietaria.

source: Any that are owned by Barcelona City Council but cannot be freed for the moment.
ca: Propietat de l’Ajuntament de Barcelona, però que de moment no es puguin obrir.
es: Propiedad del Ayuntamiento de Barcelona, pero que de momento no se puedan abrir.

source: Any that show any kind of licence incompatibility with the other product components to be freed.
ca: Que presentin algun tipus d’incompatibilitat de llicència amb altres components del producte a obrir.
es: Que presenten algún tipo de incompatibilidad de licencia con otros componentes del producto que abrir.

source: Any that cannot be installed in a free software operating system.
ca: Que no puguin ser instal·lats en un sistema operatiu lliure.
es: Que no puedan ser instalados en un sistema operativo libre.

source: Finance a security audit of the component to be used
ca: Finançar una auditoria de seguretat del component a utilitzar
es: Financiar una auditoría de seguridad del componente que utilizar

source: Finance meetings and hackathons on the component to be used
ca: Finançar trobades i hackatons relacionades amb el component a utilitzar
es: Financiar encuentros y hackathons relacionadas con el componente que utilizar

source: Involve IMI staff in development tasks
ca: Integrar personal de l’IMI en les tasques de desenvolupament
es: Integrar personal del IMI en las tareas de desarrollo

source: This can be done on a contract basis and for any development-related task:
ca: Es pot establir per contracte i pot ser qualsevol tasca relacionada amb el desenvolupament:
es: Se puede establecer por contrato y puede ser cualquier tarea relacionada con el desarrollo:

source: Writing code
ca: Escriptura de codi
es: Escritura de código

source: Writing documents
ca: Escriptura de documentació
es: Escritura de documentación

source: Revising code
ca: Revisions de codi
es: Revisiones de código

source: Creating, performing and analysing batteries of tests
ca: Creació, execució i anàlisi de bateries de proves
es: Creación, ejecución y análisis de baterías de pruebas

source: We want all our staff to be familiar with software that will continue to be used in the future, once the current contract has expired. The idea being to increase our technological sovereignty and avoid being dependent on single suppliers as much as possible.
ca: L’objectiu és tenir personal propi familiaritzat amb un programari que es seguirà utilitzant en el futur, un cop s’acabi el contracte de desenvolupament actual. Es tracta d’aprofundir en la sobirania i evitar el màxim la dependència de proveïdors únics.
es: El objetivo es tener personal propio familiarizado con un software que se seguirá utilizando en el futuro, una vez se acabe el contrato de desarrollo actual. Se trata de profundizar en la soberanía y evitar al máximo la dependencia de proveedores únicos.

source: Replace the usual private services
ca: Substitució de serveis privatius habituals
es: Sustitución de servicios privativos habituales

source: Use Matomo/Piwik for web analytics
ca: Utilitzar Piwik (si es necessita una eina d’analítica web)
es: Utilizar Piwik (si se necesita una herramienta de analítica web)

source: Do not use Google Analytics, use Matomo instead.
ca: No utilitzar Google Analytics. Utilitzar eines com Piwik en el seu lloc.
es: No hay que utilizar Google Analytics. En su lugar, pueden utilizarse herramientas como Piwik.

source: Use OpenStreetMap for showing cartographic information
ca: Utilitzar OpenStreetMap (si es necessita presentar informació cartogràfica present en aquesta eina)
es: Utilizar OpenStreetMap (si se necesita presentar información cartográfica presente en esta herramienta)

source: Do not use Google Maps, prefer OSM if cartographic information is required.
ca: No utilitzar Google Maps.
es: No hay que utilizar Google Maps.

source: Publish Android apps in F-Droid
ca: Publicar apps Android a F-Droid
es: Publicar apps Android en F-Droid (si uno de los productos es una app Android)

source: Apps for the Android platform should be published in the free F-Droid repository, as well as Google Play and those most people use.
ca: En el cas d’apps per la plataforma Android, publicar les apps al repositori lliure F-Droid, a més del repositori Google Play o aquells que més gent utilitzi.
es: En el caso de apps para la plataforma Android, publicar las apps en el repositorio libre F-Droid, además del repositorio Google Play o aquellos que más personas utilicen.
