Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/component-management.po
Languages: ca, es

source: Component management
ca: Gestió de components
es: Gestión de componentes

source: Look for and select free software components
ca: Cerca i selecció de components de codi obert
es: Búsqueda y selección de componentes de software libre

source: In all likelihood, unless our need is very specialised, there will already be a free software solution (or combination of solutions) that would solve the problem, at least partly.
ca: A no ser que la nostra necessitat sigui molt especialitzada, és probable que ja existeixi una solució lliure (o combinació de solucions) que resolgui el problema, com a mínim en part.
es: A no ser que nuestra necesidad sea muy especializada, es probable que ya exista una solución libre (o combinación de soluciones) que resuelva el problema, como mínimo en parte.

source: It is important to bear in mind that free software projects offer more possibilities of being transformed and adapted to our needs than traditional applications.
ca: Cal tenir en compte que els projectes de codi obert ofereixen més possibilitats de transformació i adaptació a les nostres necessitats que les aplicacions tradicionals.
es: Hay que tener en cuenta que los proyectos de software libre ofrecen más posibilidades de transformación y adaptación a nuestras necesidades que las aplicaciones tradicionales.

source: Finding out if a project suits our needs and meets the minimum requirements on a technical, legal and social level could prove costly. But the benefits of finding an existing project to join, instead of reinventing the wheel (and avoiding the so-called *Not invented here* or “*NIH* syndrome”) can be extraordinary, in the short and long terms:
ca: Conèixer si un projecte s’adequa a les nostres necessitats i compleix amb els mínims exigibles a nivell tècnic, legal i social pot resultar costós. Però els beneficis de trobar un projecte existent al que sumar-se, enlloc d’inventar novament la roda (i evitar l’anomenat síndrome *Not invented here*, "*NIH*"») poden ser extraordinaris, tant a curt com a llarg termini:
es: Conocer si un proyecto se adecua a nuestras necesidades y cumple con los mínimos exigibles en los aspectos técnico, legal y social puede resultar costoso. Pero los beneficios de encontrar un proyecto existente al que sumarse, en lugar de reinventar la rueda —y evitar el denominado síndrome *Not invented here* o *(NIH)*—, pueden ser extraordinarios, tanto a corto como a largo plazo:

source: To start with, maybe many of the features we need are already being implemented, so we could build prototypes and carry out concept tests very quickly.
ca: Pot ser que d’entrada moltes de les funcionalitats que necessitem ja estiguin implementades, i puguem construir molt ràpidament prototips i proves de concepte.
es: Puede ser que de entrada muchas de las funcionalidades que necesitamos ya estén implementadas, y podamos construir muy rápidamente prototipos y pruebas de concepto.

source: We can take advantage of the experience acquired by other users who have tried to implement a system similar to the one we want, possibly discovering opportunities we had not thought about.
ca: Podem beneficiar-nos de l’experiència adquirida per altres usuaris que ja han intentat implantar un sistema semblant al que volem, potser descobrint oportunitats que no havíem pensat.
es: Podemos beneficiarnos de la experiencia adquirida por otros usuarios que ya han intentado implantar un sistema parecido al que queremos, quizás descubriendo oportunidades que no habíamos pensado.

source: We can share the cost of building a complex tool with other users and organisations. This includes potential future features and applications, which could in turn interest other users.
ca: Podem compartir la despesa de construir una eina complexa amb d’altres usuaris i entitats. Això inclou potencials futures funcionalitats i ampliacions, que poden interessar també a d’altres usuaris.
es: Podemos compartir el gasto de construir una herramienta compleja con otros usuarios y entidades. Eso incluye potenciales futuras funcionalidades y ampliaciones, que pueden interesar también a otros usuarios.

source: If the product has a sufficiently large user base, we get a tool that develops over time, improving with the contributions of others, adapting to future technological changes and incorporating our new features or those of third parties. With very little outlay on maintenance we get long-term sustainability and less danger of creating a *technological debt*.
ca: Si el producte té una base d’usuaris suficients, obtenim una eina que evoluciona en el temps, millorant amb les aportacions d’altres parts, adaptant-se a futurs canvis tecnològics, incorporant noves funcionalitats nostres o de tercers. Amb molt poca despesa en manteniment obtenim sostenibilitat a llarg plaç i una reducció del perill de crear *deute tecnològic*.
es: Si el producto tiene una base de usuarios suficiente, obtenemos una herramienta que evoluciona en el tiempo, mejorando con las aportaciones de otras partes, adaptándose a futuros cambios tecnológicos, incorporando nuevas funcionalidades propias o de terceros. Con muy poco gasto en mantenimiento obtenemos sostenibilidad a largo plazo y una reducción del peligro de crear *deuda tecnológica*.

source: Look for an existing project or component that might solve the problem, perhaps partially
ca: Buscar un projecte o component existent que resolgui el problema, potser parcialment
es: Buscar un proyecto o componente existente que resuelva el problema, quizás parcialmente

source: Preliminary
ca: Disseny
es: Ante

source: design
ca: preliminar
es: proyecto

source: Integration
ca: Integració
es: Integración

source: Adaptation Plugin NewProduct
ca: Adaptació Plugin NouProducte
es: Adaptaciñon Plugin NuevoProducto

source: Besides using the normal search engines, it is worth going directly to the following sites:
ca: A més de fer servir dels motors de cerca habituals, convé buscar directament a llocs com:
es: Además de utilizar los motores de búsqueda habituales, conviene buscar directamente en sitios como los siguientes:

source: https://joinup.ec.europa.eu/solutions[Repository of the EU Joinup initiative solutions]
ca: https://joinup.ec.europa.eu/solutions[Repositori de solucions de la iniciativa Joinup de la UE]
es: https://joinup.ec.europa.eu/solutions[Repositorio de soluciones de la iniciativa Join up de la UE]

source: https://www.gnu.org/software/software.en.html[GNU software list]
ca: https://www.gnu.org/software/software.en.html[llista de programari de GNU]
es: https://www.gnu.org/software/software.en.html[Lista de software GNU]

source: https://administracionelectronica.gob.es/ctt/buscadorSoluciones.htm[Centro de Transferencia de Tecnología (CTT), Solutions finder].
ca: https://administracionelectronica.gob.es/ctt/buscadorSoluciones.htm[Cercador de solucions del Centro de Transferencia de Tecnología].
es: https://administracionelectronica.gob.es/ctt/buscadorSoluciones.htm[Buscador de soluciones del Centro de Transferencia de Tecnología].

source: Depending on the platform or technological architecture being worked on, it is also necessary to search for specialised repositories, such as the:
ca: Depenent de la plataforma o arquitectura tecnològica amb la que es treballi, també cal cercar en repositoris especialitzats, tals com:
es: Dependiendo de la plataforma o arquitectura tecnológica con la que se trabaje, también hay que buscar en repositorios especializados, tales como:

source: Drupal repository
ca: Repositori de Drupal
es: Repositorio de Drupal

source: CKAN repository
ca: Repositori de CKAN
es: Repositorio de CKAN

source: Fill in a comparative grid of the different components to be assessed to cover a need
ca: Omplir una graella comparativa dels diferents components a avaluar per cobrir una necessitat
es: Rellenar una tabla comparativa de los diferentes componentes que evaluar para cubrir una necesidad

source: PreliminaryDesign
ca: Abantprojecte
es: Anteproyecto

source: Adaptation
ca: Adaptació
es: Adaptación

source: NewProduct
ca: NouProducte
es: NuevoProducto

source: This might have to be repeated for every component in a system.
ca: Això pot haver-se de repetir per cadascun dels components d’un sistema.
es: Puede tener que repetirse para cada uno de los componentes de un sistema.

source: Example grid:
ca: Exemple de graella:
es: Ejemplo de tabla:

source: | Element | Component A | Component B | Component C | Name | | | | Licence (and conditions that might affect us) | | | | % of the feature we need | | | | IMI projects that already use it and people familiar with it. | | | | Commercial support | | | | Other large organisations that use it | | | | Activate the bug tracker | | | | Diversity of commits | | | | Diversity of organisations | | | | Tone and usefulness of the discussion forums | | | | Public communication of the project | | | | Code quality metrics | | | | Other considerations | | |
ca: | Element | Component A | Component B | Component C | Nom | | | | Llicència (i condicions que ens poden afectar) | | | | % de la funcionalitat que necessitem | | | | Projectes IMI que ja l’utilitzen i persones familiaritzades | | | | Suport comercial | | | | Altres organitzacions grans que l’utilitzen | | | | Activitat al bug tracker | | | | Diversitat de commits | | | | Diversitat d’organitzacion s | | | | To i utilitat dels fòrums de discussió | | | | Comunicació pública del projecte | | | | Mètriques de qualitat del codi | | | | Altres consideracions | | |
es: | Elemento | Componente A | Componente B | Componente C | Nombre | | | | Licencia (y condiciones que nos pueden afectar) | | | | % de la funcionalidad que necesitamos | | | | Proyectos IMI que ya lo utilizan y personas familiarizadas | | | | Soporte comercial | | | | Otras grandes organizaciones que lo utilizan | | | | Actividad en el bug | | | | Diversidad de commits | | | | Diversidad de organizaciones | | | | Tono y utilidad de los foros de discusión | | | | Comunicación pública del proyecto | | | | Méritos de calidad del código | | | | Otras consideracioness | | |

source: Other things that could be taken into account, besides the sub-measures below:
ca: Altres coses que es poden tenir en compte, a més de les sub-mesures de més avall:
es: Otras cuestiones que se pueden tener en cuenta, además de las submedidas que se desarrollan más adelante:

source: How easy the different components are to adapt and develop
ca: Facilitat d’adaptació i evolució dels diferents components
es: Facilidad de adaptación y evolución de los diferentes componentes

source: Immediate and long-term costs, including starting costs
ca: Cost immediat i cost a llarg termini, incloent els costos de sortida
es: Coste inmediato y coste a largo plazo, incluyendo los costes de salida

source: Existence of a local or global support network or informal community
ca: Existència d’una comunitat informal o xarxa de suport local i global
es: Existencia de una comunidad informal o red de soporte local y global

source: Innovative solutions (and the value that brings)
ca: Solucions innovadores (i valor que això aporta)
es: Soluciones innovadoras (y valor que eso aporta)

source: Impact on data privacy and sovereignty
ca: Impacte sobre la privacitat i la sobirania de dades
es: Impacto sobre la privacidad y la soberanía de datos

source: Choose components with a licence approved by the FSF or the OSI
ca: Triar components amb una llicència aprovada per la OSI o per la FSF
es: Escoger componentes con una licencia aprobada por la OSI o por la FSF

source: The two sets of valid licences are almost identical:
ca: Els dos conjunts de llicències vàlides son gairebé idèntics:
es: Los dos conjuntos de licencias válidas son casi idénticos:

source: https://www.gnu.org/licenses/license-list.en.html
es: https://www.gnu.org/licenses/license-list.es.html

source: Select components with a greater diversity and weight of contributors
ca: Afavorir components amb una major diversitat i pes dels contribuïdors
es: Favorecer componentes con una mayor diversidad y peso de los contribuyentes

source: Here we understand contributions in a broad sense: commits in the code repository, bug reports, translations, etc.
ca: Aquí entenem contribucions en un sentit ampli: commits al repositori de codi, bug reports, traduccions, etc.
es: Aquí entendemos contribuciones en un sentido amplio: commits en el repositorio de código, bug reports, traducciones, etcétera.

source: Diversity (different people and organisations involved) is more important than the number of contributions (e.g. the number of commits per month).
ca: És més important la diversitat (persones i entitats diferents que participen) que la quantitat de les contribucions (per exemple, nombre de commits per mes).
es: Es más importante la diversidad (personas y entidades diferentes que participan) que la cantidad de las contribuciones (por ejemplo, número de commits por mes).

source: If the component shows contributions by important organisations (companies of a certain size, universities, institutions), it is very likely that, even if some contributions fail, the project will continue. But it could also be a very good sign that lots of people make contributions on an individual basis and these are taken into account.
ca: Si el component presenta contribucions per part d’organitzacions importants (empreses d’una certa mida, universitats, institucions), és més probable que encara que algun dels contribuïdors falli el projecte continuï. Però també pot ser molt bona senyal que moltes persones a títol individual facin contribucions i que es tinguin en compte.
es: Si el componente presenta contribuciones por parte de organizaciones importantes (empresas de un cierto tamaño, universidades, instituciones), es más probable que, aunque alguno de los contribuyentes falle, el proyecto continúe. Pero también puede ser muy buena señal que muchas personas a título individual hagan contribuciones y que se tengan en cuenta.

source: Select components with recent activity
ca: Afavorir components amb activitat recent
es: Favorecer componentes con actividad reciente

source: First of all we need to look at the bug tracker, noting:
ca: Primer de tot cal mirar l’activitat al bug tracker, observant:
es: En primer lugar, hay que analizar la actividad en el bug tracker y observar lo siguiente:

source: The number of defects notified. We shouldn’t panic if there are a lot of open and unsolved notifications, because the number of issues and bugs tends to grow in a straight line with the number of users but the number of developers usually grows more slowly.
ca: Quantitat de notificacions de deficiències. No ens ha d’espantar que hi hagi moltes notificacions obertes i no resoltes, el nombre d’incidències tendeix a créixer linealment amb el nombre d’usuaris, però en canvi el nombre de desenvolupadors acostuma a créixer més lentament.
es: La cantidad de notificaciones de deficiencias. No nos tiene que alarmar que haya muchas notificaciones abiertas y no resueltas, el número de incidencias tiende a crecer linealmente con el número de usuarios, pero, en cambio, el número de desarrolladores suele crecer más lentamente.

source: Let the developers gradually respond to the issues. We want to stress this point: if there are a large number of users, there will always be lots of open issues. The important thing is to see whether the developers are regularly involved in the bug tracker, that they haven't abandoned it.
ca: Que els desenvolupadors estiguin responent a les incidències. Insistim: si el nombre d’usuaris és gran, hi haurà sempre moltes incidències obertes, però sí és important observar que els desenvolupadors participen habitualment al bug tracker, que no l’hagin abandonat.
es: Que los desarrolladores estén respondiendo a las incidencias. Insistimos: si el número de usuarios es elevado, habrá siempre muchas incidencias abiertas, pero es importante observar que los desarrolladores participan habitualmente en el bug tracker, que no lo hayan abandonado.

source: Then it is important to look at the project's public activity, bearing in mind:
ca: Després cal mirar l’activitat pública del projecte, tenint en compte:
es: Después hay que mirar la actividad pública del proyecto, teniendo en cuenta lo siguiente:

source: How long ago the latest releases were published, news items were posted in a blog or similar site.
ca: Antiguitat de les darreres releases públiques, notícies publicades en forma de blog o similar.
es: Antigüedad de las últimas releases públicas, noticias publicadas en forma de blog o similar.

source: The tone, usefulness and diversity of the participants in the project's discussion forums and public communication channels.
ca: El to, la utilitat i la diversitat de participants en el fòrums de discussió i canals de comunicació públics del projecte.
es: El tono, la utilidad y la diversidad de participantes en el foros de discusión y canales de comunicación públicos del proyecto.

source: Select components with full and up-to-date documentation
ca: Afavorir components amb una documentació complerta i al dia
es: Favorecer componentes con una documentación completa y al día

source: When the documentation is in a public repository and there is a good range of people contributing to it, that too is a very good sign.
ca: Que la documentació estigui en un repositori públic i que hi hagi una bona diversitat de persones que hi contribueixin també és un molt bon senyal.
es: Que la documentación esté en un repositorio público y que haya bastante diversidad de personas que contribuyan también es una muy buena señal.

source: Select components where there is commercial support available
ca: Afavorir components per als quals existeixi suport comercial
es: Favorecer componentes para los que exista soporte comercial

source: When products have a free software licence, it will always be possible to contact someone to get them modified, maintained or have problems solved. However, we have more guarantee of success if there are already companies or people offering professional support for the component in question, and it can therefore be assumed they are very familiar with it.
ca: En productes amb llicència lliure sempre serà possible contractar algú per tal que els modifiqui, mantingui o resolgui problemes. No obstant això, obtenim una major garantia d’èxit si ja existeixen empreses o persones que ofereixen suport professional sobre el component en qüestió, i que per tant cal assumir que el coneixen bé.
es: En productos con licencia libre, siempre será posible contratar a alguien a fin de que los modifique y mantenga o resuelva problemas. No obstante, obtenemos una mayor garantía de éxito si ya existen empresas o personas que ofrecen soporte profesional sobre el componente en cuestión, y que, por lo tanto, se puede asumir que lo conocen bien.

source: It is better if there are various companies offering commercial services in relation to the product than just one, because in the latter case we would be more dependent on that company. It is a normal business model for the company that develops the product (perhaps without hardly any external community support) to also offer commercial support for it. So it should not simply be discarded but it is better if the professional support is diversified.
ca: És millor que hi hagi diferents empreses oferint serveis comercials sobre el producte que no només una, ja que en aquest segon cas incorreríem en una dependència més forta cap a aquests empresa. És habitual un model de negoci en el que la mateixa empresa que desenvolupa el producte (potser sense gaire suport comunitari extern) ofereix també suport comercial sobre el mateix. No s’ha de descartar de per sí, però és millor que el suport professional es trobi diversificat.
es: Es mejor que haya diferentes empresas ofreciendo servicios comerciales sobre el producto que solo una, ya que en este segundo caso incurriríamos en una mayor dependencia hacia esta empresa. Es habitual un modelo de negocio en el que la misma empresa que desarrolla el producto (quizás sin mucho soporte comunitario externo) ofrezca también soporte comercial sobre este. No se tiene que descartar de entrada, pero es mejor que el soporte profesional se encuentre diversificado.

source: The fact that there are already companies offering professional services in relation to a product at the start could also make it easier to carry out a tentative evaluation of the cost of adapting or maintaining it.
ca: L’existència d’empreses que ja d’entrada ofereixen serveis professionals sobre un producte pot facilitar també realitzar una avaluació temptativa del cost que suposarà adaptar-lo o mantenir-lo.
es: La existencia de empresas que ya inicialmente ofrecen servicios profesionales sobre un producto puede facilitar también realizar una evaluación tentativa del coste que supondrá adaptarlo o mantenerlo.

source: Select components that provide access to development and installation information
ca: Afavorir components que facilitin l’accés a la informació sobre el desenvolupament i la instal·lació
es: Favorecer componentes que faciliten el acceso a la información sobre el desarrollo y la instalación

source: Transparency is a basic cornerstone of free software. Without it, it would be very difficult for all the rest to work well.
ca: La transparència és un pilar bàsic dels projectes de programari lliure, sense el qual és molt difícil que tota la resta funcioni bé.
es: La transparencia es un pilar básico de los proyectos de software libre, sin ella es muy difícil que todo el resto funcione bien.

source: If a component has precise, detailed instructions on how to install it, that makes the possibility of carrying out an independent technical assessment of it easier.
ca: Que un component ofereixi instruccions detallades i precises do com instal·lar-lo facilita que es pugui fer una avaluació tècnica independent del mateix.
es: Que un componente ofrezca instrucciones detalladas y precisas sobre cómo instalarlo facilita que se pueda hacer una evaluación técnica independiente de este.

source: Select components with good code quality metrics
ca: Afavorir components amb bones mètriques de qualitat del codi
es: Favorecer componentes con buenas métricas de calidad del código

source: The fact that project source codes and management tools (bug trackers, mail lists, forums) are public means that it is possible to obtain some objective metrics on free software that it would be very difficult to get in the case of privately owned software.
ca: El fet que tant el codi com les eines de gestió de projectes (bug-trackers, llistes de correu, fòrums) siguin públiques fa que sobre els projectes de programari lliure sigui possible extreure algunes mètriques objectives molt difícils d’aconseguir en el cas de programari privatiu.
es: El hecho de que tanto el código como las herramientas de gestión de proyectos (bug-trackers, listas de correo, foros) sean públicas implica que, sobre los proyectos de software libre, sea posible extraer algunas métricas objetivas muy difíciles de conseguir en el caso de software privativo.

source: Some metrics that can be obtained for certain projects:
ca: Algunes mètriques que es poden obtenir per certs projectes:
es: Algunas métricas que se pueden obtener para ciertos proyectos son las siguientes:

source: Number of comments, from https://openhub.net/[OpenHub].
ca: Quantitat de comentaris, a https://openhub.net/[OpenHub].
es: Cantidad de comentarios, en https://openhub.net/[OpenHub].

source: Percentage of source code in test cases
ca: Percentatge de codi cobert pels casos de prova.
es: Porcentaje de código cubierto por los casos de prueba.
