Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/document-organization.po
Languages: ca, es

source: Barcelona City Council's ethical mail box
ca: Bústia ètica de l'Ajuntament de Barcelona
es: Buzón ético del Ayuntamiento de Barcelona

source: There was an original piece of software, that of https://www.globaleaks.org/[Globaleaks], and the features of generating an internal file and sending a reply to the user in the form of a PDF were incorporated into that. These features are now part of the https://github.com/globaleaks/GlobaLeaks[Globaleaks main repository]’s master branch.
ca: Existia un programari original, el de https://www.globaleaks.org/[Globaleaks], al qual se li han incorporat les funcionalitats de generació d’expedient intern i de devolució de resposta a l’usuari en forma de PDF. Aquestes funcionalitats formen part ara mateix de la branca master del https://github.com/globaleaks/GlobaLeaks[repositori principal de Globaleaks].
es: Existía un software original, el de https://www.globaleaks.org/[Globaleaks], al que se le han incorporado las funcionalidades de generación de expediente interno y de devolución de respuesta al usuario en forma de PDF. Estas funcionalidades ahora mismo forman parte de la rama master del https://github.com/globaleaks/GlobaLeaks[repositorio principal de Globaleaks].

source: Customisation tasks have been carried out in the same project, including the translation of the interface into Catalan, but as some user texts are not for general use but instead are the City Council's own customisations, it has not been possible to contribute the translation itself to the original project.
ca: En el mateix projecte s’han desenvolupat tasques de personalització, incloent la traducció de la interfície al català, però com que alguns literals no son d’ús general sinó que son personalitzacions pròpies de l’Ajuntament, la traducció en sí no s’ha pogut contribuir al projecte original.
es: En el mismo proyecto se han desarrollado tareas de personalización, incluyendo la traducción de la interfaz al catalán, pero, como algunos literales no son de uso general, sino que son personalizaciones propias del Ayuntamiento, la traducción en sí no se ha podido aportar al proyecto original.

source: `Plugin` Use-case
ca: Escenari `Plugin`
es: Escenario `Plugin`

source: This is a use-case half way between integrating new features into an already existing product (<<use-case-adaptation, Adaptation Use-case>>) and developing a new product (<<use-case-new-product, NewProduct Use-case>>), and it shares features of both.
ca: Es tracta d’un escenari intermig entre la integració de funcionalitats noves a un producte ja existent (<<use-case-adaptation, Escenari Adaptació>>) i el desenvolupament d’un nou producte (<<use-case-new-product, Escenari Nou Producte>>) i comparteix característiques dels dos.
es: Se trata de un escenario intermedio entre la integración de funcionalidades nuevas en un producto ya existente (<<use-case-adaptation, escenario Adaptación>>) y el desarrollo de un nuevo producto (<<use-case-new-product, escenario Nuevo Producto>>), y comparte características de los dos.

source: On the one hand, it starts with an existing piece of software to which a feature has to be added. On the other hand, the software architecture is modular and provides for extension by means of a standardised mechanism that enables semi-independent development of the new modules in such a way that some aspects are quite similar to a new product. In particular, the new modules have their own repository (which is not a copy of the original product's repository) and the releases are not linked to those of the framework product.
ca: D'una banda, es parteix d’un programari ja existent al qual s’ha d’afegir funcionalitat. De l’altre, l’arquitectura d’aquest programari és modular i preveu l’extensió mitjançant un mecanisme estandaritzat que permet una evolució semi-independent dels nous mòduls, de tal manera que en alguns aspectes s’assemblen bastant a un producte nou. En particular, els nous mòduls tenen el seu repositori propi (que no és una còpia del repositori del producte original), i les entregues estan desvinculades de les del producte marc.
es: Por un lado, se parte de un software ya existente al que se tiene que añadir funcionalidad. Por el otro, la arquitectura de este software es modular y prevé la extensión mediante un mecanismo estandarizado que permite una evolución semiindependiente de los nuevos módulos, de tal manera que en algunos aspectos se parecen bastante a un producto nuevo. En particular, los nuevos módulos tienen su repositorio propio (que no es una copia del repositorio del producto original), y las entregas están desvinculadas de las del producto marco.

source: The http://opendata-ajuntament.barcelona.cat/[City Council's open data portal] is based on https://ckan.org/[CKAN] open data portal software. This product is http://docs.ckan.org/en/latest/extensions/plugin-interfaces.html[easily extendible] by means of plugins or extensions and when the new portal was being developed it was necessary to modify an existing plugin (which would also correspond to the <<use-case-adaptation, Adaptation Use-case>>) as well as create new ones.
ca: El http://opendata-ajuntament.barcelona.cat/[portal de dades obertes de l’Ajuntament] està basat en el programari de portal dades de codi obert https://ckan.org/[CKAN]. Aquest producte és http://docs.ckan.org/en/latest/extensions/plugin-interfaces.htm[fàcilment] extensible mitjançant plugins o extensions i durant el desenvolupament del nou portal va ser necessari tant modificar una extensió ja existent (això es correspondria amb l'<<use-case-adaptation, Escenari Adaptació>>) com crear-ne de noves.
es: El http://opendata-ajuntament.barcelona.cat/[portal de datos abiertos del Ayuntamiento] está basado en el software de portal de datos https://ckan.org/CKAN]. Este producto es http://docs.ckan.org/en/latest/extensions/plugin-interfaces.htm]fácilmente extensible] mediante plugins o extensiones, y durante el desarrollo del nuevo portal fue necesario tanto modificar una extensión ya existente (lo que se correspondería con el <<use-case-adaptation, escenario Adaptación>>) como crear otras nuevas.

source: `NewProduct` Use-case
ca: Escenari `NouProducte`
es: Escenario `NuevoProducto`

source: When there is no component or combination of components available that satisfy a specific need, a new product has to be developed. This product may be based on other, already existing components, such as frameworks, libraries, database management systems, etc.
ca: Quan no es troba cap component o combinació de components que satisfan una determinada necessitat, s’ha d’encarregar la implementació d’un producte nou. Aquest producte pot basar-se en altres components preexistents, com frameworks, biblioteques, gestors de bases de dades, etc.
es: Cuando no se encuentra ningún componente o combinación de componentes que satisfaga una determinada necesidad, debe encargarse la implementación de un producto nuevo. Este producto puede basarse en otros componentes preexistentes, como frameworks, bibliotecas, gestores de bases de datos, etcétera.

source: https://decidim.org/[Decidim] is a participative democracy tool for cities and organisations. From the outset, its development was sponsored by Barcelona City Council, although other organisations that use it are now beginning to contribute resources. It is based on the website development framework http://rubyonrails.org/[Ruby on Rails]. This framework greatly facilitates the development of new website applications but these do not merely consist of integrating and configuring components.
ca: El https://decidim.org/[Decidim] és una eina de democràcia participativa per ciutats i organitzacions. El desenvolupament va estar patrocinat des de l’inici per l’Ajuntament de Barcelona, tot i que ara més organitzacions que l’utilitzen comencen a aportar-hi recursos. Es basa en el framework per desenvolupament web http://rubyonrails.org/[Ruby on Rails]. Aquest framework facilita molt el desenvolupament de noves aplicacions web, però aquestes no consisteixen simplement en una integració i configuració de components.
es: https://decidim.org/[Decidim] es una herramienta de democracia participativa para ciudades y organizaciones. Su desarrollo estuvo patrocinado desde el principio por el Ayuntamiento de Barcelona, aunque ahora otras organizaciones que lo utilizan empiezan a aportar recursos. Se basa en el framework para desarrollo web http://rubyonrails.org/[Ruby on Rails]. Este framework facilita en gran medida el desarrollo de nuevas aplicaciones web, pero estas no consisten simplemente en una integración y configuración de componentes.

source: https://decidim.org/[Decidim]’s history is a little odd because it began with an attempt to adapt existing software, https://github.com/consul/consul[Consul]. Later it was necessary to make a fork from the original software and, finally, it was decided to rewrite the program (improving the modularity of the code, among other things).
ca: La història del https://decidim.org/[Decidim] és una mica rocambolesca perquè inicialment es va intentar fer una adaptació d’un programari ja existent, el https://github.com/consul/consul[Consul]. Més tard va ser necessari fer un fork del programari original, i finalment es va optar per reescriure de nou l’aplicació (millorant, entre d’altres, la modularitat del codi).
es: La historia de https://decidim.org/[Decidim] es un poco rocambolesca porque inicialmente se intentó hacer una adaptación de un software ya existente, el https://github.com/consul/consul[Consul]. Más tarde, fue necesario hacer un fork del software original y, finalmente, se optó por reescribir de nuevo la aplicación (mejorando, entre otros aspectos, la modularidad del código).

source: `Publication` Use-case
ca: Escenari `Publicació`
es: Escenario `Publicación`

source: Barcelona City Council owns a lot of software that is currently in use but which has never been published. The specific measures and recommendations for this use-case explain the additional checks that are necessary for publishing, under licence, a software code that initially was not conceived for free distribution.
ca: L’Ajuntament de Barcelona és el propietari legal de molt codi que es troba en ús actualment, però que mai ha estat publicat. Les mesures i recomanacions específiques d’aquest escenari expliquen les comprovacions addicionals necessàries per publicar, sota una llicència lliure, un codi que no va ser inicialment pensat per distribuir lliurement.
es: El Ayuntamiento de Barcelona es el propietario legal de gran parte del código que se encuentra en uso actualmente, pero que nunca ha sido publicado. Las medidas y recomendaciones específicas de este escenario explican las comprobaciones adicionales necesarias para publicar, bajo una licencia libre, un código que no fue inicialmente pensado para distribuirse libremente.

source: There may be several reasons that might justify publishing a software program, provided it meets certain quality requirements. One possible situation is you might want to launch a new development contract for extending or adapting “ manner” an existing component (that would be the equivalent of combining the <<use-case-adaptation, Adaptation Use-case>> and the <<use-case-publication, Publication Use-case>>).
ca: Por haver-hi diferents raons que justifiquin la publicació d’un codi, sempre que compleixi amb certs requisits de qualitat. Una possible situació és que es vulgui iniciar un nou contracte de desenvolupament per estendre o adaptar «en obert» un component ja existent (això equivaldria a una combinació del l'<<use-case-adaptation, Escenari Adaptació>> i l'<<use-cas-publication, Escenari Publicació>>).
es: Puede haber diferentes razones que justifiquen la publicación de un código, siempre que cumpla con ciertos requisitos de calidad. Una posible situación es que se quiera iniciar un nuevo contrato de desarrollo para extender o adaptar un componente ya existente (lo que equivaldría a una combinación del <<use-case-adaptation, escenario Adaptación>> y el <<use-case-publication, escenario Publicación>>).

source: `Document` Use-case
ca: Escenari `Document`
es: Escenario Documento

source: Sometimes you may want to publish a document that has been drafted (or commissioned) that might not be linked directly to a single software project. Examples would be market studies, research projects, graphic design elements (such as logos) and so on.
ca: A vegades es vol fer públic un document que s’ha redactat (o que s’ha encarregat) i que pot no estar directament vinculat amb un sol projecte de programari. Es pot tractar d’estudis de mercat, treballs de recerca, elements de disseny gràfic (com per exemple logotips), etc.
es: A veces se quiere hacer público un documento que se ha redactado (o que se ha encargado) y que puede no estar directamente vinculado con un único proyecto de software. Se puede tratar de estudios de mercado, trabajos de investigación, elementos de diseño gráfico (por ejemplo, logotipos), etcétera.

source: Tags for project stages and milestones
ca: Etiquetes per a fases i moments dels projectes
es: Etiquetas para fases y momentos de los proyectos

source: When classifying measures and recommendations, it is also worth taking into account at what point they should be applied. As a general rule, we could say that technological projects go through the following stages:
ca: A l’hora de categoritzar les mesures i recomanacions també és interessant tenir en compte en quin moment s’han d’aplicar. Com a regla general, podem considerar que els projectes tecnològics passen per les següents fases:
es: A la hora de categorizar las medidas y recomendaciones también es interesante tener en cuenta en qué momento deben aplicarse. Como regla general, se puede considerar que los proyectos tecnológicos pasan por las siguientes fases:

source: *Conception*: stage when a new need is detected and the idea of the project arises, which usually includes drawing up a preliminary design and possibly carrying out other preliminary studies.
ca: *Concepció:* fase en la que es descobreix una nova necessitat o sorgeix la idea del projecte, i que normalment inclou l’elaboració d’un avantprojecte i possiblement d’altres estudis previs.
es: *Concepción*: fase en la que se descubre una nueva necesidad o surge la idea del proyecto, y que normalmente incluye la elaboración de un anteproyecto y posiblemente de otros estudios previos.

source: *Procurement*: drawing up the specifications for acquiring services (development or other types of services).
ca: *Contractació*: redacció dels plecs per a l’adquisició de serveis (de desenvolupament o d’una altra naturalesa).
es: *Contratación*: redacción de los pliegos para la adquisición de servicios (de desarrollo o de otra naturaleza).

source: *Development*: creating the source code, documents and other tools, including the infrastructure necessary for building them.
ca: *Desenvolupament*: creació del codi, documentació i d’altres artefactes, incloent l’establiment de la infraestructura necessària per a la construcció dels mateixos.
es: *Desarrollo*: creación del código, documentación y otros artefactos, incluyendo el establecimiento de la infraestructura necesaria para su construcción.

source: *Putting into production*: deploying the service, including the possible migration of data and processes from one or more previous systems.
ca: *Pas a producció*: desplegament del servei, incloent la possible migració de dades i processos des d’un o més sistemes previs.
es: *Paso a producción*: despliegue del servicio, incluyendo la posible migración de datos y procesos desde uno o más sistemas previos.

source: *Exploitation*: stage which lasts throughout the useful life of the system in production, including operational and maintenance tasks.
ca: *Explotació*: fase que s’estén durant tota la vida útil del sistema en producció, incloent les tasques d’operació i manteniment.
es: *Explotación*: fase que se extiende durante toda la vida útil del sistema en producción, incluyendo las labores de operación y mantenimiento.

source: Taking all this into account, the Guide uses the following tags to highlight key project stages:
ca: Tenint en compte tot això, a la Guia es fan servir les següents etiquetes per assenyalar moments destacats dels projectes:
es: Teniendo todo esto en cuenta, en la guía se utilizan las siguientes etiquetas para señalar momentos destacados de los proyectos:

source: | Tag | Description | `Preliminary design` | Measures to take into account when drawing up preliminary designs. | `Procurement` | Measures to take into account when drawing up the service procurement specifications. | `Day1` | Measures to be applied from the first day of the development stage (see the section ). | `Release` | Measures to take into account when a new version of the product is released.
ca: | Etiqueta | Descripció | `Avantprojecte` | Mesures a tenir en compte en la redacció del avantprojectes. | `Contractar` | Mesures a tenir en compte en la redacció dels plecs per a la contractació de serveis. | `Dia1` | Mesures a aplicar des del primer dia d’inici de la fase de desenvolupament (veure l’apartat Treballar en obert des del «dia 1»). | `Release` | Mesures a tenir en compte en el moment que es fa pública una nova versió del producte.
es: | Etiqueta | Descripción | `Anteproyecto` | Medidas que tener en cuenta en la redacción del anteproyecto. | `Contratar` | Medidas que tener en cuenta en la redacción de los pliegos para la contratación de servicios. | `Día1` | Medidas que aplicar desde el primer día de inicio de la fase de desarrollo (ver el apartado “Trabajar en abierto desde el día 1”). ). | `Release` | Medidas que tener en cuenta en el momento en que se hace pública una nueva versión del producto.
