Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/documentation.po
Languages: ca, es

source: Documentation
ca: Documentació
es: Documentación

source: Upload a ``README`` file to the main repository
ca: Pujar un fitxer ``README`` al repositori principal
es: Subir un fichero README al repositorio principal

source: Day1
ca: Dia1
es: Día1

source: NewProduct
ca: NouProducte
es: NuevoProducto

source: Publication
ca: Publicació
es: Publicación

source: This must include the declaration of intent and the other information mentioned throughout this Guide that has to be included in the `README` file.
ca: Ha d’incloure la declaració de propòsit i la resta d’informacions que al llarg d’aquest document es menciona que s’han d’incloure en el `README`.
es: Debe incluir la declaración de propósito y el resto de informaciones que a lo largo de este documento se menciona que se tienen que incluir en el `README`.

source: It must be written in English and the format has to be text with light markup language. It cannot have an extension if it is written in plain text, or it can have an extension that indicates in what format the markup has to be interpreted (i.e. in reality the file will be called `README.md` if it is written in Markdown).
ca: S’ha de redactar en anglès i el format ha de ser text amb algun llenguatge de marques lleuger. Pot no tenir extensió si conté només text pla o una extensió que indiqui amb quin format de marques s’ha d’interpretar (és a dir, en realitat es el fitxer tindrà nom `README.md` si està escrit en Markdown).
es: Se tiene que redactar en inglés y el formato tiene que ser texto con algún lenguaje de marcas ligero. Puede no tener extensión si contiene solo texto plano o una extensión que indique con qué formato de marcas se tiene que interpretar (es decir, en realidad el fichero tendrá nombre `README`.md si está escrito en Markdown).

source: The content of this file (more specifically the version posted in the `master` branch), formatted according to the conventions of the markup language used, is what [.line-through]#GitHub# Gitlab and similar software shows as the development website's home page. So it is important to check the format is correct and that it appears correctly in a browser.
ca: El contingut d’aquest fitxer (concretament la versió que hi hagi penjada a la branca `master`), formatat segons les convencions del llenguatge de marques que s’hagi utilitzat, és el que [.line-through]#GitHub# mostra com a portada de la web de desenvolupament. Per tant, convé comprovar que el format és correcte i que es visualitza bé en un navegador web.
es: El contenido de este fichero (concretamente la versión que esté colgada en la rama `master`), formateado según las convenciones del lenguaje de marcas que se haya utilizado, es lo que [.line-through]#GitHub# muestra como portada de la web de desarrollo. Por lo tanto, conviene comprobar que el formato es correcto y que se visualiza bien en un navegador web.

source: Use wiki formats or free markup formats for all product documentation
ca: Utilitzar, per a tota la documentació del projecte, formats de wiki o formats de marques oberts
es: Utilizar, para toda la documentación del proyecto, formatos de wiki o formatos de marcas libres

source: Integration
ca: Integració
es: Integración

source: For the project user website it is acceptable to write directly in HTML. Other documentation, whether or not it is included in the repository code, will be in the corresponding wiki format or in one of the following formats:
ca: Per la web orientada a usuaris del projecte és acceptable escriure directament HTML. La resta de documentació, estigui o no inclosa en el repositori de codi, estarà en el format de wiki corresponent, o bé en un dels següents formats:
es: Para la web orientada a usuarios del proyecto, es aceptable escribir directamente HTML. El resto de documentación, esté o no incluida en el repositorio de código, estará en el formato de wiki correspondiente, o bien en uno de los siguientes formatos:

source: ReStructuredText (the Sphinx default format)
ca: ReStructuredText (és el que fa servir per defecte Sphinx)
es: ReStructuredText (es el que utiliza por defecto Sphinx)

source: Document the project so third parties can understand it, configure it and download it
ca: Documentar el projecte per tal que tercers siguin capaços d’entendre’l, configurar-lo i desplegar-lo
es: Documentar el proyecto para que terceros sean capaces de entenderlo, configurarlo y desplegarlo

source: Procurement
ca: Contractar
es: Contratar

source: Adaptation
ca: Adaptació
es: Adaptación

source: Organisations awarded contracts -- development and deployment -- have to understand they will not have a monopoly over the configuration, deployment and maintenance of the product.
ca: Les entitats adjudicatàries de contractes -- tant de desenvolupament com de desplegament -- han d’entendre que no tindran el monopoli de la configuració, el desplegament i el manteniment del producte.
es: Las entidades adjudicatarias de contratos —tanto de desarrollo como de despliegue— tienen que entender que no tendrán el monopolio de la configuración, el despliegue y el mantenimiento del producto.

source: Create and maintain a User Guide in the project's GitHub/Gitlab wiki
ca: Crear i mantenir un Manual d’ús a la wiki de GitHub del projecte
es: Crear y mantener un manual de uso en la wiki de GitHub del proyecto

source: From a very early stage there has to be accessible documentation via web that explains how to use the product on different levels or for different roles: average users, administrators, etc. In the case of code libraries, the users are code programmers who do not participate in the project.
ca: Des de ben aviat hi ha d’haver una documentació accessible via web que expliqui com utilitzar el producte a diferents nivells o per a diferents rols: usuaris corrents, administradors, etcètera. En el cas de llibreries de codi els usuaris son programadors que no participen en el projecte.
es: Desde muy pronto tiene que haber una documentación accesible desde la web que explique cómo utilizar el producto a diferentes niveles o para diferentes roles: usuarios corrientes, administradores, etcétera. En el caso de librerías de código, los usuarios son programadores que no participan en el proyecto.

source: A careful assessment needs to be made regarding which languages this documentation should be written in, depending on the sphere the product is expected to be used in. Catalan or Spanish could be the main language but at least the main administration tasks should also be explained in English. If interest is shown from other countries, it would be worth translating all the user material into English as well. All code library and development tool documentation must be in English from the start.
ca: S’ha de valorar bé en quins idiomes ha d’estar aquesta documentació, depenent de quin sigui l’àmbit esperat d’ús del producte. Es pot tenir el català o el castellà com a llengua principal de la documentació, però com a mínim les tasques principals d’administració cal també explicar-les en anglès. Si arriben mostres d’interès des d’altres territoris, convindrà que tota la documentació d’usuari es trobi també traduïda a l’anglès. En el cas de llibreries de codi o eines de desenvolupament, tota la documentació ha d’estar des de l’inici en anglès.
es: Tiene que valorarse adecuadamente en qué idiomas tiene que estar esta documentación, dependiendo de cuál sea el ámbito esperado de uso del producto. Se puede tener el catalán o el castellano como idioma principal de la documentación, pero, como mínimo, las tareas principales de administración deben explicarse también en inglés. Si llegan muestras de interés desde otros territorios, convendrá que toda la documentación de usuario se encuentre también traducida al inglés. En el caso de librerías de código o herramientas de desarrollo, toda la documentación tiene que estar desde el principio en inglés.

source: The documentation will never be complete and will be constantly evolving. So it should be easily updatable by different people and we recommend initially using a wiki. Using the same GitHub wiki avoids us having to create more infrastructure and means the documentation is automatically linked from the repository webpage.
ca: La documentació mai serà complerta i estarà en constant evolució. Per això convé que sigui fàcilment actualitzable per diferents persones i recomanem inicialment usar una wiki. Fer servir la mateixa wiki de GitHub ens evita haver de preparar més infraestructura i fa que la documentació es trobi automàticament enllaçada des de la pàgina web del repositori.
es: La documentación nunca será completa y estará en constante evolución. Por eso conviene que sea fácilmente actualizable por diferentes personas y recomendamos inicialmente usar una wiki. Utilizar la misma wiki de GitHub nos evita tener que preparar más infraestructura y facilita que la documentación se encuentre automáticamente enlazada desde la página web del repositorio.

source: Until there is a lot of user documentation, it is advisable to keep it all together in one wiki page, with a table of contents at the beginning, and not subdivide it into pages, as this makes it easier to search for key words by using the browser search features. This page should be linked with other documents such as the installation instructions, any tutorials or the optional FAQ list.
ca: Fins que no hi hagi molta documentació d’usuari/-a, és recomanable mantenir-la tota junta en una mateixa pàgina de la wiki, amb una taula de continguts a l’inici, i no subdividir-la en pàgines, ja que així es facilita la cerca de paraules clau utilitzant les funcions de cerca del navegador. Des d’aquesta pàgina convé enllaçar la resta d’elements de documentació com les instruccions d’instal·lació, possibles tutorials, o la possible llista de FAQ.
es: Hasta que no haya mucha documentación de usuario/a, es recomendable mantenerla toda unida en una misma página de la wiki, con una tabla de contenidos al inicio, y no subdividirla en páginas, ya que así se facilita la búsqueda de palabras clave utilizando las funciones de búsqueda del navegador. Desde esta página conviene enlazar el resto de elementos de documentación, como las instrucciones de instalación, posibles tutoriales, o la posible lista de preguntas frecuentes (FAQ).

source: Include or link from the:
ca: Enllaçar des de:
es: Enlazar desde:

source: Project website.
ca: La web del projecte.
es: La web del proyecto.

source: The `README` file of the main repository.
ca: El fitxer `README` del repositori principal.
es: El fichero `README` del repositorio principal.

source: Create and maintain a User Guide in Sphinx [.line-through]#and publish it in the GitHub Pages#
ca: Crear i mantenir un Manual d’ús en Sphinx i publicar-lo a les GitHub Pages
es: Crear y mantener un manual de uso en Sphinx [.line-through]# y publicarlo en las GitHub Pages

source: This is an alternative for projects that grow a lot and might have started by putting documents in the wiki. Any documentation found in the wiki must be transferred to the new format and the wiki itself deleted, so as not to confuse users. If it is clear from the outset that the project will need a large amount of documentation, we can opt to go down this road from the beginning.
ca: Aquesta és una alternativa per a projectes que creixen molt i que possiblement hagin començat posant la documentació a la wiki. S’ha de traspassar tota la informació que hi hagi a la wiki al nou format, i eliminar la wiki per no confondre als usuaris. Si es té clar des del principi que el projecte requerirà una bona quantitat de documentació, es pot optar des de l’inici per aquesta via.
es: Esta es una alternativa para proyectos que crecen mucho y que posiblemente hayan empezado poniendo la documentación en la wiki. Se tiene que traspasar toda la información que haya en la wiki al nuevo formato, y eliminar la wiki para no confundir a los usuarios. Si se tiene claro desde el principio que el proyecto requerirá una buena cantidad de documentación, se puede optar desde el principio por esta vía.

source: All the documentation will go in a `doc` subdirectory in the repository’s root directory and either be written in ReStructuredText or Markdown, the two markup languages supported by Sphinx.
ca: Tota la documentació anirà a un subdirectori ` doc` dins de l’arrel del repositori i s’escriurà o bé en ReStructuredText o bé en Markdown, els dos llenguatges de marques que suporta Sphinx.
es: Toda la documentación irá a un subdirectorio doc dentro de la raíz del repositorio y se escribirá o bien en ReStructuredText o bien en Markdown, los dos lenguajes de marcas que soporta Sphinx.

source: In this case, given the projects are big and have to aim to attract broad audiences, the documentation will have to be in English, notwithstanding the fact they could be translated into other languages.
ca: En aquest cas, per tractar-se de projectes grans i que han d’aspirar a arribar a públics amplis, la documentació haurà d’estar necessàriament en anglès, sense perjudici de que es pugui traduir a d’altres llengües.
es: En este caso, por tratarse de proyectos grandes y que tienen que aspirar a llegar a públicos amplios, la documentación tendrá que estar necesariamente en inglés, sin perjuicio de que se pueda traducir a otros idiomas.

source: Having the code and documentation in a single repository, far from being a problem, facilitates both being synchronised and this being reflected in the commit log.
ca: Tenir el codi i la documentació en un mateix repositori, lluny de ser un problema, facilita que ambdós vagin sincronitzats i que això quedi reflectit a l’historial de commits.
es: Tener el código y la documentación en un mismo repositorio, lejos de ser un problema, facilita que ambos vayan sincronizados y que eso quede reflejado en el historial de commits.

source: Link from the:
ca: Enllaçar des de:
es: Enlazar desde:

source: You can find an example at: https://github.com/commercialhaskell/stack/tree/master/doc
ca: Un exemple el podem trobar a: https://github.com/commercialhaskell/stack/tree/master/doc
es: Un ejemplo lo podemos encontrar en: https://github.com/commercialhaskell/stack/tree/master/doc.

source: Recommendation: Create and maintain a FAQ list R_4B1
ca: Crear i mantenir un llistat de FAQ R_4B1
es: Recomendación: Crear y mantener un listado de FAQ R_4B1

source: tags: NewProduct Publication + links incoming: None + links outgoing: None + If this is done reactively but diligently, with real user questions, it can make it much easier for people to find the information they need and could prove to be a very profitable way of investing the project’s resources.
ca: tags: NouProducte Publicació + links incoming: None + links outgoing: None + Si es realitza de forma reactiva però diligent, amb preguntes reals dels usuaris, pot facilitar molt que la gent trobi ràpidament la informació que necessita i pot resultar una manera molt rentable d’invertir els recursos del projecte.
es: Tags: NuevoProducto Publicación + Links incoming: None + Links outgoing: None + Si se realiza de forma reactiva pero diligente, con preguntas reales de los usuarios, puede facilitar en gran medida que se encuentre rápidamente la información que se necesita y puede resultar una manera muy rentable de invertir los recursos del proyecto.

source: Create a tutorial explaining how to do some of the usual tasks, step by step
ca: Crear un tutorial explicant com fer pas a pas algunes tasques habituals
es: Crear un tutorial explicando cómo hacer paso a paso algunas tareas habituales

source: Upload a file with installation instructions to the main repository
ca: Pujar un fitxer amb instruccions d’instal·lació al repositori principal
es: Subir un fichero con instrucciones de instalación al repositorio principal

source: The installation procedure developed in the link:#implementar-procediments-build-installacio[Measure: (Day 1) Implement build and installation procedures with free, widely used tools] has to be explained in an `INSTALL` file in the root directory of the main repository.
ca: El procediment d’instal·lació desenvolupat a la link:#implementar-procediments-build-installacio[Mesura: (Dia 1) Implementar procediments de build i instal·lació amb eines lliures] i d’ús estès ha d’estar explicat en un fitxer `INSTALL` a l’arrel del repositori principal.
es: El procedimiento de instalación desarrollado en la link:#implementar-procediments-build-installacio[medida (Día 1) Implementar procedimientos de build e instalación con herramientas libres y de uso extendido] tiene que estar explicado en un fichero `INSTALL` en la raíz del repositorio principal.

source: It must be written in English and the format must be text with light markup language.
ca: S’ha de redactar en anglès i el format ha de ser text amb algun llenguatge de marques lleuger.
es: Se tiene que redactar en inglés y el formato tiene que ser texto con algún lenguaje de marcas ligero.

source: Some diagnostic measure or command should be included to let users know if the product has been properly installed (e.g. by performing a set of tests, and specifying the expected result).
ca: Convé incloure alguna mesura o comanda de diagnòstic que permeti a l’usuari saber si la instal·lació s’ha executat correctament (per exemple, executar un joc de proves, i especificar el resultat esperat).
es: Conviene incluir alguna medida o comando de diagnóstico que permita al usuario saber si la instalación se ha ejecutado correctamente (por ejemplo, ejecutar un juego de pruebas, y especificar el resultado esperado).

source: The installation file must at least be linked from:
ca: El fitxer d’instal·lació ha d’estar enllaçat com a mínim des de:
es: El fichero de instalación debe estar enlazado como mínimo desde:

source: Supplement the user documentation with screen captures, videos and demo sites
ca: Complementar la documentació d’usuari/-a amb captures de pantalla, vídeos o demos
es: Complementar la documentación de usuario/a con capturas de pantalla, vídeos o demos

source: For big projects that aim to attract the attention of lots of people, the big appeal is a demo site.
ca: Per projectes web grans que vulguin atraure l’atenció de moltes persones, el millor reclam és un demo site.
es: Para proyectos web grandes que quieran atraer la atención de muchas personas, el mejor reclamo es un demo site.

source: A video explaining the tool’s use and characteristics might also be very attractive.
ca: Un vídeo explicant l’ús i les característiques de l’eina també pot resultar molt atractiu.
es: Un vídeo explicando el uso y las características de la herramienta también puede resultar muy atractivo.

source: If the product has a graphic user interface, it is highly recommended that the explanations be accompanied by screen captures. They could also be used in the features list described in the #h:2dc43f4e-e755-4fe5-be4e-1f9dd58fe9e9[Measure: Specify a feature list in easily accessible locations].
ca: Si el producte té una interfície d’usuari gràfica, és molt recomanable acompanyar les explicacions amb captures de pantalla. També es poden utilitzar en el llistat de funcionalitats descrit a la #h:2dc43f4e-e755-4fe5-be4e-1f9dd58fe9e9[Mesura: Especificar en llocs fàcilment accessibles un llistat de funcionalitats].
es: Si el producto tiene una interfaz de usuario gráfica, es muy recomendable acompañar las explicaciones con capturas de pantalla. También se pueden utilizar en el listado de funcionalidades descrito en la #h:2dc43f4e-e755-4fe5-be4e-1f9dd58fe9e9[medida Especificar en sitios fácilmente accesibles un listado de funcionalidades].

source: Specify, in a prominent location, a distribution licence for the User Guide
ca: Especificar, en un lloc visible, una llicència de distribució per al Manual d’ús
es: Especificar, en un sitio visible, una licencia de distribución para el manual de uso

source: The default licence to use is https://creativecommons.org/share-your-work/public-domain/cc0[Creative Commons Zero v1.0 Universal] (CC0-1.0).
ca: Per defecte utilitzar la llicència https://creativecommons.org/share-your-work/public-domain/cc0[Creative Commons Zero v1.0 Universal] (CC0-1.0).
es: Por defecto, hay que utilizar la licencia https://creativecommons.org/share-your-work/public-domain/cc0[Creative Commons Zero v1.0 Universal] (CC0-1.0).

source: A summary of its characteristics can be found at: https://tldrlegal.com/license/creative-commons-cc0-1.0-universal.
ca: Un resum de les seves característiques es pot trobar a: https://tldrlegal.com/license/creative-commons-cc0-1.0-universal.
es: Un resumen de sus características se puede encontrar en: https://tldrlegal.com/license/creative-commons-cc0-1.0-universal .

source: There is no reason to use the same licence for the documentation as for the software itself. In fact, Public Domain licences are admissible in this case.
ca: En el cas de la documentació no té per què fer-se servir la mateixa llicència que per al programari en sí, i de fet en aquest cas sí que son admissibles les llicències de Domini Públic).
es: En el caso de la documentación, no tiene por qué utilizarse la misma licencia que para el software en sí, y, de hecho, en este caso sí que son admisibles las licencias de dominio público.

source: When creating documentation for external projects, use the licences those projects are already using.
ca: En cas de crear documentació per projectes externs, utilitzar les llicències que aquests projectes ja estiguin fent servir.
es: En caso de crear documentación para proyectos externos, hay que utilizar las licencias que estos proyectos ya estén utilizando.

source: Specify, in a prominent location, a distribution licence for the design documents and studies commissioned
ca: Especificar, en un lloc visible, una llicència de distribució per als documents de disseny i estudis encarregats
es: Especificar, en un sitio visible, una licencia de distribución para los documentos de diseño y estudios encargados

source: Document
es: Documento

source: The default licence to use is https://creativecommons.org/licenses/[Creative Commons Attribution Share Alike 4.0] (CC-BY-SA-4.0).
ca: Per defecte utilitzar la llicència https://creativecommons.org/licenses/[Creative Commons Attribution Share Alike 4.0] (CC-BY-SA-4.0).
es: Por defecto, hay que utilizar la licencia https://creativecommons.org/licenses/[Creative Commons Attribution Share Alike 4.0] (CC-BY-SA-4.0).

source: Follow: https://wiki.creativecommons.org/wiki/Website/Publish and https://creativecommons.org/choose/#metadata.
ca: Seguir: https://wiki.creativecommons.org/wiki/Website/Publish i https://creativecommons.org/choose/#metadata.
es: Seguir https://wiki.creativecommons.org/wiki/Website/Publish y https://creativecommons.org/choose/#metadata .

source: To understand its characteristics you can consult: https://tldrlegal.com/license/creative-commons-attribution-sharealike-4.0-international-(cc-by-sa-4.0).[https://tldrlegal.com/license/creative-commons-attribution-sharealike-4.0-international-(cc-by-sa-4.0)].
ca: Per entendre les seves característiques es pot consultar: https://tldrlegal.com/license/creative-commons-attribution-sharealike-4.0-international-(cc-by-sa-4.0).[https://tldrlegal.com/license/creative-commons-attribution-sharealike-4.0-international-(cc-by-sa-4.0)].
es: Para entender sus características se puede consultar: https://tldrlegal.com/license/creative-commons-attribution-sharealike-4.0-international-(cc-by-sa-4.0).[https://tldrlegal.com/license/creative-commons-attribution-sharealike-4.0-international-(cc-by-sa-4.0)].
