Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/document-organization.po
Languages: ca, es

source: Document organization
ca: Organització del document
es: Organización de esta guía

source: This Guide contains a series of guidelines that we have divided into:
ca: Aquesta guia consta d’un seguit de directrius que hem dividit en:
es: Esta guía consta de una serie de directrices divididas en dos categorías:

source: *Measures* that must be adopted and implemented in all projects.
ca: *Mesures* que han de ser adoptades i implementades en tots els projectes.
es: *Medidas* que hay que implementar y cumplir en todos los proyectos.

source: *Recommendations* that do not have to be followed but which could be useful in certain situations.
ca: *Recomanacions* que no és obligatori aplicar, però que poden ser d’utilitat en determinades situacions.
es: *Recomendaciones* que no son de aplicación obligatoria, pero que pueden ser de utilidad en determinadas situaciones.

source: Project managers are responsible for checking whether the measures are being implemented properly and deciding which recommendations to follow.
ca: És responsabilitat dels i les cap de projecte validar si les mesures s’estan implementant correctament, i decidir quines recomanacions cal aplicar.
es: Es responsabilidad de los jefes y jefas de proyecto validar si las medidas se están implementando correctamente, y decidir qué recomendaciones deben aplicarse.

source: Some measures are sufficiently complex to merit being broken down into *sub-measures* that can be individually validated.
ca: Algunes mesures son prou complexes com per merèixer ser fraccionades en *sub-mesures* que puguin ser validades individualment.
es: Algunas medidas son bastante complejas, por eso se fraccionan en *submedidas* que pueden ser validadas individualmente.

source: Some are impossible to adopt in certain projects, so in those cases we have tried to offer some *alternatives* (guidelines that will be tagged as such throughout the guide). Each measure and its sub-measures are interlinked.
ca: Algunes mesures son impossibles d’aplicar en determinats projectes, i en aquest cas s’intenta donar algunes *alternatives* (directrius que es troben etiquetades d’aquesta manera al llarg del document). Cada mesura i les seves potencials alternatives es troben mútuament enllaçades.
es: Algunas medidas son imposibles de aplicar en determinados proyectos; en este caso, se intenta ofrecer algunas *alternativas* (directrices que se encuentran etiquetadas de esta forma a lo largo del documento). Cada medida y sus potenciales alternativas se encuentran mutuamente enlazadas.

source: Each measure, recommendation or alternative consists of:
ca: Cada mesura, recomanació o alternativa consta de:
es: Cada medida, recomendación o alternativa consta de los siguientes elementos:

source: A unique identifier throughout the document.
ca: Un identificador únic per a tot el document.
es: Un identificador único para todo el documento.

source: A list of tags.
ca: Un llistat d’etiquetes.
es: Un listado de etiquetas.

source: The *tags* help to restrict when and in what types of projects each measure and recommendation are important. For example, they can serve to generate a checklist of things that project management needs to check.
ca: Les *etiquetes* ajuden a restringir en quins moments i en quins tipus de projecte son importants cada mesura i cada recomanació. Poden servir, per exemple, per generar un checklist de coses que la direcció del projecte necessita comprovar.
es: Las *etiquetas* ayudan a restringir en qué momentos y en qué tipo de proyectos es importante cada medida y cada recomendación. Pueden servir, por ejemplo, para generar una checklist de cuestiones que la dirección del proyecto necesite comprobar.

source: This chapter explains which type of tags are used throughout the guide. The other chapters set out the measures and recommendations by subject areas and provide some necessary context for understanding the relevance of each measure.
ca: Els apartats d’aquest capítol expliquen els tipus d’etiquetes que es fan servir al llarg de la Guia. La resta de capítols d’aquesta guia ordenen les mesures i recomanacions en àrees temàtiques i donen el context necessari per entendre la rellevància de cada mesura.
es: Los apartados de este capítulo explican los tipos de etiquetas que se utilizan a lo largo de la guía. El resto de capítulos de la guía ordenan las medidas y recomendaciones en áreas temáticas y aportan el contexto necesario para entender la relevancia de cada medida.

source: In the [Annex: Lists of measure and recommendations by tag] you will find various lists of measures and recommendations classified by tags.
ca: A l”[Annex: Llistats de mesures i recomanacions per etiquetes] es poden trobar diferents llistats de mesures i recomanacions categoritzats per etiquetes.
es: En el [anexo “Listados de medidas y recomendaciones por etiquetas”] se pueden encontrar diferentes listados de medidas y recomendaciones categorizados por etiquetas.

source: Use-case tags
ca: Etiquetes per escenaris d’ús
es: Etiquetas por escenarios de uso

source: In this section we define the different situations or *use-cases* that can arise in technological projects in relation to the free software components they are based on. These Use-Cases then determine which measures and recommendations affect each project.
ca: En aquest apartat es defineixen diferents situacions o *escenaris* que es poden produir en els projectes tecnològics en relació als components de programari lliure i de codi obert en els que es basen. Aquests escenaris determinen després quines mesures i recomanacions afecten a cada projecte.
es: En este apartado se definen diferentes situaciones o *escenarios* que se pueden producir en los proyectos tecnológicos en relación con los componentes de software libre en los que se basan. Estos escenarios determinan posteriormente qué medidas y recomendaciones afectan a cada proyecto.

source: Each *project* defines an information system, and each system has a certain number of software *components*. Some components are distinguished from the rest because each component has its own source code *repository*. (Occasionally we find complex components whose code, for practical reasons, is shared between different repositories which are tagged and distributed jointly). The different components in a particular system can be run on the same equipment or be distributed between different machines. Likewise, they may operate as part of the same process or various processes.
ca: Cada *projecte* defineix un sistema d’informació, i cada sistema d’informació consta d’una determinada quantitat de *components* de programari. Uns components es distingeixen dels altres perquè cada component té el seu propi *repositori* de codi font. (Ocasionalment trobem components complexes que, per raons pràctiques, tenen el seu codi repartit en diferents repositoris que es versionen i distribueixen coordinadament). Els diferents components d’un determinat sistema poden executar-se tots en una mateixa màquina, o bé poden trobar-se distribuïts en diferents màquines. També poden executar-se com a part del mateix procés o en processos diversos.
es: Cada *proyecto* define un sistema de información, y cada sistema de información consta de una determinada cantidad de *componentes* de software. Unos componentes se distinguen de los otros porque cada componente tiene su propio *repositorio* de código fuente (ocasionalmente encontramos componentes complejos que, por razones prácticas, tienen su código repartido en diferentes repositorios que se versionan y distribuyen coordinadamente). Los diferentes componentes de un determinado sistema pueden ejecutarse todos en una misma máquina, o bien pueden encontrarse distribuidos en diferentes máquinas. También pueden ejecutarse como parte del mismo proceso o en procesos distintos.

source: The following use-cases are contemplated:
ca: Els escenaris contemplats son els següents:
es: Los escenarios contemplados son los siguientes:

source: | Tag | Description | `Integration` | *Integrate existing components*: it is necessary to install a new system that can be built on the basis of existing components. | `Adaptation` | *Modify an external component*: feature needs to be added to a component that is already available, or it needs to be improved by solving defects, adding translations, etc. | `Plugin` | *Expand a platform with plugins*: new components need to be created that can be integrated into a platform or framework already available and which facilitates this task. | `NewProduct` | *Create a new component*: a new solution needs to be created from scratch. | `Publication` | *Publish code from an existing own component*: we have our own code, developed under previous contracts and never publicly distributed, and we want to make it available in a public repository, under a free software license. | `Document` | *Publish documents not linked to a single project*: we have documentation that is not directly linked to a piece of software but we want to make it freely available in a public repository.
ca: | Tag | Descripció | `Integració` | *Integrar components existents*: és necessari instalar un nou sistema que es pot construir en base a components ja existents. | `Adaptació` | *Modificar un component extern*: cal afegir funcionalitat a un component ja disponible, o bé millorar-lo solucionant deficiències, afegint traduccions, etc. | `Plugin` | *Estendre una plataforma amb components endollables*: es requereix crear nous components que s’integrin en una plataforma o framework ja disponible i que facilita aquesta tasca. | `NouProducte` | *Crear un component nou*: es necessita crear una solució nova des de zero. | `Publicació` | *Publicar codi d’un component propi ja existent*: es disposa d’un codi propi desenvolupat sota contractes anteriors i que mai ha estat publicat, i es vol alliberar en un repositori públic. | `Document` | *Publicar documentació no vinculada a un únic projecte*: es disposa d’una documentació no directament vinculada a codi però que es vol alliberar en un repositori públic.
es: | Etiqueta | Descripción | `Integración` | *Integrar componentes existentes*: se necesita implantar un nuevo sistema que se puede construir sobre la base de componentes ya existentes. | `Adaptación` | *Modificar un componente externo*: hay que añadir funcionalidad a un componente ya disponible, o bien mejorarlo solucionando deficiencias, añadiendo traducciones, etcétera. | `Plugin` | *Extender una plataforma con componentes enchufables*: se requiere crear nuevos componentes que se integren en una plataforma o framework ya disponible y que facilita esta tarea. | `NuevoProducto` | *Crear un componente nuevo*: se necesita crear una solución nueva desde cero. | `Publicación` | *Publicar código de un componente propio ya existente*: se dispone de un código propio desarrollado bajo contratos anteriores y que nunca ha sido publicado, y se quiere liberar en un repositorio público. | `Documento` | *Publicar documentación no vinculada a un único proyecto*: se dispone de una documentación no directamente vinculada a código pero que se quiere liberar en un repositorio público.

source: All the Use-Cases, except the `Integration` and `Document` Use-Cases, refer to a single software component. This means different Use-Cases can coincide in the same project if different components are affected in a different way.
ca: Tots els escenaris, a excepció dels escenaris `Integració` i `Document`, fan referència a un únic component de programari. Per tant, en un mateix projecte poden concórrer diferents escenaris si components diferents es troben afectats de diferent manera.
es: Todos los escenarios, a excepción de los escenarios `Integración` y `Documento`, hacen referencia a un único componente de software. Por lo tanto, en un mismo proyecto pueden concurrir distintos escenarios si componentes diferentes se encuentran afectados de diferente forma.

source: We exclude from the analysis contributions to projects that do not involve modifying the code of a component, or creating a repository, such as contributions to documenting or facilitating the adoption of certain tools by third parties.
ca: Deixem fora de l’anàlisi contribucions a projectes que no impliquen una modificació del codi d’un component, o la creació d’un repositori, com poden ser contribucions a la documentació o facilitació de l’adopció de certes eines per part de tercers.
es: Dejamos fuera del análisis contribuciones a proyectos que no implican una modificación del código de un componente, o la creación de un repositorio, como pueden ser contribuciones a la documentación o facilitación de la adopción de ciertas herramientas por parte de terceros.

source: The `Integration`, `Adaptation`, `Plugin` and `NewProduct` use-cases may occasionally require a *migration*, if we find ourselves in a situation of implementing a system that partially or totally replaces the functions of a previous system.
ca: Els escenaris `Integració`, `Adaptació`, `Plugin` i ' NouProducte` poden opcionalment requerir una *migració*, en cas que ens trobem en la situació d’implantar un sistema que substitueix, en part o totalment, les funcions d’un sistema anterior.
es: Los escenarios `Integración`, `Adaptación`, `Plugin` y `NuevoProducto` pueden requerir opcionalmente una migración, en caso de que nos encontremos en la situación de implantar un sistema que sustituye, en parte o totalmente, las funciones de un sistema anterior.

source: `Integration` Use-Case
ca: Escenari `Integració`
es: Escenario `Integración`

source: This Use-Case may involve creating one or more own repositories, not to manage the code of any software _per se_ but to:
ca: Aquest escenari pot comportar la creació d’un o més repositoris propis, però no per guardar-hi el codi de cap aplicació _pròpiament_, sinó per:
es: Este escenario puede comportar la creación de uno o más repositorios propios, pero no para guardar el código de ninguna aplicación propiamente, sino para lo siguiente:

source: Link it to project management tools such as issue managers.
ca: Vincular-hi eines de gestió de projectes tals com gestors d’incidències
es: Vincular herramientas de gestión de proyectos tales como gestores de incidencias

source: Save and link documents relating to using and operating the system
ca: Guardar o enllaçar documentació associada amb l’ús i operació del sistema
es: Guardar o enlazar documentación asociada con el uso y operación del sistema

source: Save configuration files and scripts necessary for deploying the system
ca: Guardar fitxers de configuració i scripts necessaris per al desplegament del sistema
es: Guardar ficheros de configuración y scripts necesarios para el despliegue del sistema

source: Save configuration files and scripts necessary for running testing and continuous integration environments, including _virtualisation_ and _containerisation_
ca: Guardar fitxers de configuració i scripts necessaris per executar entorns de prova i d’integració continua, incloent _virtualització_ i _containerització_
es: Guardar ficheros de configuración y scripts necesarios para ejecutar entornos de prueba y de integración continua, incluyendo _virtualización_ y _contenerización_

source: Save system design and customisation features
ca: Guardar elements de disseny i personalització del sistema
es: Guardar elementos de diseño y personalización del sistema

source: Save instructions for installing and using the system
ca: Guardar instruccions d’instal·lació i ús del sistema
es: Guardar instrucciones de instalación y uso del sistema

source: Save integration tests of the various components
ca: Guardar tests d’integració dels diferents components
es: Guardar test de integración de los diferentes componentes

source: With regard to customisation elements, we highlight the need for *translating* user interface texts and other aspects of localisation and internationalisation (l10n, i18n). We contemplate two possibilities:
ca: En quant als elements de personalització, destaquem la *traducció* dels literals que es mostren a l’usuari i d’altres aspectes de la localització i internacionalització (l10n, i18n). Contemplem dues possibilitats:
es: En cuanto a los elementos de personalización, destaca la *traducción* de los literales que se muestran al usuario y otros aspectos de la localización e internacionalización (l10n, i18n). Se contemplan dos posibilidades:

source: The following conditions are met: (1) the software to be translated is designed to incorporate translations of the interface, and (2) the translations to be carried out may be of general interest to other potential users of the tool. In this case, we will try to fit the translations into the original project, which means we would find ourselves in the <<use-case-adaptation, Adaptation Use-Case>>.
ca: Es compleixen les següents dues condicions: (1) el programari a traduir està dissenyat per incorporar traduccions de la interfície, i (2) les traduccions a realitzar poden ser d’utilitat general per a d’altres potencials usuaris de l’eina. En aquest cas s’intentarà contribuir aquestes traduccions al projecte original i per tant ens trobaríem en l'<<use-case-adaptation, Escenari Adaptació>>.
es: Se cumplen dos condiciones: (1) el software que traducir está diseñado para incorporar traducciones de la interfaz, y (2) las traducciones que realizar pueden ser de utilidad general para otros potenciales usuarios de la herramienta. En este caso, se intentará incluir estas traducciones en el proyecto original y, por lo tanto, nos encontraríamos en el <<use-case-adaptation, escenario Adaptación>>.

source: One of the two conditions mentioned above is not met: we store the files needed for doing the translation in an own repository.
ca: Alguna de les dues condicions anteriors no es compleix i emmagatzemem els fitxers necessaris per efectuar la traducció a un repositori propi.
es: Alguna de las dos condiciones anteriores no se cumple y almacenamos los ficheros necesarios para efectuar la traducción en un repositorio propio.

source: Wordpress
es: Ejemplo:

source: A hypothetical example would be a web portal built using a content management system such as Wordpress, with a MariaDB database.
ca: Un exemple hipotètic seria un portal web construït utilitzant un gestor de continguts com Wordpress, amb una base de dades MariaDB.
es: Un ejemplo hipotético sería un portal web construido utilizando un gestor de contenidos como Wordpress, con una base de datos MariaDB.

source: These are standard free software components but to make managing them easier, it might be useful to save customised elements such as CSS files or a list of Wordpress extensions to be uploaded in a repository, along with Docker images that include all the necessary elements for its deployment.
ca: Es tracta de components estàndard de programari lliure, però per facilitar-ne la gestió pot convenir guardar en un repositori elements de personalització com plantilles, fitxers CSS, imatges, llistat d’extensions de Wordpress a carregar, així com imatges de Docker que incloguin tots els elements necessaris per al desplegament.
es: Se trata de componentes estándar de software libre, pero para facilitar su gestión puede convenir guardar en un repositorio elementos de personalización como plantillas, ficheros CSS, imágenes, listado de extensiones de Wordpress que cargar, así como imágenes de Docker que incluyan todos los elementos necesarios para el despliegue.

source: `Adaptation` Use-Case
ca: Escenari `Adaptació`
es: Escenario `Adaptación`

source: This use-case might involve creating one or more own repositories with the same contents described for the <<use-case-integration, Integration Use-Case>>. A distinctive feature of this use-case, however, is that Barcelona City Council is sponsoring the development of a significant contribution to a free software product that could potentially be incorporated into the original product (even if this integration does not take place while it is being developed). These contributions must take the form of a series of commits in a repository linked in some way to that of the original product.
ca: Aquest escenari pot comportar la creació d’un o més repositoris propis amb els mateixos continguts descrits per a l'<<use-case-integration, Escenari Integració>>. En canvi, el tret distintiu d’aquest escenari és el patrocini per part de l’Ajuntament de Barcelona del desenvolupament d’alguna contribució significativa a un producte de programari lliure que pugui ser potencialment incorporada al producte original (encara que aquesta integració no es realitzi mentre dura el propi desenvolupament). Aquestes contribucions han de materialitzar-se en un conjunt de _commits_ en un repositori que estigui vinculat d’alguna manera al repositori del producte original.
es: Este escenario puede comportar la creación de uno o más repositorios propios con los mismos contenidos descritos para el <<use-case-integration, escenario Integración>>. En cambio, el rasgo distintivo de este escenario es el patrocinio por parte del Ayuntamiento de Barcelona del desarrollo de alguna contribución significativa a un producto de software libre que pueda ser potencialmente incorporada al producto original (aunque esta integración no se realice mientras dura el propio desarrollo). Estas contribuciones deben materializarse en un conjunto de commits en un repositorio que esté vinculado de alguna manera al repositorio del producto original.

source: There may be various types of contributions:
ca: Les contribucions poden ser de diversa naturalesa:
es: Las contribuciones pueden ser de diversa naturaleza:

source: New features that Barcelona City Council needs and which could be of interest to other entities or users
ca: Noves funcionalitats que l’Ajuntament de Barcelona necessita i que poden ser d’interès per a més entitats o usuaris
es: Nuevas funcionalidades que el Ayuntamiento de Barcelona necesita y que pueden ser de interés para más entidades o usuarios.

source: Complete translations (or significant coverage) of the user interface, as well as other localisation (l10n) and internationalisation (i18n) improvements that might be of general use to other potential users of the tool.
ca: Traduccions complertes (o amb una cobertura significativa) de la interfície d’usuari, així com altres millores de localització (l10n) i internacionalització (i18n) que poden ser d’utilitat general per a d’altres potencials usuaris de l’eina.
es: Traducciones completas (o con una cobertura significativa) de la interfaz de usuario, así como otras mejoras de localización (l10n) e internacionalización (i18n) que pueden ser de utilidad general para otros usuarios potenciales de la herramienta.

source: If the translations and localisation elements are mixed with the City Council's own customised elements, or if the original product is not designed to incorporate new translations and localisations, then it is not possible to plan a contribution like this because we would be in the <<use-case-integration, Integration Use-case>>.
ca: Si les traduccions o elements de localització es troben barrejats amb elements de personalització propis de l’Ajuntament, o bé el producte original no està dissenyat per incorporar noves traduccions i localitzacions, aleshores no es pot plantejar una contribució com a tal i ens trobaríem a l'<<use-case-integration, Escenari Integració>>.
es: Si las traducciones o elementos de localización se encuentran mezclados con elementos de personalización propios del Ayuntamiento, o bien el producto original no está diseñado para incorporar nuevas traducciones y localizaciones, entonces no se puede plantear una contribución como tal y nos encontraríamos en el <<use-case-integration, escenario Integración>>.
