Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/introduction.po
Languages: ca, es

source: Introduction
ca: Introducció
es: Introducción

source: Barcelona City Council has a policy for using and developing free software which is set out in the http://ajuntament.barcelona.cat/digital/ca/documentacio[Government Measure: Free software and agile development of public administration services], approved in October 2017.
ca: L’Ajuntament de Barcelona disposa d’una política d’ús i desenvolupament de programari lliure i de codi obert establerta en la http://ajuntament.barcelona.cat/digital/ca/documentacio[Mesura de govern per a la digitalització oberta: Programari lliure i desenvolupament àgil de serveis a l’administració pública], l’octubre de 2017.
es: El Ayuntamiento de Barcelona dispone de una política de uso y desarrollo de software libre establecida en la http://ajuntament.barcelona.cat/digital/ca/documentacio[Medida de gobierno para la digitalización abierta: software libre y desarrollo ágil de servicios en la Administración pública], de octubre del 2017.

source: This policy includes a series of principles and guidelines that are outlined in the following documents, annexed to the measure:
ca: Aquesta política consta d’un seguit de principis i directrius que s’exposen als documents següents, annexos a la mesura:
es: Esta política consta de una serie de principios y directrices que se exponen en los siguientes documentos, anexos a la medida:

source: xref:{lang}/tech-practices:ROOT:aim-and-scope.adoc[Technology Code of Practice]
ca: xref:{lang}/tech-practices:ROOT:aim-and-scope.adoc[Codi de pràctiques tecnològiques]
es: xref:{lang}/tech-practices:ROOT:aim-and-scope.adoc[Código de prácticas tecnológicas]

source: xref:{lang}/tech-sovereignty:ROOT:introduction.adoc[Guide to Technological Sovereignty]
ca: xref:{lang}/tech-sovereignty:ROOT:introduction.adoc[Guia sobre sobirania tecnològica]
es: xref:{lang}/tech-sovereignty:ROOT:introduction.adoc[Guía sobre soberanía tecnológica]

source: xref:{lang}/ict-procurement:ROOT:context.adoc[Guide to Public ICT Procurement]
ca: xref:{lang}/ict-procurement:ROOT:context.adoc[Guia de compra pública de TIC]
es: xref:{lang}/ict-procurement:ROOT:context.adoc[Guía de compra pública de TIC]

source: This Guide spells out these principles and guidelines in a series of measures and recommendations to help staff of the Municipal Institute of Information Technology (IMI), the ICT body of the Barcelona City Council, in their daily work on projects based on free software. It covers aspects such as:
ca: El present document concreta aquests principis i directrius en un conjunt de mesures i recomanacions que han de guiar al personal de (l’IMI) en la gestió diària de projectes basats en programari lliure, en aspectes com:
es: El presente documento concreta estos principios y directrices en un conjunto de medidas y recomendaciones que deben guiar al personal del Instituto Municipal de Informática (IMI) en la gestión diaria de proyectos basados en software libre, en aspectos como los siguientes:

source: Looking for and designing solutions
ca: La cerca i disseny de solucions
es: La búsqueda y diseño de soluciones

source: Service procurement
ca: La contractació de serveis
es: La contratación de servicios

source: Developing, implementing and maintaining information systems
ca: El desenvolupament, implantació i manteniment de sistemes d’informació
es: El desarrollo, implantación y mantenimiento de sistemas de información

source: Participation in free software communities
ca: La participació en comunitats obertes
es: La participación en comunidades de software libre

source: Benefits of using and developing free IT solutions
ca: Beneficis d'utilitzar i desenvolupar solucions IT lliures
es: Beneficios al utilizar y desarrollar soluciones IT libres

source: The main benefit expected from using and developing free software is that the City Council regains or maintains control of their computing, not ceding it to private hands. It is crucial for an entity that implements public services and processes a lot of information about citizens to know exactly what it is being executed, in what computers, who has access to the data, etc. As the https://www.gnu.org[GNU project] puts it:
ca: El principal avantatge que s’espera en utilitzar i desenvolupar programari lliure és que l’Ajuntament recuperi o mantingui el control de la seva informàtica, sense cedir-la a mans privades. És crucial per a una entitat que implementi serveis públics i processi molta informació sobre els ciutadans poder conèixer amb exactitud què s'està executant, en quins ordinadors, qui té accés a les dades, etc. Com diu a https: //www.gnu. org [Projecte GNU]:
es: La principal ventaja que se espera al utilizar y desarrollar software libre es que el Ayuntamiento recupere o mantinga el control de su informática, sin cederla a manos privadas. Es crucial para una entidad que implemente servicios públicos y procese mucha información acerca los ciudadanos poder conocer con exactitud qué se está ejecutando, en que ordenadores, que tiene acceso a los datos, etc. Como dice en https://www.gnu.org [Proyecto GNU]:

source: Measures Governments Can Use to Promote Free Software
es: Medidas que los gobiernos pueden usar para promover el software libre

source: "The state needs to insist on free software in its own computing for the sake of its computational sovereignty (the state's control over its own computing). All users deserve control over their computing, but the state has a responsibility to the people to maintain control over the computing it does on their behalf. Most government activities now depend on computing, and its control over those activities depends on its control over that computing. Losing this control in an agency whose mission is critical undermines national security."
ca: "L’estat ha d’insistir en el programari lliure en la seva pròpia informàtica pel bé de la seva sobirania tecnològica (el control de l’estat sobre la seva pròpia computació). Tots els usuaris mereixen el control de la seva informàtica, però l’estat té la responsabilitat de mantenir el control sobre la computació que fa en nom de la ciutadania. La majoria de les activitats governamentals ara depenen de la informàtica, i el seu control sobre aquestes activitats depèn del seu control sobre aquesta computació. La pèrdua d’aquest control en una agència la missió de la qual és crítica soscava la seguretat nacional. "
es: El estado tiene que insistir en el software libre en su propia informàtica para el bién de su soberanía tecnológica (el control del estado sobre su propia computación). Todos los usuarios merecen el control de su informática, pero el estado tiene la responsabilidad de mantener el control sobre la computación que hace en nombre de la ciudadanía. La mayoria de sus actividades governamentales ahora dependen de la informática, y su control sobre estas actividades depende de su control sobre esta computación. La pérdida de este control en una agéncia la misión de la qual es crítica soscava la seguridad nacional.

source: Both the GNU document above and the https://ajuntament.barcelona.cat/digital/en/blog/barcelona-digital-government-open-agile-and-participatory[Release note of the Government Measure: Free software and agile development of public administration services] envision other benefits:
ca: Tant el document de GNU anterior com la https://ajuntament.barcelona.cat/digital/ca/blog/barcelona-digital-government-open-agile-and-participatives.cat[Mesura de govern: programari lliure i desenvolupament àgil de serveis d’administració pública] preveuen altres avantatges:
es: Tanto el documento de GNU anterior como la https://ajuntament.barcelona.cat/digital/es/blog/barcelona-digital-government-open-agile-and-participatives.cat[Medida de gobierno: software libre y desarrollo ágil de servicios de administración pública] previenen otras vantajas:

source: Encouraging local software support businesses, more easily including small and medium-sized businesses in the procurement process.
ca: Foment de negocis locals de suport i manteniment de programari, facilitant la inclusió de petites i mitjanes empreses en el procés de contractació.
es: Fomento de negocios locales de soporte y mantenimiento de software, facilitando la inclusión de pequeñas y medianas empresas en el proceso de contractación.

source: Creating crucial new capabilities in the public sector through internalisation of staff and a programme to create in-house skills to drive transformation.
ca: Creació de noves capacitats crucials en el sector públic a través de la internalització del personal i un programa per crear habilitats internes per impulsar la transformació.
es: Creación de nuevas capacidades cruciales en el sector público a través de la internalitzación del personal y un programa para crear habilitats internos para impulsar la transformación.

source: Increasing transparency and auditability of administrative processes.
ca: Increment de la transparència i auditabilitat dels processos administratius.
es: Incremento de la transparéncia y auditabilidad de los procesos administrativos

source: Never requiring individuals or organizations that need to interact with the City Council to use a nonfree program (that would be equivalent to a state-sanctioned monopoly).
ca: No obligar a cap persona o organització que necessiti interactuar amb l'Ajuntament a utilitzar un programa específic (això equivaldria a un monopoli sancionat per l'Estat).
es: No obligar a ninguna persona o organitzación que necesite interactuar con el Ayuntamiento a utilizar un programa específico (esto equivaldría a un monopolio sancionado por el Estado).

source: Ensuring data sovereignty, privacy and security, for the citizens and for the municipality.
ca: Garantia de la sobirania de dades, la privacitat i la seguretat, de la ciutadania i del municipi.
es: Garantía de la soberanía de datos, la privacidad y la seguridad, de la ciudadanía y del municipio.

source: Avoiding vendor lock-in and, more generally, freeing IT policy and planning from commercial strategies, constructing better tailored, more flexible, more sustainable solutions.
ca: Evitar la dependència de proveïdors únics (_vendor_lock-in_) i, de manera més general, alliberar la planificació i les decisions sobre informàtica de les estratègies comercials, construint solucions més adaptades, més flexibles i sostenibles.
es: Evitar la dependéncia de proveedores únicos (_vendor_lock-in_) y, de forma más general, liberar la planificación y las decisiones sobre informática de las estratégias comerciales, construyendo soluciones más adaptadas, más flexibles y sostenibles.

source: Saving money, by avoiding proprietary license fees and through sharing and pooling of resources among municipalities and other government agencies.
ca: Estalvi de diners, evitant pagar per les llicències i compartint i mancomunant recursos entre municipis i amb altres agències governamentals.
es: Ahorro de dinero, evitando pagar para las licéncias y compartiendo y mancomunando recursos entre municipios y con otras agéncias governamentales.

source: Purpose of this Guide
ca: Objectius d’aquesta guia
es: Objetivos de esta guía

source: This Guide serves a double purpose:
ca: L’objectiu d’aquesta guia és doble:
es: Esta guía tiene un doble objetivo:

source: To help IMI staff use technologies based on free software so they make the most of its advantages and minimise potential risks.
ca: Facilitar al personal de l’IMI un ús efectiu de tecnologies basades en programari lliure i de codi obert, de manera que se n’aprofitin al màxim els avantatges i es minimitzin els potencials riscos.
es: Facilitar al personal del IMI un uso efectivo de tecnologías basadas en software libre, de manera que se aprovechen al máximo sus ventajas y se minimicen los potenciales riesgos.

source: To help maintain Barcelona City Council's reputation as a transparent and reliable institutional collaborator in free software projects, taking into account the sector's best practices.
ca: Preservar la reputació de l’Ajuntament de Barcelona com a institució que col·labora en projectes de programari lliure de manera transparent, confiable i tenint en compte les millors pràctiques del sector.
es: Preservar la reputación del Ayuntamiento de Barcelona como institución que colabora en proyectos de software libre de manera transparente, confiable y teniendo en cuenta las mejores prácticas del sector.

source: Despite the enormous diversity that currently exists among free software projects, a series of practices have gradually arisen that are shared by most projects and organisations which have a certain degree of success. These cover technical and legal aspects, as well as project management. Some of these practices can be considered necessary, in the sense that the operational dynamics of free software projects reward certain types of conduct and penalise others.
ca: Malgrat l’enorme diversitat existent entre els projectes de codi obert, amb el temps han emergit una sèrie de pràctiques que comparteixen la majoria de projectes i organitzacions que assoleixen un cert èxit. Això inclou aspectes tant tècnics, com legals, com de gestió de projectes. Algunes d’aquestes pràctiques podríem dir que son d’adopció obligatòria, en el sentit que les dinàmiques de treball dels projectes oberts premien determinades conductes i en penalitzen d’altres.
es: A pesar de la enorme diversidad existente entre los proyectos de software libre, con el tiempo han emergido una serie de prácticas que comparten la mayoría de proyectos y organizaciones que alcanzan un cierto éxito. Esto incluye aspectos tanto técnicos, como legales, como de gestión de proyectos. Algunas de estas prácticas podría decirse que son de adopción obligatoria, en el sentido de que las dinámicas de trabajo de los proyectos libres premian determinadas conductas y penalizan otras.

source: In some cases free software common practices can be very different from working methods used when there is no intention of publishing the source code under a free license. This means IMI's learning process and adaptation will have a cost, but we believe that it will be far outweighed by the organisational improvements it will bring – together with the incorporating agile methods –.
ca: Aquestes pràctiques estan orientades a facilitar la màxima diversitat de participants, molts cops sense una coordinació centralitzada, i a preservar al mateix temps la qualitat del producte. En alguns casos poden diferir substancialment de la forma de treballar quan es desenvolupa sense una voluntat de publicar el codi. Per tant, el procés d’aprenentatge i adaptació de l’IMI tindrà un cost, però creiem que es veurà superat en escreix per la millora organitzativa que suposarà –en simbiosi amb la incorporació de metodologies àgils–,
es: Estas prácticas están orientadas a facilitar la máxima diversidad de participantes, muchas veces sin una coordinación centralizada, y a preservar al mismo tiempo la calidad del producto. En algunos casos pueden diferir sustancialmente de la forma de trabajar cuando se desarrolla sin voluntad de publicar el código. Por lo tanto, el proceso de aprendizaje y adaptación del IMI tendrá un coste, pero creemos que este se verá superado con creces por la mejora organizativa que supondrá —en simbiosis con la incorporación de metodologías ágiles—, además de todos los beneficios antes mencionados. Como indica Karl Fogel en _Producing Open Source Software_:

source: This document codifies and adapts these best practices to IMI, so they may serve as a guide in the learning process and in decision-making.
ca: En definitiva, aquest document pretén explicar les millors pràctiques disponibles per utilitzar i desenvolupar programari de codi obert. Ho fa codificant i adaptant a l’IMI aquestes bones pràctiques, de manera que serveixi de guia en el procés d’aprenentatge i en la presa de decisions.
es: Este documento codifica y adapta estas buenas prácticas al IMI, de modo que sirvan de guía en el proceso de aprendizaje y en la toma de decisiones.

source: To find out more
ca: Per saber-ne més
es: Para saber más

source: A very good resource for understanding all the technical, legal and social aspects of free software development is Karl Fogel’s book https://producingoss.com/en/index.html[Producing Open Source Software] (the 2017 edition, only available in an e-version, which can be freely consulted online). The book uses the term _open source_, which basically refers to the same range of projects as _free software_. (The proponents of both terms differ on their political and philosophical views, but the practical aspects we treat in this document are mostly shareable by both camps.) We have taken many of the practical recommendations in that book into account in drawing up this Guide.
ca: Un molt bon recurs per entendre tots els aspectes tècnics, legals i socials que envolten el desenvolupament de programari lliure és el llibre de Karl Fogel https://producingoss.com/en/index.html[Producing Open Source Software] (en l’edició de 2017, només disponible electrònicament i consultable lliurement per Internet). En l’elaboració d’aquesta Guia s’han tingut en compte moltes de les recomanacions recollides al llibre.
es: Un muy buen recurso para entender todos los aspectos técnicos, legales y sociales que rodean el desarrollo de software libre es el libro de Karl Fogel https://producingoss.com/es/index.html[Producing Open Source Software] (en la edición del 2017, solo disponible en soporte electrónico y de consulta libre por internet). En la elaboración de esta guía se han tenido en cuenta muchas de las recomendaciones recogidas en el libro.

source: The Guide also contains lots of recommendations on service procurement. A good document for understanding the particular features of public procurement of free software in the context of the European Union is https://joinup.ec.europa.eu/document/guideline-public-procurement-open-source-software[Guideline on public procurement of Open Source Software], published in 2010 by Rishab Aiyer Ghosh, Ruediger Glott, Patrice-Emmanuel Schmitz and Abdelkrim Boujraf, and commissioned by the European Commission under the https://joinup.ec.europa.eu//[Join Up] initiative.
ca: La Guia conté també una gran quantitat de recomanacions que tenen a veure amb la contractació de diferents serveis. Un bon document per entendre les particularitats de la contractació de programari lliure des de l’administració pública és la https://producingoss.com/en/index.html[Guideline on public procurement of Open Source Software], publicat al 2010 per Rishab Aiyer Ghosh, Ruediger Glott, Patrice-Emmanuel Schmitz i Abdelkrim Boujraf, per encàrrec de la Comissió Europea sota la iniciativa https://joinup.ec.europa.eu//[Joinup].
es: La guía contiene también una gran cantidad de recomendaciones que tienen que ver con la contratación de diferentes servicios. Un buen documento para entender las particularidades de la contratación de software libre desde la Administración pública es https://joinup.ec.europa.eu/document/guideline-public-procurement-open-source-software[Guideline on public procurement of Open Source Software], publicado en el 2010 por Rishab Aiyer Ghosh, Ruediger Glott, Patrice-Emmanuel Schmitz y Abdelkrim Boujraf, por encargo de la Comisión Europea bajo la iniciativa https://joinup.ec.europa.eu//[Join up].
