Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/legal-aspects.po
Languages: es

source: Legal aspects
es: Aspectos legales

source: Free software projects are based on a whole series of technologies, working methods and ways of collaborating but all that would not be sustained without a very special legal mechanism: the free software licences. The use of such licences in itself guarantees a series of inalienable rights, which allows a certain flexibility about the copyright policy.
es: Los proyectos de software libre se basan en un conjunto de tecnologías, métodos de trabajo y maneras de colaborar, pero todo ello no se sostendría sin un dispositivo legal muy especial: las licencias de software libre. El uso de licencias libres garantiza per se una serie de derechos inalienables, lo que permite en cierta manera flexibilizar la política de propiedad intelectual (PI).

source: Ownership of the code copyright
es: Propiedad intelectual

source: Until now, contracts with suppliers stipulated that all the software developed for the City Council within the framework of the contract, and associated documents, is owned by the Council.
es: Hasta ahora, los contratos con proveedores establecían que todo el software desarrollado para el Ayuntamiento en el contexto del contrato, así como la documentación asociada, son propiedad del Ayuntamiento.

source: With free software licences, even though one does not have legal ownership of the source code, that code can be used as often as necessary and for whatever task is desired, as well as modified, adapted and redistributed (the latter under the conditions set by the licence). So the City Council could waive assignment of the copyrights in the code (provided it obtains the code under a free software license), but for the moment we conservatively continue claiming assignment as the default policy (apart from the exceptions stated in the alternatives below). The only two things that are not possible to do without being the legal owner of the code is relicense it or transfer the ownership.
es: Con las licencias libres, aunque no se tenga la propiedad legal del código, este se podrá utilizar tantas veces como sea necesario y para la tarea que se desee, además de poder ser modificado, adaptado y redistribuido (esto último en las condiciones que establezca la licencia). Así que el Ayuntamiento podría renunciar a toda la PI, pero de momento y de manera conservadora la sigue reclamando, como política por defecto (con las excepciones que se indican en las alternativas que se detallan a continuación). Lo único que no se puede hacer sin ser los propietarios legales del código es relicenciar.

source: The main criterion for assessing who should hold the copyrights in the case of new projects, is to think which entity best ensures at each point that the appropriate measures are taken to disseminate the project, facilitate contributions from third parties, make it grow to achieve the objectives and make it sustainable in the long term.
es: El principal criterio para valorar quién se tiene que quedar con la PI en el caso de proyectos nuevos es pensar qué entidad garantiza mejor que se tomen en cada momento las medidas adecuadas para difundir el proyecto, facilitar contribuciones de terceros, hacerlo crecer hasta alcanzar los objetivos y hacerlo sostenible a largo plazo.

source: Establish Barcelona City Council as the owner of the new source code and the new documentation
es: Establecer el Ayuntamiento de Barcelona como propietario del nuevo código fuente y la nueva documentación

source: Procurement
es: Contratar

source: Adaptation
es: Adaptación

source: NewProduct
es: NuevoProducto

source: Publication
es: Publicación

source: That is the default option but not the only one. It forces the contractor to assign ownership of the copyrights in the code and the documentation that it generates.
es: Es la opción por defecto, pero no la única. Se le impone al contratista una cesión de titularidad de todo el código y documentación generadas.

source: It particularly makes sense that the City Council should wish to concentrate all property rights on emblematic projects, principally used between public administrations, and on those over which it intends to decide to a large extent the rules of governance.
es: Tiene sentido especialmente que el Ayuntamiento quiera concentrar todos los derechos de propiedad sobre proyectos emblemáticos, de utilidad principalmente entre administraciones públicas, y sobre los que pretenda determinar en gran medida las reglas de gobernanza.

source: Assign ownership of the new source code to the legal owner of the original code
es: Ceder la propiedad del nuevo código fuente al propietario legal del código original

source: When we adapt an existing product, to accept the inclusion of our code in the original product we may be asked to sign a Contributor Licence Agreement (CLA) or equivalent contract. If not, the parts developed by the City Council can be owned by it.
es: Cuando adaptamos un producto ya existente, puede ser que para aceptar la inclusión de nuestro código en el producto original nos pidan firmar un contributor licence agreement (CLA) o contrato equivalente. Si no es así, las partes que desarrolle el Ayuntamiento pueden ser de su propiedad.

source: Assign ownership of the source code to an independent non-profit
es: Ceder la propiedad del código fuente a una entidad independiente sin ánimo de lucro

source: There is a third option if the aim is for ownership to eventually go to an external organisation responsible for the running and governance of the project in the long term. Given the nature of the function, that organisation will normally take the legal form of a foundation or other non-profit entity. This makes sense in projects where, besides the City Council, other public, private or third sector bodies are involved financially and in decision-making. In this case copyright must be assigned by contract, either directly to the corresponding entity, or initially to the City Council, so the latter can assign copyright to the entity at a later date.
es: Hay una tercera opción, si el objetivo es que la titularidad recaiga finalmente en una entidad externa encargada de la gestión y gobernanza del proyecto a largo plazo. Por la naturaleza de la función que realizar, esta entidad tendrá normalmente forma legal de fundación. Eso tiene sentido en proyectos donde, además del Ayuntamiento, participen financieramente y en la toma de decisiones otras entidades públicas, privadas o del tercer sector. En este caso, hay que establecer por contrato una cesión de derechos, que puede ser directamente a la fundación correspondiente, o bien en primer término al Ayuntamiento, que es quien hace el contrato, a fin de que sea este quien ceda los derechos a la fundación en un momento posterior.

source: The foundation can manage other projects freed by the City Council or of other entities linked with the public sphere.
es: Esta entidad puede gestionar otros proyectos liberados por el Ayuntamiento o de otras entidades asociadas del ámbito público.

source: Establish the supplier as the legal owner of the new source code and the new documentation
es: Establecer la empresa o entidad proveedora como propietaria del nuevo código fuente y la documentación

source: It makes sense to leave ownership in the hands of the company that develops the software when:
es: Tiene sentido dejar la titularidad en manos de la empresa que desarrolla en los siguientes casos:

source: Software components are for general use, including companies and not just public authorities.
es: Componentes de software que son de utilidad general, incluyendo empresas y no solo administraciones públicas.

source: The supplier is a company or a cooperative with a track record of publishing free software and running free software communities, and which has a credible strategy for exploiting the product based on free software licences.
es: El proveedor es una empresa o cooperativa con una trayectoria contrastada de publicación de software libre y gestión de comunidades abiertas, y tiene una estrategia creíble de explotación del producto basada en licencias libres.

source: Choose a licence for the code
es: Escoger una licencia para el código

source: There are three options, depending on the use-case:
es: Separaremos la decisión en tres casos, dependiendo del escenario:

source: `NewProdct` or `Publication`: we choose the AGPL licence by default.
es: `NuevoProducto` o `Publicación`: escogemos, por defecto, la licencia pública general de Affero (AGPL, por sus siglas en inglés).

source: `Adaptation`: we modify an existing project. In this case we have to respect the licence it already has.
es: `Adaptación`: modificamos un proyecto externo ya existente. En este caso, hay que respetar la licencia que ya tenga.

source: `Plugin`: we choose a licence commonly used in the ecosystem in which we want to integrate a modular component.
es: `Plugin`: escogemos una licencia de uso común en el ecosistema en que queremos integrar un componente modular.

source: Use the AGPL-3.0 licence as the licence for distributing the project
es: Escoger la licencia AGPL-3.0 como licencia de distribución del proyecto

source: The https://www.gnu.org/licenses/why-affero-gpl.html[GNU Affero General Public License v3.0] (AGPL-3.0) has all the characteristics we need for City Council projects:
es: La licencia https://www.gnu.org/licenses/why-affero-gpl.html[GNU Affero General Public License v3.0 (AGPL-3.0)] tiene todas las características que necesitamos para los proyectos del Ayuntamiento:

source: It is a licence with copyleft, as required by Spanish law for public authorities creating free software products, and as it is reasonable to demand of them to prevent private appropriation of what has been financed using public money.
es: Es una licencia con copyleft, tal como obliga la ley española para las administraciones públicas que creen productos de software libre, y tal como es razonable reclamar a las administraciones para evitar una apropiación privada de lo que ha sido financiado con dinero público.

source: For applications where users mainly interact via the internet, the law does not allow the creation of a closed service using software with this licence (it establishes internet access as a form of distribution for the purposes of the licence). This is sometimes called internet copyleft.
es: Para aplicaciones en las que los usuarios interactúan principalmente a través de internet, no permite crear un servicio cerrado utilizando software con esta licencia (establece el acceso por red como una forma de distribución a efectos de la licencia). Es lo que se denomina a veces copyleft de red.

source: The licence’s governing body is the GNU project, the non-profit organisation that works for the benefit of free software communities. Therefore, it is this group of activists and experts who will design future versions of the licence (to adapt it to new legal and technical circumstances) and the legal defence against possible attacks on the freedoms set out in its text.
es: El órgano de gobernanza de la licencia es el proyecto GNU, que es una organización sin ánimo de lucro que trabaja en beneficio de las comunidades de software libre. Por lo tanto, es este grupo de activistas y expertos el que diseñará las futuras versiones de la licencia (para adaptarse a nuevas circunstancias técnicas o legales) y las estrategias de defensa legal frente a posibles ataques a las libertades que establece su texto.

source: The main reason for choosing this licence as the default option are as follows:
es: Las razones principales para escoger esta licencia como opción por defecto son las siguientes:

source: It belongs to the GNU GPL family of licences, which is the best known. Most developers are familiar with its conditions, which means nobody will have to spend time researching the licence to decide if they want to participate in the project or not.
es: Pertenece a la familia de licencias de la GNU GPL, que es la más conocida. La mayoría de desarrolladores están familiarizados con sus condiciones y eso evita que se tenga que dedicar tiempo a investigar la licencia para decidir si se quiere participar en el proyecto o no.

source: Opting for more widely used licences reduces the risk of fragmenting this universal immaterial commons resource posed by free software, a risk caused by the proliferation of licences and their reciprocal incompatibilities.
es: Optar por las licencias de uso más generalizado reduce el riesgo de fragmentación de este procomún inmaterial universal que supone el software libre, riesgo provocado por la proliferación de licencias y sus incompatibilidades recíprocas.

source: It is written in English. For your information, translations into other languages can be used but the original version is the only legally valid one.
es: Está escrita en inglés. A título informativo se pueden utilizar traducciones a otros idiomas, pero solo la versión original tiene validez legal.

source: Use the EUPL-1.2 licence as the licence for distributing the project
es: Escoger la licencia EUPL-1.2 como licencia de distribución del proyecto

source: The https://joinup.ec.europa.eu/page/introduction-eupl-licence[European Union Public License 1.2] (EUPL-1.2) is a licence created by the European Commission.
es: La licencia https://joinup.ec.europa.eu/page/introduction-eupl-licence[European Union Public License 1.2] (EUPL-1.2) es una licencia creada por la Comisión Europea.

source: The advantage it has over licences belonging to the GNU GPL family is that it has legally valid translations for all the EU’s official languages: https://joinup.ec.europa.eu/page/eupl-text-11-12.[https://joinup.ec.europa.eu/page/eupl-text-11-12]. Its design has also taken into account the legal diversity of the member states as regards copyright terminology, warranties and applicable jurisdiction.
es: Presenta como ventaja sobre las licencias de la familia GNU GPL el hecho de disponer de traducciones legalmente válidas a todos los idiomas oficiales de la Unión Europea: https://joinup.ec.europa.eu/page/eupl-text-11-12. También en su diseño se ha tenido en cuenta la diversidad legal de los Estados miembros en cuanto a terminología sobre copyright, garantías y jurisdicción aplicable.

source: Just like the AGPL-3.0, it has copyleft and internet copyleft. The copyleft conditions it sets out in the case of linking with other products are softer than those of the AGPL-3.0 and more like those of the LGPL. However, many legal experts think these differences are irrelevant before the European courts. The fine details of the differences with the GP-3.0 (and with the AGPL-3.0 too) are explained at: https://joinup.ec.europa.eu/news/eupl-or-gplv3-comparison-t.
es: Igual que la AGPL-3.0, dispone de copyleft y de copyleft de red. Las condiciones de copyleft que establece en caso de enlazado (linking) con otros productos son más suaves que las de AGPL-3.0, y más parecidas a las de LGPL. No obstante, muchos juristas piensan que estas diferencias pueden ser irrelevantes de cara a los tribunales europeos. El detalle de las diferencias con GPL-3.0 (y también con AGPL-3.0) se detalla en: https://joinup.ec.europa.eu/news/eupl-or-gplv3-comparison-t.

source: Using this licence (in its latest version, 1.2) should pose a low risk of fragmentation for the free software commons, as it establishes explicit compatibility with the main families of licences with copyleft, including the GNU licences. You can find more information on EUPL 1.2 compatibility with other licences at: https://joinup.ec.europa.eu/page/eupl-compatible-open-source-licences.
es: Utilizar esta licencia (en su última versión, la 1.2) tendría que suponer un riesgo de fragmentación bajo por el procomún del software libre, ya que en su redactado establece compatibilidad explícita con las principales familias de licencias con copyleft, incluidas las de GNU. Se pueden encontrar más detalles sobre la compatibilidad de la EUPL-1.2 con otras licencias en https://joinup.ec.europa.eu/page/eupl-compatible-open-source-licences.

source: The European Commission, through its Join Up initiative, is the licence’s governance body.
es: El órgano de gobernanza de la licencia es la Comisión Europea, a través de su iniciativa Join up.

source: *Drawback.* It is much less known and less widespread than the GNU GPL licences. Many developers may be hesitant about using it. At best, they might be convinced that its conditions are very similar to those of the AGPL-3.0. In the worst case scenario, they would prefer to contribute to another project that has a licence they are used to.
es: *Inconveniente*. Es una licencia mucho menos conocida y extendida que las de la familia GNU GPL. Muchos desarrolladores dudarán sobre si utilizarla. En el mejor de los casos se los podrá convencer de que sus condiciones son muy similares a las del AGPL-3.0. En el peor escenario, preferirán contribuir a otro proyecto con una licencia a la que estén habituados.

source: Use the original licence for all code that modifies an existing component
es: Utilizar para todo el código que modifica un componente ya existente su licencia original

source: When we modify a component, and to ensure our modifications might potentially be incorporated into the original product, we have to respect the licence we are given, although we could modify it in the case of lax permissive licences.
es: Cuando modificamos un componente, y a fin de que nuestras modificaciones puedan incorporarse potencialmente al producto original, hay que respetar la licencia que nos viene dada, aunque en el caso de licencias permisivas podríamos modificarla.

source: For development under contract, each circumstance needs to be specified in the specifications.
es: En el caso de un desarrollo bajo contrato, hay que especificar en los pliegos esta circunstancia.

source: If we have respected measure S_58B, the component we are modifying will have a free software licence.
es: Si hemos respetado la medida S_58B, el componente que estamos modificando tendrá una licencia libre.

source: Use a licence commonly used in the ecosystem or technological platform of the component to be developed
es: Escoger una licencia de uso común en el ecosistema o plataforma tecnológica del componente que desarrollar

source: If we have to build a plugin to an existing platform (the core of which, according to measure S_58B, has to be free), we have a certain margin for choosing the licence. It is best to choose one from among those most used in the framework or platform in question, in order to facilitate the new component’s acceptance by the community. We are interested in more people using and contributing towards maintaining our component. So, if the AGPL or the EUPL are among these more popular licences, we choose them.
es: Si tenemos que construir una extensión enchufable a una plataforma existente (cuyo core, por la medida S_58B, debe ser libre), tenemos un cierto margen para escoger la licencia. Conviene escoger una licencia entre las más utilizadas dentro del framework o plataforma en cuestión, con el fin de facilitar la aceptación del nuevo componente por parte de la comunidad. Nos interesa que más gente utilice y contribuya a mantener nuestro componente. Si entre estas licencias más populares se encuentran la AGPL o la EUPL, las escogeremos.

source: Comply with the licence obligations
es: Cumplir con las obligaciones de las licencias

source: Write a checklist with the obligations of the licences used and monitor compliance
es: Escribir una checklist con las obligaciones de las licencias usadas y hacer seguimiento de su cumplimiento

source: Integration
es: Integración

source: Each licence grants different rights and obligations, to both users and developers. We must ensure compliance with the obligations of all the licences for the main components of the project, whether we have chosen them or not.
es: Cada licencia otorga derechos y obligaciones diferentes, tanto para los usuarios como para los desarrolladores. Hay que garantizar que se cumple con las obligaciones de todas las licencias de los componentes principales del proyecto, las hayamos escogido nosotros o no.

source: The summaries shown at https://tldrlegal.com/ could be very useful, for example:
es: Pueden ser de gran utilidad los resúmenes que muestra la página https://tldrlegal.com/, por ejemplo:

source: This summary (focus particularly on the “Conditions” section of each licence) could also be useful: https://choosealicense.com/licenses/.
es: También puede servir este resumen (hay que fijarse, sobre todo, en el apartado “Conditions” de cada licencia): https://choosealicense.com/licenses/.

source: With regard to the EUPL it is also worth reading https://joinup.ec.europa.eu/page/guidelines-users-and-developers[Guidelines for users and developers].
es: En el caso de la EUPL también conviene leer el documento https://joinup.ec.europa.eu/page/guidelines-users-and-developers[Guidelines for users and developers].

source: Upload the licence text to the main repository
es: Subir el texto de la licencia al repositorio principal

source: Day1
es: Día1

source: The licence will go in plain text in a file called `LICENSE` (no extension), in the repository’s root directory.
es: La licencia irá en texto plano en un fichero denominado LICENSE (sin extensión), en el directorio raíz del repositorio.

source: The text of the two recommended licences (which should be copied word for word) can be found at:
es: El texto de las dos licencias recomendadas (que hay que copiar de forma literal) se puede encontrar en:

source: The `LICENSE` has to be in English. When using the EUPL-1.2 licence, which has official translations, we have the option of including `LICENSE.ca.txt` and `LICENSE.es.txt` files. The different translations can be found at https://joinup.ec.europa.eu/page/eupl-text-11-12.[https://joinup.ec.europa.eu/page/eupl-text-11-12].
es: El fichero LICENSE debe estar en inglés. En caso de utilizar la licencia EUPL-1.2, que tiene traducciones oficiales, opcionalmente podemos incluir ficheros `LICENSE.ca.txt` y `LICENSE.es.txt`. Las diferentes traducciones se encuentran en https://joinup.ec.europa.eu/page/eupl-text-11-12.[https://joinup.ec.europa.eu/page/eupl-text-11-12].

source: Include a copyright and licence notice in each code file
es: Incluir la notificación de copyright y de licencia en cada fichero de código

source: Most licences stipulate the inclusion of a licence and copyright notice.
es: La mayoría de licencias especifican una condición denominada, en inglés, License and copyright notice.

source: This means at the top of all repository code files (except build script and installation files) there must be a notice that explicitly states which persons or entities are the code’s copyright holders and which licence establishes the distribution terms.
es: Todos los ficheros de código del repositorio (excluyendo scripts de build o de instalación) tienen que incluir al inicio una notificación que haga explícito qué personas o entidades son propietarias legales del código (en inglés, copyright holder), y cuál es la licencia que establece los términos de la distribución.
