Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/legal-aspects.po
Languages: es

source: It is important to point out under which specific version of the licence it is distributed, and we recommend stating that this will be automatically updated to future versions when these are released (usually to adapt to unforeseeable technological and social changes), with no need to update all the code files. In the examples given below, this is shown by clauses such as “either version X of the License, or (at your option) *any later version*” or “version X or – as soon they will be approved by the European Commission – *subsequent versions* of the EUPL”.
es: Es importante señalar bajo qué versión concreta de la licencia se hace la distribución, y se recomienda señalar que se dará por realizada una actualización automática a futuras versiones de la licencia cuando estas se publiquen (normalmente para adaptarse a nuevas situaciones técnicas o jurídicas que no se habían podido prever), sin necesidad de actualizar todos los ficheros de código. En los ejemplos de más abajo eso se indica mediante frases como “either version X of the License, or (at your option) *any later version*” o bien “version X or —as soon they will be approved by the European Commission— *subsequent versions* of the EUPL”.

source: Obviously, the notice must go in a comment, using the comment syntax each program language uses. And it must also include all the years when modifications have been made to the file. This would be an example, if we use the AGPL-3.0 on Java code, assuming the copyright holder is Barcelona City Council:
es: La notificación debe ir, obviamente, dentro de un comentario, empleando la sintaxis para comentarios que cada lenguaje de programación utilice. Y tiene que incluir todos los años en que se hayan realizado modificaciones en el fichero. Este sería un ejemplo, si utilizamos la AGPL-3.0 sobre código Java, suponiendo que el propietario del código sea el Ayuntamiento de Barcelona:

source: The same example using EUPL-1.2:
es: El mismo ejemplo, utilizando la EUPL-1.2:

source: Establish a procedure for guaranteeing the integrity of the contributions
es: Establecer un procedimiento para garantizar la integridad de las contribuciones

source: This means all the code in the repository has the permission of the person who wrote it (which is not always the person who makes the commit) to be there under the licence conditions of the project.
es: Eso significa que de todo el código incluido en el repositorio se tiene permiso de la persona que lo ha escrito (que no siempre es la persona que hace el commit) para que esté allí bajo las condiciones de la licencia del proyecto.

source: If the code copyright holders have to be different from the authors (for example, because Barcelona City Council is the holder) an assignment of rights must be obtained. This can be done in the following ways:
es: Si los propietarios del código tienen que ser diferentes de los autores (por ejemplo, porque la propiedad es del Ayuntamiento de Barcelona), hay que obtener una cesión de derechos. Esta cesión se puede conseguir de las siguientes maneras:

source: A “contributor agreement”-type contract
es: Mediante un contrato tipo contributor agreement

source: The corresponding tender contract
es: Mediante el propio contrato de la licitación correspondiente

source: Directly through the software licence
es: Directamente, a través de la licencia del software

source: Require all external code contributors to send a DCO and sign each commit
es: Obligar a todos los contribuyentes de código externos a enviar un DCO y firmar cada commit

source: The *Developer’s Certificate of Origin (DCO)* is the document used to verify that the developers who contribute to the project recognise and accept its licence.
es: El *Developer’s Certificate of Origin (DCO)* es el documento utilizado para verificar que los desarrolladores que hacen contribuciones al proyecto conocen y aceptan su licencia.
