Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/technical-infrastructure.po
Languages: ca, es

source: To finally enable our changes to be integrated and our defect notifications to make sense.
es: Para permitir finalmente integrar nuestros cambios, y que nuestras notificaciones de defectos tengan sentido.

source: Issue manager
ca: Gestor d’incidències
es: Gestor de incidencias

source: One tool all free software projects need is an issue manager or bug tracker. At the City Council we assign it the following functions:
ca: Una eina que tots els projectes de codi obert necessiten és un gestor d’incidències. Als projectes de l’Ajuntament li assignarem les següents funcions:
es: Una herramienta que todos los proyectos de software libre necesitan es un gestor de incidencias. En los proyectos del Ayuntamiento le asignaremos las siguientes funciones:

source: Provide notification of any defects detected (bugs tracked) by users and developers. Also to make their treatment, evolution and eventual solution transparent. It is important that the changes (commits) that solve a defect (bug) point it out in their message. https://help.github.com/articles/closing-issues-using-keywords/[GitHub has keywords for this].
ca: Notificar els defectes detectats (bug tracker) per part tant d’usuaris com de desenvolupadors. També fer-ne transparent el tractament, evolució i eventual solució. És important que els commit que resolen un defecte o assenyalin en el seu missatge. https://help.github.com/articles/closing-issues-using-keywords/[GitHub té una sintaxi especial per fer això].
es: Notificar los defectos detectados (bug tracker) por parte tanto de usuarios como de desarrolladores, así como hacer transparente el tratamiento, evolución y eventual solución. Es importante que los commits que resuelven un defecto lo señalen en su mensaje. https://help.github.com/articles/closing-issues-using-keywords/[GitHub tiene una sintaxis especial para ello].

source: Follow up tasks that are pending. This enables one or more commits to then be linked with the closing of an issue It is also possible to see who tasks have been assigned to and how they are prioritised. One option is to specify estimated completion dates. All this contributes to the transparency and traceability of the development process.
ca: Fer seguiment de les tasques pendents. Això permet després vincular un o més commit amb el tancament d’una tasca. També poder veure a qui s’assignen les tasques i com es prioritzen. Opcionalment s’hi poden especificar dates estimades de realització. Tot plegat contribueix a la transparència i traçabilitat del procés de desenvolupament.
es: Hacer seguimiento de las tareas pendientes, lo que permite después vincular uno o más commits con el cierre de una tarea. Asimismo, poder ver a quién se asignan las tareas y cómo se priorizan. Opcionalmente, se pueden especificar fechas estimadas de realización. Todo ello contribuye a la transparencia y trazabilidad del proceso de desarrollo.

source: Follow up how the contributions of the different parts are managed by means of the pull request mechanism. The bug tracker could even be open to feature requests and the GitHub space could be used for publicly managing and prioritising.
ca: Fer seguiment de com es gestionen les contribucions de diferents parts, mitjançant el mecanisme de pull request. Fins i tot es pot obrir el gestor d’incidències a peticions de funcionalitats (feature request) i es pot utilitzar l’espai de GitHub com a lloc on es prioritzen i gestionen de manera pública.
es: Hacer seguimiento de cómo se gestionan las contribuciones de diferentes partes, mediante el mecanismo de pull request. Incluso se puede abrir el gestor de incidencias a peticiones de funcionalidades (feature request) y se puede utilizar el espacio de GitHub como sitio donde se priorizan y gestionan de manera pública.

source: It needs to be borne in mind that the bug tracker is not only important for the everyday work of developers but also that many project observers use it as a measure of how serious the project is.
ca: S’ha de tenir en compte que el gestor d’incidències no és només important per al dia a dia dels desenvolupadors, sinó que molts observadors del projecte també el fan servir com a mesura de fins a quin punt estan davant d’un projecte seriós.
es: Debe tenerse en cuenta que el gestor de incidencias no es solo importante para el día a día de los desarrolladores, sino que muchos observadores del proyecto también lo utilizan como medida para saber hasta qué punto están ante un proyecto serio.

source: This bug tracker has to be operational and public throughout the product’s useful life, i.e. after the contracts with the City Council have finished.
ca: Aquest gestor d’incidències ha d’estar operatiu i públic durant tota la vida útil del producte, més enllà de la duració que tinguin els contractes amb l’Ajuntament.
es: Este gestor de incidencias tiene que estar operativo y ser público durante toda la vida útil del producto, más allá de la duración que tengan los contratos con el Ayuntamiento.

source: Use GitHub/Gitlab for the issue manager of the project
ca: Vincular el repositori principal al gestor d’incidències de GitHub
es: Vincular el repositorio principal al gestor de incidencias de GitHub

source: Some basic issue categories will have to be established at the start that can be modified later, depending on the needs of each project: `Bug`, `Feature Request`, etc.
ca: S’hauran d’establir des de l’inici algunes categories bàsiques d’incidència, que després poden modificar-se segons les necessitats de cada projecte: `Bug`, `Request`, etcètera.
es: Se tendrán que establecer desde el principio algunas categorías básicas de incidencia, que después pueden modificarse según las necesidades de cada proyecto: “Bug”, “Request”, etcétera.

source: Link the main repository to a public issue manager
ca: Vincular el repositori principal a un gestor d’incidències públic
es: Vincular el repositorio principal a un gestor de incidencias público

source: If this alternative is adopted, it must be borne in mind that:
ca: Si es fa servir aquesta alternativa, tenir en compte que:
es: Si se utiliza esta alternativa, hay que tener en cuenta lo siguiente:

source: It has to be public, in the sense that:
ca: Necessàriament ha de ser públic, en el sentit que:
es: Necesariamente tiene que ser público, en el siguiente sentido:

source: Everybody has to be able to register as a system user without paying a subscription, and thus take part in development.
ca: Tothom ha de poder registrar-se com usuari del sistema sense pagar cap subscripció, i així participar en el desenvolupament.
es: Todo el mundo debe poder registrarse como usuario del sistema sin pagar ninguna suscripción, y así participar en el desarrollo.

source: Everybody has to be able to see the issues and follow them, without having to register as a user.
ca: Tothom ha de poder visualitzar les incidències i fer-ne un seguiment, sense necessitat de registrar-se com usuari.
es: Todo el mundo debe poder visualizar las incidencias y hacer un seguimiento, sin necesidad de registrarse como usuario.

source: It must be linked from the code repository `README` file.
ca: Ha d’estar enllaçat des del fitxer `README` del repositori de codi.
es: Tiene que estar enlazado desde el fichero README del repositorio de código.

source: If the intention is for the issue manager to be part of the City Council’s own infrastructure, it has to be one of the following free tools: Gitlab, Redmine, Trac.
ca: Si es vol tenir el gestor d’incidències en infraestructura pròpia de l’Ajuntament, utilitzar una de les següents eines lliures: Gitlab, Redmine, Trac.
es: Si se quiere tener el gestor de incidencias en infraestructura propia del Ayuntamiento, hay que utilizar una de las siguientes herramientas libres: Gitlab, Redmine, Trac.

source: Use the issue manager for tasks, releases and new features
ca: Utilitzar el gestor d’incidències per tasques, entregues i noves funcionalitats
es: Utilizar al gestor de incidencias por tareas, entregas y nuevas funcionalidades

source: Integrating the repository with GitHub’s issue manager means that together they make a good tool for collaborating on any code-related issue, not just fixing bugs.
ca: La integració entre el repositori i el issue tracker de GitHub fa que en combinació siguin una bona eina per col·laborar en la realització de qualsevol tasca relacionada amb el codi, i no només la resolució de bugs.
es: La integración entre el repositorio y el issue tracker de GitHub hace que, en combinación, sean una buena herramienta para colaborar en la realización de cualquier tarea relacionada con el código, y no solo la resolución de bugs.

source: Draw up and maintain an issue management policy
ca: Redactar i mantenir una política de gestió d’incidències
es: Redactar y mantener una política de gestión de incidencias

source: It must specify:
ca: Ha d’especificar:
es: Tiene que especificar lo siguiente:

source: Issue type (defects, tasks, milestones, etc.).
ca: Tipus d’incidència (deficiències, tasques, milestones, etc).
es: Tipo de incidencia (deficiencias, tareas, milestones, etcétera).

source: Stages for those that arise.
ca: Etapes per les que passen.
es: Etapas por las que pasan.

source: This task can be given to the company awarded the contract. It it does not have one of its own, IMI will have to provide it with one.
ca: Se li pot encarregar aquesta tasca a l’adjudicatari. Si no en té una de pròpia l’IMI n’hauria de proporcionar una per defecte.
es: Se le puede encargar esta tarea al adjudicatario. Si no tiene una propia, el IMI debería proporcionar una por defecto.

source: Give everyone permission to report issues, even anonymously
ca: Donar permisos per reportar incidències a tothom, fins i tot anònimament
es: Dar permisos para reportar incidencias a todo el mundo, incluso anónimamente

source: Configure the issue manager so it will not be necessary to create an account to report defects or anything else, in order to facilitate as many contributions as possible. Activate the necessary anti-spam measures (e.g. captchas).
ca: Configurar el gestor d’incidències per tal que no sigui imprescindible crear-s’hi un compte per fer-hi reportar deficiències o qualsevol altre element, per facilitar al màxim les aportacions. Activar les mesures anti-spam que siguin necessàries (per exemple captchas).
es: Configurar el gestor de incidencias a fin de que no sea imprescindible crearse una cuenta para hacer reportar deficiencias o cualquier otro elemento, para facilitar al máximo las aportaciones. Activar las medidas antispam que sean necesarias (por ejemplo, captchas).

source: It is always possible to keep an eye on someone who gives us problems or rethink this policy if it doesn't work on a project.
ca: Sempre es pot vetar a alguna persona que doni problemes o reconsiderar aquesta política si no funciona en un projecte.
es: Se puede vetar a alguna persona que dé problemas o reconsiderar esta política si no funciona en un proyecto.

source: Put someone in charge of filtering issues as they arrive
ca: Establir una persona encarregada de filtrar les incidències a mida que arriben
es: Establecer una persona encargada de filtrar las incidencias a medida que llegan

source: Someone needs to be given the job of deleting duplicates, spam, etc.
ca: S’ha d’encarregar d’eliminar duplicats, spam, etc.
es: Se tiene que encargar de eliminar duplicados, spam, etcétera.

source: Add a warning that it will first be necessary to look for duplicates and check privately with another person that the problem reoccurs in a second machine.
ca: Complementar això amb un avís de que és necessari primer buscar duplicats i comprovar amb una altra persona, en privat, que el problema es reprodueix en una segona màquina.
es: Complementar esto con un aviso de que es necesario, primero, buscar duplicados y comprobar con otra persona, en privado, que el problema se reproduce en una segunda máquina.

source: Budget for this task if it is done under contract with a company or a cooperative.
ca: Pressupostar aquesta tasca si es fa sota un contracte amb una empresa o cooperativa.
es: Presupuestar esta tarea si se hace bajo un contrato con una empresa o cooperativa.

source: Notify the official bug tracker of the bugs in the product to be modified
ca: Fer la notificació de defectes al bug tracker oficial del producte a modificar
es: Hacer la notificación de defectos en el bug tracker oficial del producto que modificar

source: When we are adapting an existing product, one of the main contributions we can make to the project is to detect, isolate and fix any bugs there might be.
ca: Quan estem adaptant un producte existent, una de les majors contribucions que podem fer al projecte és ajudar a detectar, aïllar i solucionar deficiències que pugui tenir.
es: Cuando estamos adaptando un producto existente, una de las mayores contribuciones que podemos hacer al proyecto es ayudar a detectar, aislar y solucionar las deficiencias que pueda tener.

source: Successful bidders should be contractually obliged to properly notify us of the bugs, in accordance with the guidelines of each project, to help improve the product upstream.
ca: Cal obligar per contracte als adjudicataris a prendre’s la molèstia de notificar correctament les deficiències, d’acord amb les directrius de cada projecte, per ajudar a millorar el producte upstream.
es: Hay que obligar por contrato a los adjudicatarios a tomarse la molestia de notificar correctamente las deficiencias, de acuerdo con las directrices de cada proyecto, para ayudar a mejorar el producto upstream.

source: Integration infrastructure and testing
ca: Infraestructura d’integració i proves
es: Infraestructura de integración y pruebas

source: Link the main repository to a continuous integration system that run all the tests, make the results public
ca: Vincular el repositori principal a un sistema d’integració contínua de codi obert
es: Vincular el repositorio principal a un sistema de integración continua de software libre

source: Use a free software tool that we can run in our own infrastructure if needed. We recommend one of the following tools:
ca: Recomanem una de les següents eines:
es: Utilice una herramienta de software gratuita que podamos ejecutar en nuestra propia infraestructura si es necesario. Recomendamos una de las siguientes herramientas:

source: Internal and external communication channels
ca: Canals de comunicació interns i externs
es: Canales de comunicación internos y externos

source: The first lines of communication between developers are the repository commit messages and the issue manager threads. Many technical decisions are taken in these threads but the discussions that take place in them should always be highly focused and strictly technical. When the area under discussion broadens out, it is necessary to resort to other channels.
ca: Els primers canals de comunicació entre desenvolupadors son els missatges de commit del repositori i els fils del gestor d’incidències. Moltes decisions tècniques es prenen en aquests fils, però convé que les discussions que s’hi duen a terme siguin sempre molt focalitzades i estrictament tècniques. Quan l’àmbit de la discussió s’eixampla, cal recórrer a d’altres canals.
es: Los primeros canales de comunicación entre desarrolladores son los mensajes de commit del repositorio y los hilos del gestor de incidencias. Muchas decisiones técnicas se toman en estos hilos, pero es conveniente que las discusiones que se llevan a cabo estén siempre muy focalizadas y sean estrictamente técnicas. Cuando el ámbito de la discusión se amplía, hay que recurrir a otros canales.

source: Initially all new projects have to create a development mail list or a discussion forum, with public files. This is the channel through which the opinion of the different parties or individuals taking part in the project is sought and strategic decisions are taken.
ca: Tots els projectes nous han de crear inicialment una llista de correu o fòrum de discussió per a desenvolupament, amb arxius públics. En aquest canal és on es demana la opinió a les diferents parts o persones que participen en el projecte, i on es prenen les decisions estratègiques.
es: Todos los proyectos nuevos tienen que crear inicialmente una lista de correo o foro de discusión para desarrollo, con archivos públicos. En este canal es donde se pide la opinión a las diferentes partes o personas que participan en el proyecto, y donde se toman las decisiones estratégicas.

source: At first there will not be much that separates the developers and first users or early adopters as regards concerns and language, the latter usually being highly motivated. Consequently, in many cases the same channel will suffice. Later it may be necessary to create specialised communication channels for different kinds of participants.
ca: Inicialment hi haurà poca distància en quant a inquietuds i llenguatge entre els desenvolupadors i els primers usuaris (early adopters), que acostumen a estar molt motivats. Per això, en molts casos podran compartir el mateix canal. Més endavant pot ser necessari crear canals de comunicació especialitzats pels diferents tipus de participant.
es: Inicialmente habrá poca distancia en cuanto a inquietudes y lenguaje entre los desarrolladores y los primeros usuarios (early adopters), que suelen estar muy motivados. Por eso, en muchos casos podrán compartir el mismo canal. Más adelante puede ser necesario crear canales de comunicación especializados para los diferentes tipos de participante.

source: Depending on the nature and make-up of the team, it might be useful to have a chat room for more immediate communication. Either way, it would supplement the list or the forum, never replace it. The list or forum is where the whole history of the project (discussions, decisions, etc.) is recorded for reference, a very valuable asset for the whole project community, present and future.
ca: Depenent de la naturalesa i composició de l’equip, pot resultar convenient disposar també d’un xat que permeti una comunicació més immediata. De tota manera el xat és complementari amb la llista o fòrum, mai l’ha de substituir. La llista o fòrum és on queda registrada de forma referenciable tota la història del projecte (debats, decisions, etcètera), que és un actiu molt valuós per a tota la comunitat present i futura del projecte.
es: Dependiendo de la naturaleza y composición del equipo, puede resultar conveniente disponer también de un chat que permita una comunicación más inmediata. De todos modos, el chat es complementario a la lista o foro, nunca los tiene que sustituir. La lista o foro es donde queda registrada de forma referenciable toda la historia del proyecto (debates, decisiones, etcétera), que constituye un activo muy valioso para toda la comunidad presente y futura del proyecto.

source: Create a development list or forum that will initially do for users as well
ca: Crear una llista o fòrum de desenvolupament que inicialment servirà també per usuaris
es: Crear una lista o foro de desarrollo que inicialmente servirá también para usuarios

source: Initially the project will have a single dedicated discussion forum, shared by people carrying out development work and others who are just users of the product, the early adopters.
ca: nicialment el projecte tindrà un sol fòrum de discussió dedicat que compartiran tant les persones que realitzen el desenvolupament com aquelles que simplement siguin usuàries del producte (early adopters).
es: Inicialmente el proyecto tendrá un solo foro de discusión que compartirán tanto las personas que realizan el desarrollo como aquellas que simplemente sean usuarias del producto (early adopters).

source: We recommend using https://discourse.org/[Discourse], a tool that merges traditional mail lists with a forum via web. You need to activate the options so anyone who so wishes can interact entirely be email. A project that uses this tool and which is undergoing trials at the City Council is https://alvus.barcelona/[Alvus].
ca: Recomanem utilitzar l’eina https://discourse.org/[Discourse], que fusiona les llistes de correu tradicionals amb un fòrum via web. Cal activar les opcions per a que qui ho desitgi pugui fer tota la interacció a través de correu electrònic. Un projecte que utilitza aquesta eina i que està en proves a l’Ajuntament és https://alvus.barcelona/[Alvus].
es: Recomendamos utilizar la herramienta https://discourse.org/[Discourse], que fusiona las listas de correo tradicionales con un foro vía web. Hay que activar las opciones para que quien lo desee pueda hacer toda la interacción mediante correo electrónico. Un proyecto que utiliza esta herramienta y que está en pruebas en el Ayuntamiento es https://alvus.barcelona/[Alvus].

source: An alternative is to use Mailman 3. The list could be called `NAME-OF-THE-PROJECT-``dev`
ca: Alternativament podem utilitzar Mailman 3. La llista es pot dir `NOM-DEL-PROJECTE-``dev`.
es: Alternativamente, se puede utilizar Mailman 3. La lista se puede denominar `NOM-DEL-PROJECTE-``dev`.

source: Activate the file and use it profusely.
ca: Activar l’arxiu i utilitzar-lo profusament.
es: Activar el archivo y utilizarlo profusamente.

source: Initially in Catalan and/or Spanish. When participants appear in other languages, create a list in English.
ca: Inicialment en català i/o castellà. Quan apareguin participants en altres llengües, crear una llista en anglès.
es: Inicialmente, en catalán y/o castellano. Cuando aparezcan participantes en otros idiomas, se creará una lista en inglés.

source: The main developers must be present but they are not obligated to answer all the requests. Everyone participates on an individual basis in the list or the forum. If the people behind a product can be contacted, it engenders confidence in the product.
ca: Els principals desenvolupadors hi han de ser presents, però no tenen obligació de respondre a totes les peticions. Al fòrum o llista cadascú hi intervé a títol individual. Fa més confiable el producte que es pugui contactar amb les persones que hi ha a darrera.
es: Los principales desarrolladores deben estar presentes, pero no tienen obligación de responder a todas las peticiones. En el foro o en la lista, cada uno interviene a título individual. El producto es más confiable si se puede contactar con las personas que hay detrás.

source: Create a mail list for people who use the product, if the project grows
ca: Crear una llista de correu per persones que usen el producte, si el projecte creix
es: Crear una lista de correo para personas que usan el producto, si el proyecto crece

source: Activate the archive.
ca: Activar l’arxiu.
es: Hay que activar el archivo.

source: Create a development chat room for immediate communication between the team
ca: Crear un xat de desenvolupament per la comunicació immediata de l’equip
es: Crear un chat de desarrollo para la comunicación inmediata del equipo

source: Use https://gitter.im/[gitter.im] or https://riot.im/[riot.im].
ca: Usar https://gitter.im/[gitter.im] o https://riot.im/[riot.im].
es: Usar https://gitter.im/[gitter.im] o https://riot.im/[riot.im].

source: The section link:#repositori-de-codi-i-control-de-versions[Code repository and version control] explains how to set up the development site, the only one required from the outset. We can assess if there is also a need for a site geared towards other participant profiles as the project grows.
ca: A l’apartat Repositori de link:#repositori-de-codi-i-control-de-versions[codi i control de versions] s’explica com crear la web de desenvolupament, que és l’única que es necessita des de bon començament. A mida que el projecte creix, es pot valorar si cal també un lloc orientat a d’altres perfils de participant.
