Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/technical-infrastructure.po
Languages: ca, es

source: It is recommended that the name of the project in GitHub be written entirely in lower case, with the words in it separated by hyphens. For example: https://github.com/AjuntamentdeBarcelona/decidim-barcelona.
ca: El nom del projecte a GitHub es recomana que sigui tot en minúscules i amb les paraules de què està format separades per guions. Per exemple: https://github.com/AjuntamentdeBarcelona/decidim-barcelona.
es: Se recomienda que el nombre del proyecto en GitHub sea todo en minúsculas y con las palabras que lo formen separadas por guiones. Por ejemplo: https://github.com/AjuntamentdeBarcelona/decidim-barcelona.

source: This is where the code has to be from the start of the project, without waiting until there are any public releases.
ca: El codi ha d’estar present en aquest lloc des de l’inici del projecte, sense esperar a que hi hagi releases públiques.
es: El código tiene que estar presente en este sitio desde el inicio del proyecto, sin esperar a que haya releases públicas.

source: Create a public repository on a different site to the City Council GitHub
ca: Crear un repositori públic en un lloc diferent del GitHub de l’Ajuntament
es: Crear un repositorio público en un sitio diferente del GitHub del Ayuntamiento

source: There could be reasons that make it advisable to have the main repository (the one linked to the issue manager) on sites such as:
ca: Pot haver-hi motius que facin recomanable tenir el repositori principal (el vinculat al gestor d’incidències) en llocs com:
es: Puede haber motivos que hagan recomendable tener el repositorio principal (el vinculado al gestor de incidencias) en sitios como los siguientes:

source: The GitHub space of another organisation.
ca: L’espai GitHub d’una altra organització.
es: El espacio GitHub de otra organización

source: Bitbucket or other similar platforms.
ca: BitBucket o d’altres plataformes similars.
es: BitBucket u otras plataformas similares.

source: A Gitlab portal of an organisation participating in developing the project (or any future Barcelona City Council Gitlab portal).
ca: Un portal Gitlab d’alguna organització que participi en el desenvolupament del projecte (o en un futur un portal Gitlab de l’Ajuntament de Barcelona).
es: Un portal Gitlab de alguna organización que participe en el desarrollo del proyecto (o, en el futuro, un portal Gitlab del Ayuntamiento de Barcelona).

source: Some of these reasons could be:
ca: Alguns d’aquests motius poden ser:
es: Algunos de estos motivos pueden ser los siguientes:

source: It is a project many public sector participants intervene in and a consortium or ad-hoc organisation is set up.
ca: És un projecte on intervenen més participants del sector públic, i es crea una consorci o organització ad-hoc.
es: Es un proyecto en el que intervienen más participantes del sector público, y se crea un consorcio u organización ad hoc.

source: The development company exercises strong leadership over the project, more than the City Council might do, and wants the basic infrastructure under its control.
ca: L’empresa que desenvolupa té un fort lideratge sobre el projecte, més gran que el que pugui tenir l’Ajuntament, i vol tenir la infraestructura bàsica sota el seu control.
es: La empresa que desarrolla tiene un fuerte liderazgo sobre el proyecto, mayor que el que pueda tener el Ayuntamiento, y quiere tener la infraestructura básica bajo su control.

source: In opting for this alternative, it must be borne in mind that:
ca: Si s’opta per aquesta alternativa, s’ha de tenir en compte que:
es: Si se opta por esta alternativa, debe tenerse en cuenta lo siguiente:

source: We cannot give up Git as our version control system. It is currently the most widely used tool which all developers are familiar with and it offers some good practices for open project management which would be much more confusing with older systems (such as CSV or Subversion). If certain procedures have to be performed on another tool, for example, Subversion, the solution is to do the development in open on Git, and keep a Subversion mirror automated using the command `git ``svn`` ``dcommit`, as explained, for example, at http://www.kerrybuckley.org/2009/10/06/maintaining-a-read-only-svn-mirror-of-a-git-repository/.
ca: No podem renunciar a Git com a sistema de control de versions: és l’eina molt majoritàriament utilitzada avui en dia i que tots els desenvolupadors coneixen, i facilita unes bones pràctiques de gestió de projectes en obert que amb sistemes més antics (com CSV o Subversion) resulten molt més farragoses. Si determinats procediments s’han d’executar necessàriament sobre una altra eina, per exemple Subversion, la solució és fer el desenvolupament en obert sobre Git, i mantenir un mirall Subversion automatitzat utilitzant la comanda `git` `svn`` ``dcommit`, com s’explica per exemple a http://www.kerrybuckley.org/2009/10/06/maintaining-a-read-only-svn-mirror-of-a-git-repository/.
es: No podemos renunciar a Git como sistema de control de versiones: es la herramienta utilizada de manera mayoritaria hoy en día y todos los desarrolladores la conocen, y facilita unas buenas prácticas de gestión de proyectos colaborativos que con sistemas más antiguos (como CSV o Subversion) resultan mucho más costosas. Si determinados procedimientos se tienen que ejecutar necesariamente sobre otra herramienta, por ejemplo, Subversion, la solución es hacer el desarrollo en abierto sobre Git y mantener un espejo Subversion automatizado utilizando el comando `git` `svn`` ``dcommit`, como se explica, por ejemplo, en http://www.kerrybuckley.org/2009/10/06/maintaining-a-read-only-svn-mirror-of-a-git-repository/.

source: Either way, there has to be an up-to-date replica of the main repository in the City Council GitHub space, to show all the contributions made to free software projects.
ca: En qualsevol cas hi ha d’haver una rèplica actualitzada del repositori principal a l’espai GitHub de l’Ajuntament, per donar visibilitat a totes les contribucions a projectes de codi obert que realitza.
es: En cualquier caso, debe haber una réplica actualizada del repositorio principal en el espacio GitHub del Ayuntamiento, para dar visibilidad a todas las contribuciones en proyectos de software libre que realiza.

source: The `README` file content (and markup) in the City Council GitHub space, the GitHub.io space and the other sites with a source code link will indicate which is (or are) the main repository (repositories) where development is carried out.
ca: Al fitxer `README` contingut (i mostrat) a l’espai GitHub de l’Ajuntament, a l’espai GitHub.io i a la resta de llocs amb enllaç al codi font, d’indicarà quin és el repositori (o repositoris) principal on es porta a terme el desenvolupament.
es: En el fichero README contenido, y mostrado, en el espacio GitHub del Ayuntamiento, en el espacio GitHub.io y en el resto de sitios con enlace al código fuente, se indicará cuál es el repositorio o repositorios principales donde se lleva a cabo el desarrollo.

source: Whichever they are, both the issue managing tool and the continuous integration system must be public and capable of being used by everyone, without paying subscriptions for any service.
ca: Siguin on siguin, tant l’eina de gestió d’incidències com el sistema d’integració continua han de ser públics i s’han de poder utilitzar per part de tothom sense pagar subscripcions a cap servei.
es: Estén donde estén, tanto la herramienta de gestión de incidencias como el sistema de integración continua tienen que ser públicos y se deben poder utilizar por parte de todo el mundo sin pagar suscripciones a ningún servicio.

source: All the project source code has to be downloadable by anyone at any time. GitHub makes that easy by providing buttons for downloading a `zip` file or showing the necessary commands for cloning the repository using Git. If GitHub is not used, the repository's public site must also provide both these types of download (`zip` file or `tar.gz` and command `git clone`).
ca: Tot el codi font del projecte ha de ser descarregable per qualsevol persona en tot moment. GitHub facilita això proveint de botons per descarregar un arxiu zip o bé mostrant les comandes necessàries per clonar el repositori utilitzant Git. Si No es fa servir GitHub s’ha d’aconseguir que el lloc públic del repositori faciliti també aquestes dues modalitats de descàrrega (arxiu `zip` o `tar.gz` i comanda `git clone`).
es: Todo el código fuente del proyecto tiene que ser descargable por cualquier persona en todo momento. GitHub facilita esto proveyendo de botones para descargar un archivo `zip` o bien mostrando los comandos necesarios para clonar el repositorio utilizando Git. Si no se utiliza GitHub se tiene que conseguir que el sitio público del repositorio facilite también estas dos modalidades de descarga (archivo `zip` o `tar.gz` y comando `git clone`).

source: Use the [.line-through]#GitHub# main repository web interface as the project development website
ca: Utilitzar el respositori de [.line-through]#GitHub# com la web de desenvolupament del projecte
es: Utilizar el repositorio de [.line-through]#GitHub# como la web de desarrollo del proyecto

source: The website's home page will be a `README` file in the repository root directory. This file can be in plain text, Markdown or other brand languages supported by GitHub and which the latter interprets and formats when the page is visited.
ca: La portada de la web serà un fitxer `README` a l’arrel del repositori. Aquest fitxer pot estar en format text pla, Markdown, o d’altres llenguatges de marques suportats per GitHub i que aquest interpreta i formata quan es visita la pàgina.
es: La portada de la web será un fichero README en la raíz del repositorio. Este fichero puede estar en formato de texto plano, Markdown u otros lenguajes de marcas soportados por GitHub y que este interpreta y formatea cuando se visita la página.

source: Establish access permissions to the main repository adapted to each type of participant
ca: Establir permisos al repositori principal adequats a cada tipus de participant
es: Establecer permisos en el repositorio principal adecuados a cada tipo de participante

source: Document
es: Documento

source: GitHub uses the concept of repository *owner*, which corresponds to an account that the City Council has as an organisation (`ajuntamentdebarcelona`). The other permissions are outlined in the submeasures.
ca: GitHub té el concepte de propietari (owner) d’un repositori, que correspondrà a un compte que l’Ajuntament té com a organització (`ajuntamentdebarcelona`). La resta de permisos es detallen a les submesures.
es: GitHub tiene el concepto de propietario (owner) de un repositorio, que corresponderá a una cuenta que el Ayuntamiento tiene como organización (`ajuntamentdebarcelona`).

source: Anyone working for IMI who has a personal account at GitHub and is part of the organisation `ajuntamentdebarcelona` will have admin permissions.
ca: Qualsevol treballador de l’IMI que tingui un compte personal a GitHub que formi part de la organització `ajuntamentdebarcelona` tindrà permisos d”administrador.
es: Cualquier trabajador del IMI que tenga una cuenta personal en GitHub que forme parte de la organización ajuntamentdebarcelona tendrá permisos de administrador.

source: Repository *administrator* permissions can be given to IMI staff and, optionally, to each person in an external organisation participating in the development under contracts with IMI.
ca: Es pot donar permisos d”*administrador* del repositori a persones de l’IMI, opcionalment, una persona de cada entitat externa que participa en el desenvolupament sota contractes amb l’IMI.
es: Se pueden dar permisos de administrador del repositorio a personas del IMI y, opcionalmente, a una persona de cada entidad externa que participa en el desarrollo bajo contratos con el IMI.

source: Sub-measures:
ca: Submesura:
es: Submedidas:

source: Give all development team members permission to write in the main repository. That includes in-house staff and subcontracted people. Also make the current list of _committers_ public in a file in the repository root directory called `MAINTAINERS`. It must contain the name and email address of each person.
ca: Donar permís d’escriptura al repositori principal a totes les persones de l’equip de desenvolupament. Això inclou tant persones internes com subcontractades. A més, fer pública la llista actual de _commiters_ en un fitxer a l’arrel del repositori anomenat `MAINTAINERS`. Ha de contenir el nom i adreça de correu electrònic de cada persona.
es: Esto incluye tanto a personas internas como a personas subcontratadas. Además, hacer pública la lista actual de _commiters_ en un fichero en la raíz del repositorio denominado MAINTAINERS.. Debe contener el nombre y dirección de correo electrónico de cada persona.

source: Give everyone permission to read the main repository. Everyone must be able to read and clone the code.
ca: Donar permís de lectura del repositori principal a tothom
es: Dar permiso de lectura del repositorio principal a todo el mundo Todo el mundo tiene que poder leer y clonar el código.

source: Give trusted outside developers permission to write in the main repository
ca: Donar permís d’escriptura al repositori principal a desenvolupadors externs confiables
es: Dar permiso de escritura en el repositorio principal a desarrolladores externos confiables

source: If someone has been making quality contributions to the project for a long time, on a similar level to people hired by the City Council, they can be rewarded with permission to write in the repository. This runs a low risk because version control means that everything is traceable and changes are reversible.
ca: Si una persona porta molt temps fent contribucions de qualitat al projecte, a un nivell semblant que les persones contractades per l’Ajuntament, se la pot premiar amb un permís per escriure al repositori. Es corre un risc baix amb això, perquè el control de versions fa que tot sigui traçable i els canvis revertibles.
es: Si una persona lleva mucho tiempo haciendo contribuciones de calidad al proyecto, a un nivel parecido al de las personas contratadas por el Ayuntamiento, se la puede premiar con un permiso para escribir en el repositorio. Se corre un riesgo bajo con ello, porque el control de versiones hace que todo sea trazable, y los cambios, reversibles.

source: However, to avoid any misunderstanding, it must be made clear to that person what the governance rules will be and who has the last word when it comes to accepting contributions.
ca: Se li ha d’aclarir, per evitar mal entesos, quines seran les regles de governança i qui seguirà tenint la darrera paraula a l’hora d’acceptar contribucions.
es: Debe aclararse, para evitar malentendidos, cuáles serán las reglas de gobernanza y quién seguirá teniendo la última palabra a la hora de aceptar contribuciones.

source: Integrate external contributions into the main repository by means of Pull/Merge Requests
ca: Integrar les contribucions externes al repositori principal mitjançant el mecanisme de Pull Request
es: Integrar las contribuciones externas en el repositorio principal mediante el mecanismo de pull request

source: As anyone can clone the main repository and modify their copy, we don’t need to give write permissions to anyone who is not part of the main development team. Everyone who would like to integrate a series of changes in the product must submit us a Pull Request in GitHub
ca: Com que qualsevol pot clonar el repositori principal i fer modificacions a la seva còpia, no necessitem donar permisos d’escriptura a ningú que no formi part de l’equip principal de desenvolupament. Tothom que vulgui acabar integrant un conjunt de canvis al producte ens ha de fer un Pull Request a GitHub.
es: Como cualquiera puede clonar el repositorio principal y hacer modificaciones en su copia, no se necesita dar permisos de escritura a nadie que no forme parte del equipo principal de desarrollo. Quienes quieran acabar integrando un conjunto de cambios en el producto nos tienen que hacer un pull request en GitHub.

source: Upload translations from the README file to the main repository
ca: Pujar traduccions del fitxer README al repositori principal
es: Subir traducciones del fichero README al repositorio principal

source: If the project’s potential users are mainly local, it might be a good idea to translate the contents of the `README` file or part of them. That can be done by putting new files in the root directory of the repository, with names such as (assuming that the markup language used is Markdown, and therefore the extension is `.md`): `README.ca.md` or `README.es.md`. In this case it is worth linking all the translations with each other at the start of each file. An example can be seen at https://github.com/tiimgreen/github-cheat-sheet.
ca: Si els potencials usuaris del projecte son principalment locals, pot ser convenient traduir el contingut del fitxer `README` o part del mateix. Això es pot fer posant nous fitxers a l’arrel del repositori, amb noms com (suposant que el llenguatge de marques utilitzat sigui Markdown, i d’aquí l’extensió `.md`): `README.ca.md` o `README.es.md`. En aquest cas convé enllaçar totes aquestes traduccions entre elles, al principi de cada fitxer. Un exemple es pot veure a https://github.com/tiimgreen/github-cheat-sheet.
es: Si los usuarios potenciales del proyecto son principalmente locales, puede ser conveniente traducir el contenido del fichero README o parte de él. Eso se puede hacer poniendo nuevos ficheros en la raíz del repositorio, con nombres como README.ca.md o README.es.md (suponiendo que el lenguaje de marcas utilizado sea Markdown; de aquí la extensión .md). En este caso, conviene enlazar todas estas traducciones entre ellas, al principio de cada fichero. Se puede ver un ejemplo en https://github.com/tiimgreen/github-cheat-sheet.

source: Specify a project contact person in the README file
ca: Especificar al README una persona de contacte del projecte
es: Especificar en el README una persona de contacto del proyecto

source: Include an email address.
ca: Incloure una adreça de correu electrònic.
es: Hay que incluir una dirección de correo electrónico.

source: Use English as the language for all development
ca: Utilitzar l’anglès com a llengua per a tot el desenvolupament
es: Utilizar el inglés como idioma para todo el desarrollo

source: The following must all be in English
ca: Han d’estar obligatòriament en anglès:
es: Tienen que estar obligatoriamente en inglés

source: Comments that accompany the code itself.
ca: Els comentaris que acompanyen el propi codi
es: Los comentarios que acompañan al propio código.

source: Any document referring to the product’s design and architecture.
ca: Qualsevol document referent al disseny i l’arquitectura del producte
es: Cualquier documento en lo referente al diseño y la arquitectura del producto.

source: All the comments on the commits in the repository.
ca: Tots els comentaris dels commit al repositori
es: Todos los comentarios de los commit en el repositorio

source: All the entries in the issue manager and the discussion threads that flow from them.
ca: Totes les entrades al gestor d’incidències i els fils de discussió que se’n deriven
es: Todas las entradas al gestor de incidencias y los hilos de discusión que se derivan

source: All the discussion threads that accompany each pull request.
ca: Els fils de discussió que acompanyen cada petició d’aportació (pull request)
es: Los hilos de discusión que acompañan cada petición de aportación (pull request)

source: The `README` file of the main repository.
ca: El fitxer `README` del repositori principal
es: El fichero README del repositorio principal.

source: The `INSTALL` file.
ca: El fitxer `INSTALL`
es: El fichero INSTALL

source: The `CONTRIBUTING` file.
ca: El fitxer `CONTRIBUTING`
es: El fichero CONTRIBUTING

source: The `CONTRIBUTORS` file.
ca: El fitxer `CONTRIBUTORS`
es: El fichero CONTRIBUTORS

source: The `LICENSE` file.
ca: El fitxer `LICENSE`
es: El fichero LICENSE

source: If the issue manager lets anyone enter issues and one is entered in another language, someone in the team has to be responsible for getting it translated or asking the author to translate it.
ca: En el cas del gestor d’incidències, si aquest deixa introduir-les a qualsevol persona i se n’introdueix alguna en una altra llengua, algú de l’equip s’ha d’encarregar de traduir-la, o bé de sol·licitar a l’autor que la tradueixi.
es: En el caso del gestor de incidencias, si este permite introducirlas a cualquier persona y se introduce alguna en otro idioma, un miembro del equipo debe encargarse de traducirla, o bien solicitar al autor que la traduzca.

source: Do not upload to the repository binary files or files that result from build (with exceptions)
ca: No pujar al repositori fitxers binaris ni fitxers producte del procés de build (amb excepcions)
es: No subir al repositorio ficheros binarios ni ficheros producto del proceso de build (con excepciones)

source: Small images (icons, logos, etc.)
ca: Petites imatges (logos generals del projecte, etc.)
es: Pequeñas imágenes (logos generales del proyecto, etcétera)

source: Keep the configuration information in separate files and in a different private repository
ca: Mantenir la informació de configuració en fitxers separats i en un repositori privat diferent
es: Mantener la información de configuración en ficheros separados y en un repositorio privado diferente

source: This makes it easier to reuse the code. It is incorrect to put the configuration:
ca: Això facilita la reutilització del codi. És incorrecte posar la configuració:
es: Eso facilita la reutilización del código. Es incorrecto poner la configuración:

source: Hardwired in the code itself (see the ref:measure M_A69 <measure_M_A69>.
ca: Hardwired en el propi codi (veure la ref:mesura M_A69 <mesura_M_A69>.
es: Hardwired en el propio código (ver la ref: medida M_A69 <mesura_M_A69>).

source: In files where commits (changes) are made in the same repository as the code.
ca: En fitxers dels que es fa commit (canvis) al mateix repositori que conté el codi.
es: En ficheros de los que se hace commit en el mismo repositorio que contiene el código.

source: Do not upload sensitive information regarding users, the City Council or third parties to the repository
ca: No pujar al repositori informació sensible d’usuaris, de l’Ajuntament o de tercers
es: No subir al repositorio información sensible de usuarios, del Ayuntamiento o de terceros

source: Procurement
ca: Contractar
es: Contratar

source: For example: configurations, usernames and passwords, public keys and other real credentials used in the production system.
ca: Com pugui ser: configuracions, usuaris i contrasenyes, claus públiques o d’altres credencials reals usades en el sistema en producció.
es: Como puede ser configuraciones, usuarios y contraseñas, claves públicas u otras credenciales reales usadas en el sistema en producción.

source: Establish penalties (serious breach) in the contract performance conditions for breaching this rule.
ca: A les condicions d’execució del contracte, establir penalitzacions (falta greu) si s’infringeix aquesta regla.
es: En las condiciones de ejecución del contrato, hay que establecer penalizaciones (falta grave) si se infringe esta regla.

source: Re-synchronise own repository with the upstream project repository weekly
ca: Re-sincronitzar cada setmana el repositori propi amb el repositori del projecte upstream
es: Resincronizar cada semana el repositorio propio con el repositorio del proyecto upstream
