Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/technical-infrastructure.po
Languages: ca, es

source: [[repositori-de-codi-i-control-de-versions]]To finally enable our changes to be integrated and our defect notifications to make sense.
ca: [[repositori-de-codi-i-control-de-versions]]Per permetre finalment integrar els nostres canvis, i que les nostres notificacions de defectes tinguin sentit.
