Repository: AjuntamentdeBarcelona/floss-guide-bcn-en
Catalog: po_files/*/technical-infrastructure.po
Languages: ca, es

source: Technical infrastructure
ca: Infraestructura tècnica
es: Infraestructura técnica

source: The technical infrastructure required for hosting a free software project usually consists of various elements and tools that are often interlinked in complex ways. In this chapter we recommend some common tools and practices for using them in the sector.
ca: La infraestructura tècnica necessària per a allotjar un projecte de programari lliure consta típicament de diferents elements i eines, molts cops vinculades entre sí de maneres complexes. En aquest capítol recomanem algunes eines i pràctiques d’ús comú en el sector.
es: La infraestructura técnica necesaria para alojar un proyecto de software libre consta típicamente de diferentes elementos y herramientas, muchas veces vinculadas entre sí de maneras complejas. En este capítulo recomendamos algunas herramientas y prácticas de uso común en el sector.

source: A general principle that is spelt out in the measures in the chapter is that people who participate in a project must never be compelled to install proprietary software on their equipment.
ca: Un principi general que es veu concretat en les mesures d’aquest capítol és que les persones que participen en un projecte mai s’han de veure obligades a instal·lar programari privatiu a les seves màquines.
es: Un principio general que se ve concretado en las medidas de este capítulo es que las personas que participan en un proyecto nunca se tienen que ver obligadas a instalar software privativo en sus máquinas.

source: Websites associated with the project
ca: Llocs web associats al projecte
es: Sitios web asociados al proyecto

source: A typical software project might have two websites:
ca: Un projecte de programari pot tenir típicament dos tipus de lloc web:
es: Un proyecto de software puede tener típicamente dos tipos de sitio web:

source: *A development website* for people contributing code or technical documentation to the project, whether they are hired by the City Council or not.
ca: *Una web de desenvolupament*, orientada a persones que contribueixen al projecte amb codi o documentació tècnica, contractades per l’Ajuntament o no.
es: *Una web de desarrollo*, orientada a personas que contribuyen al proyecto con código o documentación técnica contratadas por el Ayuntamiento o no

source: *A website for users and participants in general*. That includes people or organisations that might want to install and use the software outside the City Council but also people who are interested in the project even though they are not direct users of the software. On this website we need to facilitate and encourage people to participate in the project with contributions that are less (or not at all) technical: funding, user documents, pre-release testing, dissemination, translations and so on.
ca: *Una web orientada a persones usuàries i participants en general*. Això inclou a persones o entitats que puguin voler instal·lar i usar el programari fora de l’Ajuntament, però també a gent interessada en el projecte encara que no siguin usuàries directes del programari. En aquesta web s’ha de facilitar i incentivar a participar en el projecte amb contribucions menys (o gens) tècniques: finançament, documentació d’usuària, test de pre-releases, difusió, traduccions, etcètera.
es: *Una web orientada a personas usuarias y participantes en general*. Eso incluye a personas o entidades que puedan querer instalar y usar el software fuera del Ayuntamiento, pero también a personas interesadas en el proyecto aunque no sean usuarias directas del software. En esta web se tiene que facilitar la participación en el proyecto e incentivarla con contribuciones menos (o nada) técnicas: financiación, documentación de usuario, test de pre-releases, difusión, traducciones, etcétera.

source: Usually both types of content are necessary but it is not always necessary to be in two separate places, with different domain names. In each project it leads, the City Council will have to assess to what extent the needs and mentalities of the two sets of people are different, therefore making it impossible for a single website model to accommodate both.
ca: Normalment els dos tipus de contingut son necessaris, però no sempre cal que es trobin en dos llocs separats, amb noms de domini diferents. En cada projecte que lideri, l’Ajuntament haurà de valorar fins a quin punt les necessitats i mentalitats dels dos conjunts de persona son diferents i resulta per tant impossible que un únic model de web s’adeqüi als dos grups.
es: Normalmente los dos tipos de contenido son necesarios, pero no siempre se requiere que se encuentren en dos sitios separados, con nombres de dominio diferentes. En cada proyecto que lidere, el Ayuntamiento tendrá que valorar hasta qué punto las necesidades y mentalidades de los dos conjuntos de personas son diferentes, y resulta, por lo tanto, imposible que un único modelo de web se adecue a los dos grupos.

source: The section <<Code repository and version control>> explains how to set up the development site, the only one required from the outset. We can assess if there is also a need for a site geared towards other participant profiles as the project grows.
es: En el apartado <<Code Repositorio de código y control de versiones>> se explica cómo crear la web de desarrollo, que es la única que se necesita desde el principio. A medida que el proyecto crece, se puede valorar si se requiere también un sitio orientado a otros perfiles de participante.

source: What is useful is for the project to have its own domain name (or a permanent URL under a City Council domain) from the outset. If necessary, this could be redirected to where the project website is.
ca: El que sí és interessant tenir des del principi és un nom de domini propi (o una URL permanent sota algun domini de l’Ajuntament), que si cal es pugui redirigir cap a on es trobi inicialment la web del projecte (possiblement un lloc com GitHub).
es: Lo que sí es interesante tener desde el principio es un nombre de dominio propio (o una URL permanente bajo algún dominio del Ayuntamiento), que, si es necesario, se pueda redirigir hacia donde se encuentre inicialmente la web del proyecto (posiblemente un sitio como GitHub).

source: Keep a permanent project URL and always use it to refer to the project
ca: Reservar una URL permanent per al projecte, i usar-la sempre per fer-hi referència
es: Reservar una URL permanente para el proyecto, y usarla siempre para hacer referencia a este

source: Day1
ca: Dia1
es: Día1

source: Integration
ca: Integració
es: Integración

source: NewProduct
ca: NouProducte
es: NuevoProducto

source: Publication
ca: Publicació
es: Publicación

source: This means from the outset the City Council having the URL that will serve to identify the project under its control. Even if the project website is hosted by a site such as GitHub, redirecting it will enable the same address to be kept public if it is decided to move the development website in the future.
ca: Es tracta que des del començament l’Ajuntament tingui sota el seu control la URL que es farà servir per identificar el projecte a Internet. Encara que la web del projecte es trobi allotjada en un lloc com GitHub, utilitzar una redirecció permetrà en un futur, si es decideix moure de lloc la web de desenvolupament, mantenir la mateixa adreça pública.
es: Se trata de que desde el principio el Ayuntamiento tenga bajo su control la URL que se utilizará para identificar el proyecto en internet. Aunque la web del proyecto se encuentre alojada en un sitio como GitHub, utilizar una redirección permitirá, por ejemplo si en el futuro se decide mover de sitio la web de desarrollo, mantener la misma dirección pública.

source: There are two options:
ca: Hi ha dues opcions:
es: Existen dos opciones:

source: Set aside a permanent URL under a City Council-owned domain.
ca: Reservar una URL permanent sota algun domini propietat de l’Ajuntament.
es: Reservar una URL permanente bajo algún dominio propiedad del Ayuntamiento.

source: Acquire one (or more) domain name(s) for the project.
ca: Comprar un (o més) nom(s) de domini per al projecte.
es: Comprar uno o más nombres de dominio para el proyecto.

source: Set up a website for non-technical participation based on free software technologies
ca: Crear una web orientada a la participació no tècnica, que es basi en tecnologies lliures
es: Crear una web orientada a la participación no técnica, que se base en tecnologías libres

source: This site can be created at the opportune moment, when the project achieves significant size and projection.
ca: Aquesta web es pot crear en el moment que es consideri oportú, quan el projecte assoleixi una mida o projecció significatives.
es: Esta web se puede crear en el momento que se considere oportuno, cuando el proyecto alcance un tamaño o proyección significativos.

source: It could be a multilingual site. Each project has to decide which languages it should be translated into, depending on its priority audiences.
ca: Pot ser una web multilingüe. Cada projecte ha de decidir a quines llengües traduir-la en funció de quins públics resultin prioritaris.
es: Puede ser una web multilingüe. Cada proyecto debe decidir a qué idiomas traducirla en función de qué públicos resulten prioritarios.

source: This site must include:
ca: Aquest lloc web ha d’incloure:
es: Este sitio web tiene que incluir lo siguiente:

source: A link to the download site, with instructions on how to install the program. This link must feature prominently on the home page.
ca: Un enllaç a la web de descàrrega, amb instruccions de com instal·lar el programari. Aquest enllaç ha de ser ben visible a la portada.
es: Un enlace a la web de descarga, con instrucciones sobre cómo instalar el software. Este enlace tiene que estar bien visible en la portada.

source: A “Get involved” or “Community” section with information on the different ways of getting involved in the project. This link must also feature prominently on the home page.
ca: Un apartat "Get Involved" o "Community" on s’informa de les diferents maneres d’involucrar-se en el projecte. També ha d’estar ben visible a la portada.
es: Un apartado “Get involved” o “Community” donde se informa de las diferentes maneras de involucrarse en el proyecto. También tiene que estar bien visible en la portada.

source: A link to the development site. This could either be in the Community section or on the home page, with a link saying “Developers” or a “Fork on GitHub” link.
ca: Un enllaç a la web de desenvolupament. Aquest es pot trobar, o bé a l’apartat Community, o bé a la portada, per exemple amb un enllaç que digui "Developers" o bé un enllaç del tipus "Fork on GitHub".
es: Un enlace a la web de desarrollo. Este se puede encontrar en el apartado “Community” o en la portada, por ejemplo, con un enlace denominado “Developers” o bien un enlace del tipo “Fork on GitHub”.

source: There are many tools and frameworks for managing content and publishing very good quality open websites, so it should not be a problem finding one adapted to the project’s needs: Drupal, Wordpress (without the exclusive extensions) and lots more.
ca: Existeixen moltes eines i frameworks de gestió de contingut i publicació de llocs web lliures i de qualitat excel·lent, així que no hauria de ser un problema trobar-ne un que s’ajusti a les necessitats del projecte: Drupal, Wordpress (sense les extensions privatives), i molts més.
es: Existen muchas herramientas y frameworks de gestión de contenido y publicación de sitios web libres y de excelente calidad, de modo que no tendría que ser un problema encontrar uno que se ajuste a las necesidades del proyecto: Drupal, Wordpress (sin las extensiones privativas), y muchos más.

source: Code repository and version control
ca: Repositori de codi i control de versions
es: Repositorio de código y control de versiones

source: A key element of the project development website is a code repository (public and under version control) which serves as a base for centralising modifications that form part of each new product release.
ca: Un element central de la web de desenvolupament d’un projecte és un repositori de codi (públic i sota control de versions) que serveixi de base per centralitzar les modificacions que han de formar part de cada nova entrega release del producte.
es: Un elemento central de la web de desarrollo de un proyecto es un repositorio de código —público y bajo control de versiones— que sirva de base para centralizar las modificaciones que tienen que formar parte de cada nueva entrega (release) del producto.

source: In the `NewProduct` or `Plugin` use-case, the City Council will have to create this repository. In the case of an `Integration` or `Adaptation`, the Council will have its own copy (clone or fork) of the original (upstream) repository, where the documents corresponding to the modifications of interest will be centralised. We will call this repository created by the City Council, which will be used for original product releases or to centralise the contributions to an external project, the *main repository*. There could be many other public and private copies of the code.
ca: En l’escenari `NouProducte` o `Plugin` l’Ajuntament haurà de crear aquest repositori. En el cas d’una Integració o Adaptació, l’Ajuntament tindrà la seva pròpia còpia (clone o fork) del repositori original (upstream), on centralitzarà els treballs corresponents a les modificacions del seu interès. A aquest repositori que crea l’Ajuntament i que serveix, o bé per realitzar les entregues d’un producte original, o bé per centralitzar les contribucions a un projecte extern, en direm *repositori principal*. Poden existir moltes altres còpies públiques i privades del codi.
es: En el escenario `NuevoProducto` o `Plugin`, el Ayuntamiento tendrá que crear este repositorio. En el caso de una integración o adaptación, el Ayuntamiento tendrá su propia copia (clone o fork) del repositorio original (upstream), donde centralizará los trabajos correspondientes a las modificaciones de su interés. A este repositorio que crea el Ayuntamiento, y que sirve para realizar las entregas de un producto original o para centralizar las contribuciones a un proyecto externo, lo denominaremos repositorio principal. Pueden existir muchas otras copias públicas y privadas del código.

source: The City Council is in the process of reconsidering the platform to be used to host things like a public facing code repository or an issue manager for every project. The first free software projects of the City Council have used GitHub, but now we want to transition to a platform that:
ca: L’Ajuntament està reconsiderant la plataforma que s’utilitzarà per allotjar coses com els repositoris de codi públics o els gestors d'incidències de cada projecte. Els primers projectes de programari lliure de l’Ajuntament han utilitzat GitHub, però ara volem passar a una plataforma que:
es: El Ayuntamiento está reconsiderando la plataforma que se utilizará para alojar cosas como los repositorios de código públicos o los gestores de incidéncias de cada proyecto. Los primeros proyectos de software libre del Ayuntamiento han utilizado GitHub, pero ahora queremos pasar a una plataforma que:

source: Is free software.
ca: Sigui programari lliure.
es: Sea software libre.

source: Gives us control over the infrastructure used to develop software.
ca: Ens atorgui control sobre la infraestructura que utilitzem per desenvolupar progrmari.
es: Nos otorgue control sobre la infrastuctura que utilizamos para desarrollar software.

source: The many references to GitHub in the following sections are going to be replaced when a decision is reached.
ca: Les nombroses referències a GitHub en les següents seccions seran substituïdes quan es prengui una decisió.
es: Las numerosas referéncias a GitHub en las siguientes secciones serán sustituídas cuando se tome una decisión.

source: The GitHub advantages listed below must be taken into account to choose an alternative. Any alternative has to offer similar guarantees with regard to durability and sustainability. A viable possibility is a self-managed Gitlab installation. There is a successful use case for the public administration in France.
ca: Cal tenir en compte les avantatges de GitHub que s’indiquen a continuació per triar una alternativa. Qualsevol alternativa ha d’oferir garanties similars quant a durabilitat i sostenibilitat. Una possibilitat viable és una instal·lació autogestionada de Gitlab. Hi ha un cas d'ús reeixit per a l'administració pública a França.
es: Hace fatla tener en cuenta las ventajas de GitHub que se indiquen a continuación para escoger una alternativa. Cualquier alternativa tiene que ofrecer garantías similares cuanto a durabilidad y sostenibilidad. Una posibilidad viable es una instalación autogestionada de Gitlab. Hay un caso de uso reigido por la administración pública en Francia.

source: At time being, the main repository will be hosted at GitHub, as pointed below, a service that uses Git as a distributed version control system. The basic vocabulary and concepts for understanding how it works can be found at https://producingoss.com/en/vc.html#vc-vocabulary[Version Control Vocabulary].
ca: Com s’indica en les mesures de més avall, el repositori principal s’allotjarà a GitHub, un servei que utilitza Git com a sistema de control de versions distribuït. El vocabulari i conceptes fonamentals per entendre el seu funcionament es pot trobar a https://producingoss.com/en/vc.html#vc-vocabulary[Version Control Vocabulary].
es: Como se indica en las medidas de más abajo, el repositorio principal se alojará en GitHub, un servicio que utiliza Git como sistema de control de versiones distribuido. El vocabulario y los conceptos fundamentales para entender su funcionamiento se puede encontrar en https://producingoss.com/en/vc.html#vc-vocabulary[Version Control Vocabulary].

source: The advantages that made us choose GitHub as the default development platform were:
ca: Hi ha moltes alternatives viables i raonables a GitHub, i fins i tot algunes alternatives viables a Git com a programari de control de versions, però GitHub ofereix prous avantatges com per què sigui la opció per defecte:
es: Hay muchas alternativas viables y razonables a GitHub, e incluso algunas alternativas viables a Git como software de control de versiones, pero GitHub ofrece bastantes ventajas como para ser la opción por defecto:

source: Most developers are familiar with it and do not have to learn new tools and procedures ad-hoc for the project.
ca: La majoria de desenvolupadores la coneixen i no han d’aprendre noves eines i procediments ad-hoc per al projecte.
es: La mayoría de desarrolladores la conocen y no tienen que aprender nuevas herramientas y procedimientos ad hoc para el proyecto.

source: It launches the message that the project is open to collaboration.
ca: Llança el missatge de que el projecte està obert a col·laboració.
es: Lanza el mensaje de que el proyecto está abierto a colaboración.

source: It offers good integration with the rest of a product's technical and social infrastructure: issue managing, continuous integration, development communication channels, etc.
ca: Ofereix una bona integració amb la resta d’infraestructura tècnica i social d’un projecte: gestió d’incidències, integració contínua, canals de comunicació per a desenvolupament, etc.
es: Ofrece una buena integración con el resto de infraestructura técnica y social de un proyecto: gestión de incidencias, integración continua, canales de comunicación para desarrollo, etcétera.

source: It also enables (part of) a product's documentation to be saved and displayed, which could be a wiki. The presentation of the information is sufficiently user-friendly for us to put off building a website for project users and participants in general.
ca: Permet també guardar i mostrar (part de) la documentació d’un projecte, que pot ser una wiki. La presentació de la informació és suficientment agradable com per permetre aplaçar la construcció d’una web orientada a persones usuàries i participants en general del projecte.
es: Permite también guardar y mostrar (parte de) la documentación de un proyecto, que puede ser una wiki. La presentación de la información es lo bastante agradable como para permitir emplear la construcción de una web orientada a personas usuarias y participantes en general del proyecto.

source: It is the platform most widely used by free software projects and provides a lot of exposure.
ca: És la plataforma més utilitzada per projectes de codi obert, dóna molta visibilitat.
es: Es la plataforma más utilizada por proyectos de software libre, da mucha visibilidad.

source: *Drawback*: GitHub is not free software.
ca: *Inconvenient*: GitHub no és 100% codi obert.
es: *Inconveniente*: GitHub no es 100 % libre.

source: Although it is a free service for a wide range of possible uses, not all the infrastructure code behind GitHub is open and ultimately that means being dependent on a company whose future development we cannot predict.
ca: Tot i ser un servei gratuït per un gran ventall de possibles usos, no tot el codi de la infraestructura que hi ha darrera de GitHub és lliure, i en darrera instància s’està establint una dependència amb una empresa que no sabem com evolucionarà en el futur. Més endavant poden aparèixer opcions que facin reconsiderar aquesta recomanació de fer servir GitHub com a opció per defecte.
es: A pesar de ser un servicio gratuito para un gran abanico de posibles usos, no todo el código de la infraestructura que hay detrás de GitHub es libre, y en última instancia se está estableciendo una dependencia con una empresa que no sabemos cómo evolucionará en el futuro.

source: Create the main repository in the City Council [.line-through]#GitHub# public software forge
ca: Crear el repositori principal a l’espai GitHub de l’Ajuntament [.line-through]#GitHub# public software forge
es: Crear el repositorio principal en el espacio GitHub del Ayuntamiento

source: Adaptation
ca: Adaptació
es: Adaptación

source: In GitHub we will create a project `https://github.com/AjuntamentDeBarcelona/NOM-DEL-PROJECTE` where the code will be published. The City Council has an organisation-level account in GitHub called `ajuntamentdebarcelona`, which will be the repository owner.
ca: Es crearà a GitHub un projecte `https://github.com/AjuntamentDeBarcelona/NOM-DEL-PROJECTE` on es publicarà el codi. L’Ajuntament té creat dins de GitHub un compte a nivell d”organització anomenat `ajuntamentdebarcelona`, que serà el propietari owner del repositori.
es: Se creará en GitHub un proyecto https://github.com/AjuntamentDeBarcelona/NOM-DEL-PROJECTE donde se publicará el código. El Ayuntamiento tiene creada dentro de GitHub una cuenta para la organización denominada ajuntamentdebarcelona; este será el propietario (owner) del repositorio.

source: This does not mean there cannot be replicas (mirrors) of the repository, or parts of it, on other sites (GitHub spaces of other organisations or developers, the websites of companies awarded public contracts, etc.)
ca: Això no vol dir que no puguin haver-hi rèpliques (miralls) del repositori o parts del mateix en altres llocs (espais GitHub d’altres organitzacions, de desenvolupadors particulars, la pàgina web de les empreses adjudicatàries de contractes públics, etcètera).
es: Eso no significa que no pueda haber réplicas (espejos) del repositorio o partes de este en otros sitios (espacios GitHub de otras organizaciones, de desarrolladores particulares, la página web de las empresas adjudicatarias de contratos públicos, etcétera).
